anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
#include <Arduino.h>
#include <Preferences.h>
#include <SPI.h>
#include <TFT_eSPI.h>
#include <Wire.h>

#include <algorithm>
#include <array>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <cstring>
#include <new>

#include <esp_system.h>
#include <esp_sleep.h>
#include <esp_task_wdt.h>
#include <esp_timer.h>
#include <esp_app_desc.h>
#include <esp_attr.h>
#include <esp_heap_caps.h>
#include <esp_private/startup_internal.h>
#include <esp_private/system_internal.h>
#include <esp_rom_sys.h>
#include <hal/wdt_hal.h>
#include <soc/gpio_struct.h>
#include <soc/rtc.h>
#include <mbedtls/sha256.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/semphr.h>
#include <freertos/task.h>

#include "apps/library/LibraryController.h"
#include "apps/library/SessionCatalog.h"
#include "apps/capture/RadiotapPcap.h"
#include "apps/capture/InfraredCapture.h"
#include "apps/capture/InfraredCsv.h"
#include "apps/capture/SubGhzRawCapture.h"
#include "apps/capture/SubGhzRawCsv.h"
#include "apps/capture/WifiFrameCapture.h"
#include "apps/self_test/SelfTestController.h"
#include "apps/spectrum/Cc1101SignalFinder.h"
#include "apps/spectrum/Cc1101SpectrumController.h"
#include "apps/spectrum/Nrf24SignalFinder.h"
#include "apps/spectrum/Nrf24SpectrumController.h"
#include "apps/spectrum/SpectrumViewport.h"
#include "apps/survey/ProductSurveyAdmission.h"
#include "apps/survey/SurveyController.h"
#include "apps/survey/SurveyPipeline.h"
#include "apps/survey/SurveySourceController.h"
#include "apps/survey/SurveyWorkflow.h"
#include "apps/targets/TargetsController.h"
#include "apps/ble/BleCompanyDatabase.h"
#include "apps/ble/BleDeviceCatalog.h"
#include "apps/ble/BleDeviceIntelligence.h"
#include "apps/ble/BleDeviceNavigationOrder.h"
#include "apps/wifi/WifiNetworkCatalog.h"
#include "apps/wifi/WifiNetworkNavigationOrder.h"
#include "apps/wifi/WifiDeviceCatalog.h"
#include "apps/wifi/WifiDeviceNavigationOrder.h"
#include "apps/wifi/WifiOuiDatabase.h"
#include "boards/esp32_div_v2/BoardProfile.h"
#include "domain/apps/AppCatalog.h"
#include "domain/hardware/HardwareInventory.h"
#include "domain/observations/Observation.h"
#include "drivers/ble/BlePassiveContract.h"
#include "drivers/radio/Cc1101PassiveSpectrum.h"
#include "drivers/radio/Nrf24PassiveSpectrum.h"
#include "drivers/radio/ShieldReceiverIdentity.h"
#include "drivers/wifi/WifiPassiveContract.h"
#include "kernel/runtime/AppRuntime.h"
#include "kernel/runtime/ResourceBroker.h"
#include "kernel/safety/SafetySupervisor.h"
#include "kernel/safety/WorkerDeadlineSupervisor.h"
#include "platform/arduino/BoardSafeOutputs.h"
#include "platform/arduino/BoardInfraredReceiver.h"
#include "platform/arduino/BoardCc1101PassiveSpectrum.h"
#include "platform/arduino/BoardNrf24PassiveSpectrum.h"
#include "platform/arduino/BoardShieldReceiverProbe.h"
#include "platform/arduino/ArduinoFsSessionStoreIo.h"
#include "platform/arduino/ArduinoLittleFsSessionStoreIo.h"
#include "platform/arduino/BoardSdFilesystem.h"
#include "platform/arduino/BoardStorageAdapter.h"
#include "platform/arduino/BoardTouchInput.h"
#include "platform/arduino/BoardBlePassiveScanner.h"
#include "platform/arduino/BoardSdSpiTransport.h"
#include "platform/arduino/BoardWifiPassiveScanner.h"
#include "platform/arduino/BoardWifiPassiveCapture.h"
#include "platform/arduino/DisposableOtaLittleFs.h"
#include "platform/arduino/RamSessionStoreIo.h"
#include "services/diagnostics/BootReport.h"
#include "services/diagnostics/HilSession.h"
#include "services/power/PowerSafetyPolicy.h"
#include "services/targets/CorrelationService.h"
#include "services/targets/SessionTargetAdmission.h"
#include "services/targets/SurveySessionTargetEvidenceLookup.h"
#include "services/targets/TargetService.h"
#include "services/survey/IngressTiming.h"
#include "services/survey/ObservationQueue.h"
#include "services/survey/SessionBatchPolicy.h"
#include "services/survey/SourceDegradation.h"
#include "services/survey/SourceTimeline.h"
#include "services/survey/SurveySession.h"
#include "storage/AtomicHead.h"
#include "storage/MediaDiscovery.h"
#include "storage/MountPolicy.h"
#include "storage/ProductStorePolicy.h"
#include "storage/ProductBootRetry.h"
#include "storage/ProductStartRetry.h"
#include "storage/SdReadOnlyProtocol.h"
#include "storage/SdIdentification.h"
#include "storage/SdIdentificationTransport.h"
#include "storage/SdSectorInspection.h"
#include "storage/SdSpiWireCodec.h"
#include "storage/SessionCodec.h"
#include "storage/SessionStore.h"
#include "storage/SessionStoreBoundary.h"
#include "storage/SessionStoreIoRouter.h"
#include "storage/StorageGuard.h"
#include "storage/StorageTiming.h"
#include "storage/TargetStateStore.h"
#include "ui/Pcf8574ButtonInput.h"
#include "ui/TouchTargets.h"
#include "ui/InterfaceSettingsController.h"
#include "ui/LanguageController.h"
#include "ui/UiComponents.h"
#include "ui/UiController.h"
#include "ui/UiStrings.h"
#include "ui/VisualTheme.h"
#include "ui/fonts/RobotoCondensedGfx.h"

namespace {

extern const std::uint8_t wifiOuiAssetStart[]
    asm("_binary_assets_oui_bin_start");
extern const std::uint8_t wifiOuiAssetEnd[]
    asm("_binary_assets_oui_bin_end");
extern const std::uint8_t bleCompanyAssetStart[]
    asm("_binary_assets_bluetooth_companies_bin_start");
extern const std::uint8_t bleCompanyAssetEnd[]
    asm("_binary_assets_bluetooth_companies_bin_end");

using leshy1::boards::esp32_div_v2::BoardProfile;
using leshy1::apps::library::LibraryController;
using leshy1::apps::library::LibraryEntry;
using leshy1::apps::library::LibraryView;
using leshy1::apps::library::SessionCatalog;
using leshy1::apps::library::SessionIntegrity;
using leshy1::apps::capture::PcapExportResult;
using leshy1::apps::capture::InfraredCapture;
using leshy1::apps::capture::InfraredCapturePlan;
using leshy1::apps::capture::InfraredCaptureState;
using leshy1::apps::capture::SubGhzRawCapture;
using leshy1::apps::capture::SubGhzRawCapturePlan;
using leshy1::apps::capture::SubGhzRawCaptureState;
using leshy1::apps::capture::SubGhzRawRssiSample;
using leshy1::apps::capture::WifiFrameCapturePlan;
using leshy1::apps::capture::WifiFrameCaptureState;
using leshy1::apps::self_test::SelfTestController;
using leshy1::apps::self_test::SelfTestFacts;
using leshy1::apps::self_test::SelfTestMode;
using leshy1::apps::self_test::SelfTestReport;
using leshy1::apps::self_test::SelfTestResultStatus;
using leshy1::apps::self_test::SelfTestView;
using leshy1::apps::spectrum::Cc1101SignalFinder;
using leshy1::apps::spectrum::Cc1101SignalFinderState;
using leshy1::apps::spectrum::Cc1101SpectrumController;
using leshy1::apps::spectrum::Cc1101SpectrumViewState;
using leshy1::apps::spectrum::Nrf24SignalFinder;
using leshy1::apps::spectrum::Nrf24SignalFinderState;
using leshy1::apps::spectrum::Nrf24SpectrumController;
using leshy1::apps::spectrum::Nrf24SpectrumMetric;
using leshy1::apps::spectrum::Nrf24SpectrumViewState;
using leshy1::apps::spectrum::SpectrumDisplayMode;
using leshy1::apps::spectrum::SpectrumViewport;
using leshy1::apps::survey::SurveyController;
using leshy1::apps::survey::ObservationHistory;
using leshy1::apps::survey::SurveyFilter;
using leshy1::apps::survey::SurveyPipeline;
using leshy1::apps::survey::SurveyPipelineProgress;
using leshy1::apps::survey::SurveyPipelineStatus;
using leshy1::apps::survey::SurveySetupActivation;
using leshy1::apps::survey::SurveySetupView;
using leshy1::apps::survey::SurveySourceController;
using leshy1::apps::survey::SurveySourceKind;
using leshy1::apps::survey::SurveySourceOption;
using leshy1::apps::survey::SurveySourceScope;
using leshy1::apps::survey::SurveySourceState;
using leshy1::apps::survey::SurveyView;
using leshy1::apps::survey::SurveyWorkflow;
using leshy1::apps::survey::SurveyWorkflowState;
using leshy1::apps::survey::SurveyWorkflowStatus;
using leshy1::apps::targets::TargetListRow;
using leshy1::apps::targets::TargetComparisonSide;
using leshy1::apps::targets::TargetProductBinding;
using leshy1::apps::targets::TargetsController;
using leshy1::apps::targets::TargetsLoadStatus;
using leshy1::apps::targets::TargetsView;
using leshy1::apps::targets::TargetsWorkspace;
using leshy1::apps::ble::BleDeviceCatalog;
using leshy1::apps::ble::BleCompanyDatabase;
using leshy1::apps::ble::BleDeviceKind;
using leshy1::apps::ble::BleDeviceNavigationOrder;
using leshy1::apps::ble::BleDeviceSignalStats;
using leshy1::apps::ble::BleSubtype;
using leshy1::apps::ble::BleTrackerKind;
using leshy1::apps::wifi::WifiNetworkCatalog;
using leshy1::apps::wifi::WifiNetworkNavigationOrder;
using leshy1::apps::wifi::WifiNetworkSignalStats;
using leshy1::apps::wifi::WifiDeviceCatalog;
using leshy1::apps::wifi::WifiDeviceObservation;
using leshy1::apps::wifi::WifiDeviceRecord;
using leshy1::apps::wifi::WifiDeviceNavigationOrder;
using leshy1::apps::wifi::WifiOuiDatabase;
using leshy1::apps::wifi::WifiDeviceGeneration;
using leshy1::apps::wifi::WifiDeviceState;
using leshy1::apps::wifi::WifiChannelLoadSnapshot;
using leshy1::domain::apps::AppCatalog;
using leshy1::domain::apps::AppMenuItem;
using leshy1::domain::hardware::CapabilityRecord;
using leshy1::domain::targets::TargetChangeKind;
using leshy1::domain::targets::TargetComparisonClass;
using leshy1::domain::targets::TargetCatalog;
using leshy1::domain::targets::CorrelationDecisionLog;
using leshy1::domain::targets::CorrelationProposal;
using leshy1::domain::targets::CorrelationDecision;
using leshy1::domain::targets::TargetId;
using leshy1::domain::targets::TargetRecord;
using leshy1::domain::hardware::CapabilityState;
using leshy1::domain::hardware::HardwareInventory;
using leshy1::domain::observations::Observation;
using leshy1::domain::observations::RadioKind;
using leshy1::drivers::ble::BleAdvertisementRecord;
using leshy1::drivers::radio::ShieldReceiverProbeReport;
using leshy1::drivers::radio::ShieldReceiverProbeStatus;
using leshy1::drivers::radio::Cc1101PassiveSample;
using leshy1::drivers::radio::Cc1101PassiveSpectrumPlan;
using leshy1::drivers::radio::Cc1101PassiveSpectrumReport;
using leshy1::drivers::radio::Cc1101PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSpectrumPlan;
using leshy1::drivers::radio::Nrf24PassiveSpectrumReport;
using leshy1::drivers::radio::Nrf24PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSweep;
using leshy1::drivers::wifi::WifiScanRecord;
using leshy1::kernel::runtime::AppRuntime;
using leshy1::kernel::runtime::LaunchStatus;
using leshy1::kernel::runtime::Resource;
using leshy1::kernel::runtime::ResourceBroker;
using leshy1::kernel::safety::SafetyReason;
using leshy1::kernel::safety::SafetyRetainedRecord;
using leshy1::kernel::safety::SafetyState;
using leshy1::kernel::safety::SafetySupervisor;
using leshy1::kernel::safety::SupervisedWorker;
using leshy1::kernel::safety::WorkerDeadlineSnapshot;
using leshy1::services::power::PowerSafetyPolicy;
using leshy1::services::power::PowerTelemetryState;
using leshy1::services::power::PowerWriteDisposition;
using leshy1::services::targets::TargetAction;
using leshy1::services::targets::TargetActionKind;
using leshy1::services::targets::TargetService;
using leshy1::services::targets::CorrelationAction;
using leshy1::services::targets::CorrelationActionKind;
using leshy1::services::targets::CorrelationDecisionStatus;
using leshy1::services::targets::CorrelationService;
using leshy1::services::targets::SurveySessionTargetEvidenceLookup;
using leshy1::apps::targets::TargetActionItem;
using leshy1::kernel::safety::WorkerDeadlineSupervisor;
using leshy1::platform::arduino::BoardSafeOutputs;
using leshy1::platform::arduino::BoardInfraredReceiver;
using leshy1::platform::arduino::InfraredReceiverReport;
using leshy1::platform::arduino::InfraredReceiverStatus;
using leshy1::platform::arduino::BoardCc1101PassiveSpectrum;
using leshy1::platform::arduino::BoardNrf24PassiveSpectrum;
using leshy1::platform::arduino::BoardShieldReceiverProbe;
using leshy1::platform::arduino::ArduinoFsSessionStoreIo;
using leshy1::platform::arduino::ArduinoFsSessionStoreWorkspace;
using leshy1::platform::arduino::ArduinoLittleFsSessionStoreIo;
using leshy1::platform::arduino::BoardSdFilesystem;
using leshy1::platform::arduino::BoardStorageAdapter;
using leshy1::platform::arduino::BoardTouchInput;
using leshy1::platform::arduino::TouchCalibrationSource;
using leshy1::platform::arduino::BoardBlePassiveScanner;
using leshy1::platform::arduino::BoardBlePassiveScanResult;
using leshy1::platform::arduino::BleRecordDisposition;
using leshy1::platform::arduino::BoardSdSpiTransport;
using leshy1::platform::arduino::BoardWifiPassiveScanner;
using leshy1::platform::arduino::BoardWifiPassiveCapture;
using leshy1::platform::arduino::BoardWifiPassiveScanResult;
using leshy1::platform::arduino::DisposableOtaLittleFs;
using leshy1::platform::arduino::WifiRecordDisposition;
using leshy1::platform::arduino::RamSessionStoreIo;
using leshy1::services::diagnostics::BootMetrics;
using leshy1::services::diagnostics::HilSession;
using leshy1::services::diagnostics::HilSessionStatus;
using leshy1::services::survey::SessionState;
using leshy1::services::survey::SessionStatus;
using leshy1::services::survey::CaptureMetadata;
using leshy1::services::survey::CaptureMetadataStatus;
using leshy1::services::survey::FramePayloadFormat;
using leshy1::services::survey::SourceFailureClass;
using leshy1::services::survey::SourceTimeline;
using leshy1::services::survey::SourceTimelineState;
using leshy1::services::survey::SourceTimelineStatus;
using leshy1::services::survey::SourceWindow;
using leshy1::services::survey::SourceWindowReason;
using leshy1::services::survey::SourceWindowState;
using leshy1::services::survey::SurveySession;
using leshy1::ui::UiAction;
using leshy1::ui::UiController;
using leshy1::ui::UiLanguage;
using leshy1::ui::InterfaceSetting;
using leshy1::ui::InterfaceSettingsController;
using leshy1::ui::InterfaceTheme;
using leshy1::ui::UiTextId;
using leshy1::ui::UiTextRole;
using leshy1::ui::LanguageController;
using leshy1::ui::Pcf8574ButtonInput;
using leshy1::ui::TouchPoint;
using leshy1::ui::TouchTarget;
using leshy1::ui::TouchTargetLayout;
using leshy1::ui::visual::Layout;
using leshy1::ui::visual::Palette;
using leshy1::ui::visual::Components;
using leshy1::ui::visual::Rect;
using leshy1::ui::visual::Tone;

constexpr std::uint32_t kConsoleBaud = 115200;
constexpr std::uint32_t kI2cHz = 100000;
constexpr std::uint8_t kInputProbeMaxAttempts = 8;
constexpr std::uint32_t kInputProbeRetryDelayMs = 5;
constexpr leshy1::kernel::runtime::ResourceOwner kSdIdentificationOwner = 2;
constexpr leshy1::kernel::runtime::ResourceOwner kWifiIngressOwner = 3;
constexpr leshy1::kernel::runtime::ResourceOwner kBootCatalogOwner = 4;
constexpr leshy1::kernel::runtime::ResourceOwner kLittleFsHilOwner = 5;
constexpr std::size_t kSdThroughputSamples = 32;
constexpr std::size_t kWifiIngressMaxSamples = 32;
constexpr std::uint64_t kWifiIngressP99EncodedBytesPerSecond = 546;
constexpr std::uint32_t kStorageRateSafetyMultiplier = 4;
constexpr std::uint64_t kStorageRequiredEncodedBytesPerSecond =
    kWifiIngressP99EncodedBytesPerSecond * kStorageRateSafetyMultiplier;
constexpr std::uint64_t kProductSurveyCommitBytes = 64U * 1024U;
constexpr std::uint64_t kProductSurveyReserveBytes = 1024U * 1024U;
constexpr unsigned kWifiPersistMaxScans = 8;
constexpr const char* kFullGuidedDisposableRunId = "full-guided-v10";
constexpr std::uint64_t kFullGuidedDisposableBytes = 64U * 1024U;
constexpr std::uint64_t kFullGuidedDisposableReserve = 1024U * 1024U;
constexpr std::uint8_t kFullGuidedReceiveSamples = 32;
constexpr std::uint8_t kFullGuidedInfraredSamples = 64;
constexpr const char* kSdSessionStorePrefix =
    "storage.sd.session-store disposable-write ";
constexpr const char* kSdSessionThroughputPrefix =
    "storage.sd.session-store throughput disposable-write ";
constexpr const char* kSdSessionBatchThroughputPrefix =
    "storage.sd.session-store batch-throughput disposable-write ";
constexpr const char* kWifiPersistPrefix =
    "survey.wifi.passive-persist disposable-write ";
constexpr const char* kSdSessionResetPrefix =
    "storage.sd.session-store reset disposable-write ";
constexpr const char* kSdSessionRecoverPrefix =
    "storage.sd.session-store recover disposable-read-only ";
constexpr const char* kSdSessionPowerCutPrefix =
    "storage.sd.session-store power-cut disposable-write ";
constexpr const char* kSdSessionPowerCutRecoverPrefix =
    "storage.sd.session-store power-cut-recover disposable-read-only ";
constexpr const char* kSdReadOnlyMountPrefix =
    "storage.sd.readonly-mount disposable-read-only ";
constexpr const char* kWifiIngressPrefix =
    "survey.wifi.passive-ingress measure passive-only ";
constexpr const char* kProductBootstrapPrefix =
    "storage.product.bootstrap disposable-write ";
constexpr const char* kProductEnrollPrefix =
    "storage.product.enroll disposable-read-only ";
constexpr const char* kLittleFsParityPrefix =
    "storage.littlefs.parity disposable-ota1 ";
constexpr const char* kLittleFsResetPrefix =
    "storage.littlefs.reset disposable-ota1 ";
constexpr const char* kLittleFsResetRecoverPrefix =
    "storage.littlefs.reset recover read-only ";
constexpr const char* kProductEnrollmentNamespace = "leshy1";
constexpr const char* kProductEnrollmentKey = "sd.cid.v1";
constexpr const char* kUiPreferencesNamespace = "leshy1-ui";
constexpr const char* kUiLanguageKey = "lang.v1";
constexpr const char* kUiBrightnessKey = "bright.v1";
constexpr const char* kUiThemeKey = "theme.v1";
HardwareInventory inventory;
AppCatalog appCatalog;
ResourceBroker resourceBroker;
AppRuntime appRuntime(resourceBroker);
SurveySession surveySession;
SurveyController surveyController(surveySession);
SurveySourceController surveySourceController;
SurveySession librarySession;
// Destructive storage fixtures and Self-Test are admitted only while the
// foreground Survey workflow is stopped. Reuse its bounded session instead of
// permanently reserving another 10 KiB on N16 boards without PSRAM.
SurveySession& littleFsResetSession = surveySession;
LibraryController libraryController;
SessionCatalog sessionCatalog;
struct TargetsProductRuntime final {
    TargetCatalog* catalogStorage = nullptr;
    CorrelationDecisionLog* decisionsStorage = nullptr;
    leshy1::services::targets::SessionCorrelationProposalSet*
        correlationsStorage = nullptr;
    leshy1::domain::targets::TargetComparisonResult* comparisonStorage =
        nullptr;
    TargetsWorkspace* workspaceStorage = nullptr;
    TargetsController* controllerStorage = nullptr;
    TargetsWorkspace& workspace;
    TargetsController& controller;

    TargetsProductRuntime(TargetCatalog* catalogValue,
                          CorrelationDecisionLog* decisionsValue,
                          leshy1::services::targets::
                              SessionCorrelationProposalSet* correlationsValue,
                          leshy1::domain::targets::TargetComparisonResult*
                              comparisonValue,
                          TargetsWorkspace* workspaceValue,
                          TargetsController* controllerValue)
        : catalogStorage(catalogValue),
          decisionsStorage(decisionsValue),
          correlationsStorage(correlationsValue),
          comparisonStorage(comparisonValue),
          workspaceStorage(workspaceValue),
          controllerStorage(controllerValue),
          workspace(*workspaceValue),
          controller(*controllerValue) {}
    ~TargetsProductRuntime() {
        delete controllerStorage;
        delete workspaceStorage;
        delete comparisonStorage;
        delete correlationsStorage;
        delete decisionsStorage;
        delete catalogStorage;
    }
};
TargetsProductRuntime* targetsProductRuntime = nullptr;
const char* targetsProductStatus = "not_loaded";
std::uint32_t targetsHeapFreeBefore = 0;
std::uint32_t targetsHeapFreeAfter = 0;
std::uint32_t targetsBlockedWriteAttempts = 0;
int targetsFilesystemMountError = 0;
bool targetsCleanupComplete = true;
TargetProductBinding targetsBaselineBinding{};
TargetProductBinding targetsCurrentBinding{};
bool targetsComparisonLoaded = false;
std::uint32_t targetsStateGeneration = 0;
leshy1::storage::RecoveryChoice targetsStateHead =
    leshy1::storage::RecoveryChoice::None;
enum class TargetsMutationState : std::uint8_t {
    Idle,
    Saving,
    Saved,
    Failed,
};
const char* targetsMutationStateName(TargetsMutationState state) {
    switch (state) {
        case TargetsMutationState::Idle: return "idle";
        case TargetsMutationState::Saving: return "saving";
        case TargetsMutationState::Saved: return "saved";
        case TargetsMutationState::Failed: return "failed";
    }
    return "failed";
}
struct TargetsMutationEvent final {
    const char* status = "not_started";
    bool persisted = false;
    bool catalogRecovered = false;
    bool cleanupComplete = false;
    bool favorite = false;
    TargetActionKind actionKind = TargetActionKind::SetFavorite;
    bool correlation = false;
    CorrelationActionKind correlationKind = CorrelationActionKind::Accept;
    CorrelationDecisionStatus correlationStatus =
        CorrelationDecisionStatus::InvalidArgument;
    std::array<char, TargetRecord::kNotesCapacity + 1> name{};
    std::uint16_t nameLength = 0;
    TargetId targetId{};
    std::uint32_t generation = 0;
    leshy1::storage::RecoveryChoice head =
        leshy1::storage::RecoveryChoice::None;
    leshy1::storage::TargetStateStoreStatus storeStatus =
        leshy1::storage::TargetStateStoreStatus::InvalidArgument;
    leshy1::storage::CommitStage commitStage =
        leshy1::storage::CommitStage::WritePayloads;
    std::uint64_t elapsedUs = 0;
    std::uint64_t bytesWritten = 0;
    std::uint32_t writeCalls = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    std::uint32_t heapFreeBeforeMount = 0;
    std::uint32_t heapLargestBeforeMount = 0;
    int filesystemMountError = 0;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
};
