anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
TargetsMutationState targetsMutationState = TargetsMutationState::Idle;
const char* targetsMutationStatus = "idle";
TargetsMutationEvent targetsMutationReport{};
TargetCatalog* targetsMutationCatalog = nullptr;
CorrelationDecisionLog* targetsMutationDecisions = nullptr;
TargetId targetsMutationTargetId{};
bool targetsMutationFavorite = false;
TargetActionKind targetsMutationKind = TargetActionKind::SetFavorite;
bool targetsMutationCorrelation = false;
CorrelationActionKind targetsMutationCorrelationKind =
    CorrelationActionKind::Accept;
CorrelationProposal targetsMutationProposal{};
std::array<char, TargetRecord::kNotesCapacity + 1> targetsMutationText{};
std::uint16_t targetsMutationTextLength = 0;
std::uint64_t targetsMutationStartActionUs = 0;
QueueHandle_t targetsMutationEvents = nullptr;
TaskHandle_t targetsMutationTaskHandle = nullptr;
leshy1::services::survey::ObservationQueue surveyIngressQueue;
leshy1::storage::SessionStoreWorkspace sessionStoreWorkspace;
ArduinoFsSessionStoreWorkspace sdSessionStoreIoWorkspace;
RamSessionStoreIo ramSessionStore;
leshy1::storage::SessionStoreIoRouter surveyStoreRouter(ramSessionStore);
// Every physical-store path owns Storage+RadioSpi exclusively and closes its
// adapter before releasing that lease. Product and diagnostic paths therefore
// share one 4.4 KiB I/O workspace safely.
ArduinoFsSessionStoreIo productSurveyStore(sdSessionStoreIoWorkspace);
BoardSdFilesystem productSurveyFilesystem;
SurveyWorkflow surveyWorkflow(surveyController, surveyStoreRouter,
                              sessionStoreWorkspace, librarySession,
                              libraryController, false, true);
SurveyPipeline surveyPipeline(surveyWorkflow, surveyIngressQueue);
SourceTimeline productSurveyTimeline;
BoardStorageAdapter boardStorageAdapter;
leshy1::storage::MediaDiscovery storageDiscovery;
bool storageDiscoveryReady = false;
bool surveyDemoReady = false;
bool libraryDemoReady = false;
const char* lastRuntimeEvent = "idle";
BootMetrics bootMetrics;
char runningAppElfSha256[65] = {};
HilSession hilSession;
TFT_eSPI display;
BoardTouchInput boardTouchInput;
bool touchCalibrationRequiredAtBoot = false;
bool touchCalibrationSucceededAtBoot = false;
UiController uiController;
LanguageController languageController;
InterfaceSettingsController interfaceSettingsController;
SelfTestController selfTestController;
constexpr std::uint8_t kDevicePage = 9;
constexpr std::uint8_t kAboutPage = 10;
constexpr std::uint8_t kPowerPage = 11;
constexpr std::uint8_t kDeviceItemCount = 5;
std::uint8_t deviceSelection = 0;
PowerSafetyPolicy powerSafetyPolicy;
bool powerManagerAddressAck = false;
std::uint32_t boundedSleepCount = 0;
std::uint64_t lastBoundedSleepRequestedUs = 0;
std::uint64_t lastBoundedSleepElapsedUs = 0;
esp_sleep_wakeup_cause_t lastBoundedSleepWakeCause = ESP_SLEEP_WAKEUP_UNDEFINED;
// ESP32-S3 timer wakeup can return a few milliseconds before the programmed
// interval because of RTC-domain entry/exit calibration.  Keep the acceptance
// window explicit and bounded instead of pretending the wall clock is exact.
constexpr std::uint64_t kLightSleepTimerToleranceUs = 20000ULL;
// Native USB is suspended while the S3 is in light sleep.  Give its endpoint
// time to resume before a HIL reply or the next UI action is emitted.
constexpr std::uint32_t kLightSleepTransportRecoveryMs = 150U;
struct PowerSleepTestReport {
    bool available = false;
    bool passed = false;
    bool inputTaskRetained = false;
    bool buzzerInactive = false;
    std::uint64_t requestedUs = 0;
    std::uint64_t elapsedUs = 0;
    esp_sleep_wakeup_cause_t wakeCause = ESP_SLEEP_WAKEUP_UNDEFINED;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::uint32_t heapBefore = 0;
    std::uint32_t heapAfter = 0;
    std::uint32_t minimumHeapBefore = 0;
    std::uint32_t minimumHeapAfter = 0;
    std::uint32_t leaseMask = 0;
};
PowerSleepTestReport powerSleepTestReport;
ShieldReceiverProbeReport shieldReceiverProbeReport;
Nrf24SpectrumController nrf24SpectrumController;
Nrf24SignalFinder nrf24SignalFinder;
Nrf24PassiveSpectrumReport nrf24SpectrumReport;
BoardNrf24PassiveSpectrum boardNrf24Spectrum;
Cc1101SignalFinder cc1101SignalFinder;
Cc1101SpectrumController cc1101SpectrumController;
Cc1101PassiveSpectrumReport cc1101SpectrumReport;
BoardCc1101PassiveSpectrum boardCc1101Spectrum;
SpectrumViewport spectrumViewport;
std::array<std::uint8_t, SpectrumViewport::kMaxBins> spectrumIntensity{};
std::array<std::uint16_t, Layout::ScreenWidth> spectrumScanline{};
enum class FullGuidedRfStep : std::uint8_t {
    Idle,
    Nrf24Sweep,
    Cc1101Sweep,
    SubGhzOokReceive,
    SubGhzFskReceive,
    InfraredReceive,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedRfStepName(FullGuidedRfStep step) {
    switch (step) {
        case FullGuidedRfStep::Idle: return "idle";
        case FullGuidedRfStep::Nrf24Sweep: return "nrf24_sweep";
        case FullGuidedRfStep::Cc1101Sweep: return "cc1101_sweep";
        case FullGuidedRfStep::SubGhzOokReceive: return "subghz_ook_receive";
        case FullGuidedRfStep::SubGhzFskReceive: return "subghz_fsk_receive";
        case FullGuidedRfStep::InfraredReceive: return "infrared_receive";
        case FullGuidedRfStep::Complete: return "complete";
        case FullGuidedRfStep::Failed: return "failed";
        case FullGuidedRfStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedRfState final {
    FullGuidedRfStep step = FullGuidedRfStep::Idle;
    bool resourceAcquired = false;
    bool resourceReleased = true;
    bool cleanupComplete = true;
    bool nrf24Complete = false;
    bool nrf24Passed = false;
    bool cc1101Complete = false;
    bool cc1101Passed = false;
    std::uint8_t cc1101Bins = 0;
    bool subGhzOokComplete = false;
    bool subGhzOokPassed = false;
    std::uint8_t subGhzOokSamples = 0;
    bool subGhzFskComplete = false;
    bool subGhzFskPassed = false;
    std::uint8_t subGhzFskSamples = 0;
    std::uint32_t subGhzFskEdges = 0;
    bool subGhzFskOverflow = false;
    bool infraredComplete = false;
    bool infraredPassed = false;
    std::uint8_t infraredSamples = 0;
};
