anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void armSpectrumWaterfallForCurrentReceiver();
BoardWifiPassiveCapture wifiFrameCapture;
constexpr WifiFrameCapturePlan kProductWifiFrameCapturePlan{};
std::uint64_t nextCaptureUiRefreshUs = 0;
enum class CaptureView : std::uint8_t {
    SourceMenu,
    Wifi,
    Infrared,
};
CaptureView captureView = CaptureView::SourceMenu;
std::uint8_t captureSourceSelection = 0;
InfraredCapture infraredCapture;
constexpr InfraredCapturePlan kProductInfraredCapturePlan{};
BoardInfraredReceiver boardInfraredReceiver;
InfraredReceiverReport infraredReceiverReport;
enum class CapturePersistState : std::uint8_t {
    Result,
    Confirm,
    Saving,
    Saved,
    Failed,
};
struct CaptureStoreEvent final {
    const char* status = "not_started";
    bool valid = false;
    bool cleanupComplete = false;
    std::uint32_t generation = 0;
    std::uint32_t heapFreeBeforeMount = 0;
    std::uint32_t heapLargestBeforeMount = 0;
    int filesystemMountError = 0;
    leshy1::storage::SessionStoreStatus storeStatus =
        leshy1::storage::SessionStoreStatus::InvalidArgument;
};
CapturePersistState capturePersistState = CapturePersistState::Result;
const char* capturePersistStatus = "volatile";
std::uint32_t capturePersistGeneration = 0;
std::uint32_t capturePersistHeapFreeBeforeMount = 0;
std::uint32_t capturePersistHeapLargestBeforeMount = 0;
int capturePersistFilesystemMountError = 0;
QueueHandle_t captureStoreEvents = nullptr;
TaskHandle_t captureStoreTaskHandle = nullptr;
CapturePersistState subGhzCapturePersistState = CapturePersistState::Result;
const char* subGhzCapturePersistStatus = "volatile";
std::uint32_t subGhzCapturePersistGeneration = 0;
std::uint32_t subGhzCapturePersistHeapFreeBeforeMount = 0;
std::uint32_t subGhzCapturePersistHeapLargestBeforeMount = 0;
int subGhzCapturePersistFilesystemMountError = 0;
QueueHandle_t subGhzCaptureStoreEvents = nullptr;
TaskHandle_t subGhzCaptureStoreTaskHandle = nullptr;
CapturePersistState infraredCapturePersistState = CapturePersistState::Result;
const char* infraredCapturePersistStatus = "volatile";
std::uint32_t infraredCapturePersistGeneration = 0;
std::uint32_t infraredCapturePersistHeapFreeBeforeMount = 0;
std::uint32_t infraredCapturePersistHeapLargestBeforeMount = 0;
int infraredCapturePersistFilesystemMountError = 0;
QueueHandle_t infraredCaptureStoreEvents = nullptr;
TaskHandle_t infraredCaptureStoreTaskHandle = nullptr;
const char* capturePersistStateName(CapturePersistState state) {
    switch (state) {
        case CapturePersistState::Result: return "volatile";
        case CapturePersistState::Confirm: return "confirm";
        case CapturePersistState::Saving: return "saving";
        case CapturePersistState::Saved: return "saved";
        case CapturePersistState::Failed: return "failed";
    }
    return "failed";
}
constexpr std::size_t kConsoleCommandCapacity = 192;
constexpr char kLongestConsoleCommand[] =
    "storage.littlefs.reset recover read-only "
    "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff "
    "s3-littlefs-reset-20260818-b6 6";
static_assert(sizeof(kLongestConsoleCommand) <= kConsoleCommandCapacity,
              "console command buffer cannot hold the longest command");
char usbCommand[kConsoleCommandCapacity] = {};
char uartCommand[kConsoleCommandCapacity] = {};
std::size_t usbLength = 0;
std::size_t uartLength = 0;
std::uint8_t lastInputRaw = 0xFF;
Pcf8574ButtonInput physicalButtonInput;

struct PhysicalInputEvent final {
    UiAction action = UiAction::Unknown;
    std::uint8_t raw = 0xFF;
    std::uint32_t atMs = 0;
    std::uint64_t atUs = 0;
};

constexpr UBaseType_t kPhysicalInputQueueCapacity = 64;
QueueHandle_t physicalInputEvents = nullptr;
TaskHandle_t physicalInputTaskHandle = nullptr;
portMUX_TYPE physicalInputMux = portMUX_INITIALIZER_UNLOCKED;
std::uint32_t physicalInputQueueDrops = 0;
std::uint32_t physicalInputQueueHighWater = 0;
std::uint32_t physicalInputDispatchedPresses = 0;
UiAction lastPhysicalInputAction = UiAction::Unknown;
bool lastPhysicalInputChanged = false;
std::uint64_t lastPhysicalInputQueueUs = 0;
std::uint64_t maximumPhysicalInputQueueUs = 0;
std::uint64_t lastPhysicalInputRenderUs = 0;
std::uint64_t lastPhysicalInputEndToEndUs = 0;
std::uint64_t maximumPhysicalInputEndToEndUs = 0;
bool physicalInputTaskStarted = false;
std::uint32_t touchHandledPresses = 0;
std::uint32_t touchMissedPresses = 0;
std::uint32_t syntheticTouchPresses = 0;
TouchPoint lastTouchPoint{};
bool lastTouchChanged = false;

struct ProductBootRecoveryState final {
    const char* status = "not_started";
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    bool enrolled = false;
    bool fingerprintMatched = false;
    bool mountedReadOnly = false;
    bool readOnlyGuaranteed = false;
    bool rootExists = false;
    bool opened = false;
    bool catalogAdmitted = false;
    bool cleanupComplete = false;
    leshy1::storage::ProductStoreAccessStatus permitStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::library::SessionCatalogResult catalog{};
    std::uint32_t ownedDuring = 0;
    std::uint32_t ownedAfter = 0;
    std::uint32_t blockedWriteAttempts = 0;
    std::uint8_t attempts = 0;
    std::uint8_t transientRetries = 0;
    std::uint8_t timeoutRestarts = 0;
};

ProductBootRecoveryState productBootRecovery;
constexpr std::uint32_t kProductBootRetryRtcMagic = 0x4C425231U;
constexpr std::uint32_t kProductBootWatchdogTestRtcMagic = 0x4C425754U;
constexpr std::uint32_t kEarlyBootWatchdogTestRtcMagic = 0x4C425745U;
constexpr std::uint32_t kEarlyBootGuardRtcMagic = 0x4C424747U;
constexpr std::uint32_t kEarlyBootGuardTripRtcMagic = 0x4C424754U;
constexpr std::uint32_t kEarlyBootGuardTimeoutMs = 5000U;
RTC_NOINIT_ATTR std::uint32_t productBootRetryRtcMagic;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryRestarts;
RTC_NOINIT_ATTR std::uint32_t productBootRetryAppIdentity;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryTimeouts;
RTC_NOINIT_ATTR std::uint32_t productBootWatchdogTestRtcState;
RTC_NOINIT_ATTR std::uint32_t earlyBootWatchdogTestRtcState;
RTC_NOINIT_ATTR volatile std::uint32_t earlyBootGuardRtcState;
RTC_NOINIT_ATTR volatile std::uint32_t earlyBootGuardRtcStateInverse;
RTC_NOINIT_ATTR volatile std::uint32_t earlyBootGuardTripRtcState;
RTC_NOINIT_ATTR volatile std::uint32_t earlyBootGuardTripRtcStateInverse;
RTC_NOINIT_ATTR volatile SafetyRetainedRecord safetyRetainedRtc;
bool earlyBootGuardActive = false;
bool earlyBootGuardTrippedAtBoot = false;
volatile std::uint32_t runtimeSafetyWatchdogArmed = 0;
volatile std::uint32_t runtimeSafetyAppIdentity = 0;
volatile std::uint32_t runtimeSafetyNextTripCount = 1;
volatile std::uint32_t runtimeSafetyNextQuiesceCount = 1;
SafetySupervisor safetySupervisor;
std::uint32_t runningAppIdentity = 0;
bool runtimeSafetyWatchdogReady = false;

bool earlyBootGuardWatchdogReset(esp_reset_reason_t reason) {
    return reason == ESP_RST_PANIC || reason == ESP_RST_INT_WDT ||
           reason == ESP_RST_TASK_WDT || reason == ESP_RST_WDT;
}

void feedEarlyBootGuard() {
    if (!earlyBootGuardActive) return;
    wdt_hal_context_t guard = RWDT_HAL_CONTEXT_DEFAULT();
    wdt_hal_write_protect_disable(&guard);
    wdt_hal_feed(&guard);
    wdt_hal_write_protect_enable(&guard);
}

void disarmEarlyBootGuard() {
    if (!earlyBootGuardActive) return;
    wdt_hal_context_t guard = RWDT_HAL_CONTEXT_DEFAULT();
    wdt_hal_write_protect_disable(&guard);
    wdt_hal_feed(&guard);
    wdt_hal_set_flashboot_en(&guard, false);
    wdt_hal_disable(&guard);
    wdt_hal_write_protect_enable(&guard);
    earlyBootGuardActive = false;
    earlyBootGuardRtcState = 0;
    earlyBootGuardRtcStateInverse = 0;
}

