anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool productSurveyPreparationDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveyPreparationDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeProductSurveyPreparationDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveyPreparationDeadlineInjectionOnce;
    productSurveyPreparationDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool armProductSurveyPreparationDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurveyPreparation, nowUs,
        kProductSurveyPreparationDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatProductSurveyPreparation(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurveyPreparation, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyPreparationDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurveyPreparation);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

bool armProductSurveyWorkerDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurvey, nowUs,
        kProductSurveyWorkerDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatProductSurveyWorker(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurvey, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyWorkerDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurvey);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

void setWifiCaptureStoreDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool wifiCaptureStoreDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = wifiCaptureStoreDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeWifiCaptureStoreDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = wifiCaptureStoreDeadlineInjectionOnce;
    wifiCaptureStoreDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void resetWifiCaptureStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineCancelRequested = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void requestWifiCaptureStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineCancelRequested = true;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool wifiCaptureStoreDeadlineCancelled() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool cancelled = wifiCaptureStoreDeadlineCancelRequested;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return cancelled;
}

bool armWifiCaptureStoreDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::WifiCaptureStore, nowUs,
        kWifiCaptureStoreDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatWifiCaptureStore(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::WifiCaptureStore, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmWifiCaptureStoreDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::WifiCaptureStore);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

void resetTargetsStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    targetsStoreDeadlineCancelRequested = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void requestTargetsStoreDeadlineCancel() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    targetsStoreDeadlineCancelRequested = true;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool targetsStoreDeadlineCancelled() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool cancelled = targetsStoreDeadlineCancelRequested;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return cancelled;
}

bool armTargetsStoreDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::TargetsStore, nowUs, kTargetsStoreDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatTargetsStoreDeadline() {
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0) nowUs = 1;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::TargetsStore, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmTargetsStoreDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::TargetsStore);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

