anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool pulseCaptureStoreWorker(SupervisedWorker worker) {
    return worker == SupervisedWorker::SubGhzCaptureStore ||
           worker == SupervisedWorker::InfraredCaptureStore;
}

void setPulseCaptureStoreDeadlineInjection(SupervisedWorker worker,
                                           bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineInjectionOnce = armed;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineInjectionOnce = armed;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool pulseCaptureStoreDeadlineInjectionArmed(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed =
        worker == SupervisedWorker::SubGhzCaptureStore
            ? subGhzCaptureStoreDeadlineInjectionOnce
            : worker == SupervisedWorker::InfraredCaptureStore
                  ? infraredCaptureStoreDeadlineInjectionOnce
                  : false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumePulseCaptureStoreDeadlineInjection(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    bool injected = false;
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        injected = subGhzCaptureStoreDeadlineInjectionOnce;
        subGhzCaptureStoreDeadlineInjectionOnce = false;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        injected = infraredCaptureStoreDeadlineInjectionOnce;
        infraredCaptureStoreDeadlineInjectionOnce = false;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void resetPulseCaptureStoreDeadlineCancel(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineCancelRequested = false;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineCancelRequested = false;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void requestPulseCaptureStoreDeadlineCancel(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (worker == SupervisedWorker::SubGhzCaptureStore) {
        subGhzCaptureStoreDeadlineCancelRequested = true;
    } else if (worker == SupervisedWorker::InfraredCaptureStore) {
        infraredCaptureStoreDeadlineCancelRequested = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool pulseCaptureStoreDeadlineCancelled(SupervisedWorker worker) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool cancelled =
        worker == SupervisedWorker::SubGhzCaptureStore
            ? subGhzCaptureStoreDeadlineCancelRequested
            : worker == SupervisedWorker::InfraredCaptureStore
                  ? infraredCaptureStoreDeadlineCancelRequested
                  : false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return cancelled;
}

bool armPulseCaptureStoreDeadline(SupervisedWorker worker,
                                  std::uint64_t nowUs) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        worker, nowUs, kPulseCaptureStoreDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatPulseCaptureStore(SupervisedWorker worker,
                                std::uint64_t nowUs = 0) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(worker, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmPulseCaptureStoreDeadline(SupervisedWorker worker) {
    if (!pulseCaptureStoreWorker(worker)) return false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(worker);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

WorkerDeadlineSnapshot workerDeadlineSnapshot() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const WorkerDeadlineSnapshot snapshot = workerDeadlineSupervisor.snapshot();
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return snapshot;
}

std::uint8_t productSurveyRuntimeUnavailableInjectionMask() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint8_t mask = productSurveyRuntimeUnavailableOnceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return mask;
}

void setProductSurveyRuntimeUnavailableInjection(std::uint8_t mask) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
        mask & leshy1::services::survey::kSupportedSourceMask);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveyRuntimeUnavailableInjection(RadioKind source) {
    const std::uint8_t mask = leshy1::services::survey::sourceMask(source);
    bool injected = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if ((productSurveyRuntimeUnavailableOnceMask & mask) != 0) {
        productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
            productSurveyRuntimeUnavailableOnceMask &
            static_cast<std::uint8_t>(~mask));
        injected = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool productSurveySourceUnavailableVisible() {
    return productSurveyRuntime.selected &&
        productSurveyRuntime.cleanupComplete &&
        productSurveyRuntime.admissionStatus ==
            leshy1::apps::survey::ProductSurveyAdmissionStatus::SourceUnavailable &&
        std::strcmp(productSurveyRuntime.status, "source_unavailable") == 0;
}

void setProductSurveyScanActive(bool active) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerScanActive = active;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

