anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    BoardSdFilesystem filesystem;
    const bool mounted = productBootRecovery.fingerprintMatched &&
                         filesystem.beginReadOnly();
    productBootRecovery.mountedReadOnly = mounted;
    productBootRecovery.readOnlyGuaranteed =
        mounted && filesystem.readOnlyGuaranteed();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity != 0 && cardCapacity == identity.identity.capacityBytes;
    productBootRecovery.rootExists = mounted && filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = productBootRecovery.observedFingerprint;
    media.capacityBytes = cardCapacity;
    // Recovery never writes, so it does not need an O(media-size) free-space
    // scan. Zero is valid geometry and keeps cold boot bounded.
    media.freeBytes = 0;
    leshy1::storage::ProductStoreRequest request;
    request.operation = leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = productBootRecovery.expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = productBootRecovery.rootExists;
    request.driverReadOnlyGuaranteed =
        productBootRecovery.readOnlyGuaranteed;
    request.ownedResources = productBootRecovery.ownedDuring;
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);
    productBootRecovery.permitStatus = permit.status;

    if (permit.allowed()) {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        productBootRecovery.opened = io.openExistingReadOnly(permit);
        if (productBootRecovery.opened) {
            productBootRecovery.catalog = sessionCatalog.recoverLatest(
                io, sessionStoreWorkspace, librarySession, libraryController,
                true, false);
            productBootRecovery.catalogAdmitted =
                productBootRecovery.catalog.admitted();
        }
        io.end();
    }
    productBootRecovery.blockedWriteAttempts =
        filesystem.blockedWriteAttempts();
    if (productBootRecovery.fingerprintMatched) filesystem.end();
    const bool filesystemCleanup =
        !productBootRecovery.fingerprintMatched || filesystem.cleanupComplete();
    resourceBroker.releaseAll(kBootCatalogOwner);
    productBootRecovery.ownedAfter = resourceBroker.ownedBy(kBootCatalogOwner);
    productBootRecovery.cleanupComplete = identityCleanup && filesystemCleanup &&
        productBootRecovery.ownedAfter == 0 &&
        productBootRecovery.blockedWriteAttempts == 0;

    if (!identityBegun || identity.status !=
                              leshy1::storage::SdTransportRunStatus::Valid) {
        productBootRecovery.status = "identity_failed";
    } else if (!productBootRecovery.fingerprintMatched) {
        productBootRecovery.status = "fingerprint_mismatch";
    } else if (!mounted || !productBootRecovery.readOnlyGuaranteed) {
        productBootRecovery.status = "readonly_mount_failed";
    } else if (!permit.allowed()) {
        productBootRecovery.status =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else if (!productBootRecovery.opened) {
        productBootRecovery.status = "open_failed";
    } else if (productBootRecovery.catalogAdmitted) {
        productBootRecovery.status = "admitted";
        libraryDemoReady = true;
    } else {
        productBootRecovery.status =
            leshy1::apps::library::sessionCatalogStatusName(
                productBootRecovery.catalog.status);
    }
    if (!productBootRecovery.cleanupComplete) {
        productBootRecovery.status = "cleanup_failed";
    }
}

void releaseTargetsProduct() {
    delete targetsProductRuntime;
    targetsProductRuntime = nullptr;
    targetsHeapFreeAfter = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    targetsProductStatus = "not_loaded";
}

bool allocateTargetsProduct() {
    targetsHeapFreeBefore = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    auto* catalog = new (std::nothrow) TargetCatalog();
    auto* decisions = new (std::nothrow) CorrelationDecisionLog();
    auto* correlations = new (std::nothrow)
        leshy1::services::targets::SessionCorrelationProposalSet();
    auto* comparison = new (std::nothrow)
        leshy1::domain::targets::TargetComparisonResult();
    auto* workspace = catalog == nullptr || decisions == nullptr ||
            correlations == nullptr || comparison == nullptr
        ? nullptr
        : new (std::nothrow) TargetsWorkspace(
              *catalog, *decisions, *correlations, *comparison);
    auto* controller = workspace == nullptr ? nullptr
        : new (std::nothrow) TargetsController(*workspace);
    targetsProductRuntime = controller == nullptr ? nullptr
        : new (std::nothrow) TargetsProductRuntime(
              catalog, decisions, correlations, comparison, workspace,
              controller);
    if (targetsProductRuntime != nullptr) return true;
    delete controller;
    delete workspace;
    delete comparison;
    delete correlations;
    delete decisions;
    delete catalog;
    targetsProductStatus = "workspace_unavailable";
    lastRuntimeEvent = targetsProductStatus;
    return false;
}

TargetsLoadStatus loadBoundTargetsProduct(
    TargetsController& controller, const TargetCatalog* persisted = nullptr,
    const CorrelationDecisionLog* decisions = nullptr) {
    if (targetsComparisonLoaded) {
        return persisted == nullptr || decisions == nullptr
            ? controller.load(targetsBaselineBinding, targetsCurrentBinding)
            : controller.load(targetsBaselineBinding, targetsCurrentBinding,
                              *persisted, *decisions);
    }
    return persisted == nullptr || decisions == nullptr
        ? controller.load(targetsCurrentBinding)
        : controller.load(targetsCurrentBinding, *persisted, *decisions);
}

