anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool loadTargetsProduct(const AppMenuItem& item) {
    releaseTargetsProduct();
    targetsBaselineBinding = {};
    targetsCurrentBinding = {};
    targetsComparisonLoaded = false;
    targetsStateGeneration = 0;
    targetsStateHead = leshy1::storage::RecoveryChoice::None;
    targetsMutationState = TargetsMutationState::Idle;
    targetsMutationStatus = "idle";
    targetsMutationReport = {};
    targetsBlockedWriteAttempts = 0;
    targetsFilesystemMountError = 0;
    targetsCleanupComplete = true;
    if (item.simulated) {
        if (!allocateTargetsProduct()) return false;
        TargetsController& controller = targetsProductRuntime->controller;
        const LibraryEntry* entry = libraryController.selected();
        if (entry == nullptr || entry->session == nullptr ||
            entry->generation == 0) {
            targetsProductStatus = "session_unavailable";
            lastRuntimeEvent = targetsProductStatus;
            return true;
        }
        const TargetsLoadStatus loaded = controller.load(
            {entry->session, entry->generation});
        targetsCurrentBinding = {entry->session, entry->generation};
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

    constexpr auto required =
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    const auto owned = appRuntime.activeResources();
    char expectedFingerprint[33] = {};
    if ((owned & required) != required) {
        targetsProductStatus = "resources_missing";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    if (!loadProductFingerprint(expectedFingerprint,
                                sizeof(expectedFingerprint))) {
        targetsProductStatus = "enrollment_missing";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

    BoardSdSpiTransport identityTransport;
    const bool identityBegun = identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity{};
    if (identityBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = owned;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(),
            identityTransport, policy);
        identityTransport.end();
    }
    char observedFingerprint[33] = {};
    formatCidFingerprint(identity.identity, observedFingerprint,
                         sizeof(observedFingerprint));
    if (!identityBegun || !identityTransport.cleanupComplete() ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        targetsProductStatus = "identity_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    if (std::strcmp(expectedFingerprint, observedFingerprint) != 0) {
        targetsProductStatus = "fingerprint_mismatch";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

    // Reserve the large contiguous codec buffer before FatFs fragments the
    // no-PSRAM heap. Temporary catalog/decision objects validate both atomic
    // heads while mounted, then are released while the selected wire blob stays
    // in this workspace. After unmount the product runtime is allocated as
    // separate 11,272 B catalog, 11,272 B decision log, 7,736 B comparison,
    // 2,704 B proposals and 4,160 B controller blocks, then the blob is decoded
    // directly into that one long-lived copy. A monolithic workspace or
    // overlapping transfer/runtime copies do not fit the board.
    auto* targetStateWorkspace = new (std::nothrow)
        leshy1::storage::TargetDecisionStateStoreWorkspace();
    TargetCatalog* persistedCatalog = new (std::nothrow) TargetCatalog();
    CorrelationDecisionLog* persistedDecisions =
        new (std::nothrow) CorrelationDecisionLog();
    BoardSdFilesystem filesystem;
    const bool mounted = filesystem.beginReadOnly();
    targetsFilesystemMountError = filesystem.mountError();
    if (!mounted || !filesystem.readOnlyGuaranteed()) {
        if (filesystem.mounted()) filesystem.end();
        targetsCleanupComplete = filesystem.cleanupComplete();
        delete targetStateWorkspace;
        delete persistedCatalog;
        delete persistedDecisions;
        targetsProductStatus = "readonly_mount_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    const std::uint64_t cardCapacity = filesystem.cardCapacityBytes();
    const bool rootExists = filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);
    leshy1::storage::MediaIdentity media;
    media.present = cardCapacity != 0 &&
        cardCapacity == identity.identity.capacityBytes;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = observedFingerprint;
    media.capacityBytes = cardCapacity;
    media.freeBytes = 0;
    leshy1::storage::ProductStoreRequest request;
    request.operation =
        leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = rootExists;
    request.driverReadOnlyGuaranteed = filesystem.readOnlyGuaranteed();
    request.ownedResources = owned;
    const auto permit = leshy1::storage::authorizeProductStore(media, request);

    bool pairRecovered = false;
    std::uint32_t baselineGeneration = 0;
    std::uint32_t currentGeneration = 0;
    bool latestRecovered = false;
    std::uint32_t latestGeneration = 0;
    bool persistedStateBlobAvailable = false;
    bool targetStateAccepted = true;
    if (!permit.allowed()) {
        targetsProductStatus =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        if (!io.openExistingReadOnly(permit)) {
            targetsProductStatus = "open_failed";
        } else {
            targetsProductStatus =
                leshy1::apps::targets::targetsLoadStatusName(
                    TargetsLoadStatus::SessionUnavailable);
            const auto pair = leshy1::storage::recoverSessionPair(
                io, sessionStoreWorkspace, &librarySession,
                &surveySession);
            if (pair.valid()) {
                pairRecovered = true;
                baselineGeneration = pair.baselineGeneration;
                currentGeneration = pair.currentGeneration;
            } else {
                surveySession.reset();
                const auto latest = leshy1::storage::recoverSession(
                    io, sessionStoreWorkspace, &surveySession);
                if (latest.valid()) {
                    latestRecovered = true;
                    latestGeneration = latest.generation;
                }
            }
            const bool sessionReady = pairRecovered || latestRecovered;
            const bool targetStatePresent = filesystem.exists(
                    "/leshy/sessions/v1/target-state-head-a.bin") ||
                filesystem.exists(
                    "/leshy/sessions/v1/target-state-head-b.bin");
            if (sessionReady && targetStatePresent) {
                if (persistedCatalog == nullptr || persistedDecisions == nullptr ||
                    targetStateWorkspace == nullptr) {
                    targetStateAccepted = false;
                    targetsProductStatus = "target_state_workspace_unavailable";
                } else {
                    const auto recovered =
                        leshy1::storage::recoverTargetDecisionState(
                            io, *targetStateWorkspace, persistedCatalog,
                            persistedDecisions);
                    if (recovered.valid()) {
                        persistedStateBlobAvailable = true;
                        targetsStateGeneration = recovered.generation;
                        targetsStateHead = recovered.choice;
                    } else {
                        targetStateAccepted = false;
                        targetsProductStatus =
                            leshy1::storage::targetStateStoreStatusName(
                                recovered.status);
                    }
                }
            }
        }
        io.end();
    }
    // Recovery left the selected, already validated wire generation in the
    // codec workspace. Drop the decoded validation copies before asking the
    // fragmented no-PSRAM heap for the foreground runtime.
    delete persistedCatalog;
    persistedCatalog = nullptr;
    delete persistedDecisions;
    persistedDecisions = nullptr;
    targetsBlockedWriteAttempts = filesystem.blockedWriteAttempts();
    filesystem.end();
    targetsCleanupComplete = filesystem.cleanupComplete();
    if (!targetsCleanupComplete || targetsBlockedWriteAttempts != 0) {
        targetsProductStatus = "cleanup_failed";
    }
    // Release FAT/SPI heap before allocating the foreground Targets workspace.
    if (targetsCleanupComplete && targetsBlockedWriteAttempts == 0 &&
        targetStateAccepted &&
        (pairRecovered || latestRecovered)) {
        if (!allocateTargetsProduct()) {
            delete targetStateWorkspace;
            return false;
        }
        TargetsController& controller = targetsProductRuntime->controller;
        const TargetCatalog* persistedForLoad = nullptr;
        const CorrelationDecisionLog* decisionsForLoad = nullptr;
        if (persistedStateBlobAvailable) {
            const auto reopened = leshy1::storage::reopenTargetDecisionState(
                targetStateWorkspace->manifest.data(),
                targetStateWorkspace->manifestSize,
                targetStateWorkspace->state.data(),
                targetStateWorkspace->stateSize,
                &targetsProductRuntime->workspace.catalog,
                &targetsProductRuntime->workspace.decisions);
            if (reopened != leshy1::storage::TargetCodecStatus::Valid) {
                delete targetStateWorkspace;
                delete targetsProductRuntime;
                targetsProductRuntime = nullptr;
                targetsHeapFreeAfter = static_cast<std::uint32_t>(
                    heap_caps_get_free_size(MALLOC_CAP_8BIT));
                targetsProductStatus = "target_state_reopen_failed";
                lastRuntimeEvent = targetsProductStatus;
                return false;
            }
            persistedForLoad = &targetsProductRuntime->workspace.catalog;
            decisionsForLoad = &targetsProductRuntime->workspace.decisions;
        }
        delete targetStateWorkspace;
        targetStateWorkspace = nullptr;
        targetsComparisonLoaded = pairRecovered;
        targetsBaselineBinding = pairRecovered
            ? TargetProductBinding{&librarySession, baselineGeneration}
            : TargetProductBinding{};
        targetsCurrentBinding = pairRecovered
            ? TargetProductBinding{&surveySession, currentGeneration}
            : TargetProductBinding{&surveySession, latestGeneration};
        const TargetsLoadStatus loaded = loadBoundTargetsProduct(
            controller,
            persistedForLoad, decisionsForLoad);
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
    }
    delete targetStateWorkspace;
    lastRuntimeEvent = targetsProductStatus;
    return true;
}

bool rebuildTargetsProductFromCatalog(const TargetCatalog* persisted,
                                      const CorrelationDecisionLog* decisions,
                                      const TargetId& selectedId,
                                      bool openActions) {
    if (!allocateTargetsProduct()) return false;
    TargetsController& controller = targetsProductRuntime->controller;
    const TargetsLoadStatus loaded = loadBoundTargetsProduct(
        controller, persisted != nullptr && persisted->size() != 0
            ? persisted : nullptr,
        decisions);
    if (loaded != TargetsLoadStatus::Ready) {
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
        return false;
    }
    if (leshy1::domain::targets::targetIdValid(selectedId) &&
        controller.selectTarget(selectedId)) {
        controller.openSelected();
        if (openActions) controller.openSelected();
    }
    targetsProductStatus = "ready";
    return true;
}

void runTargetsMutationWorker(void*) {
    TargetsMutationEvent event;
    event.status = "store_failed";
    event.favorite = targetsMutationFavorite;
    event.actionKind = targetsMutationKind;
    event.correlation = targetsMutationCorrelation;
    event.correlationKind = targetsMutationCorrelationKind;
    event.name = targetsMutationText;
    event.nameLength = targetsMutationTextLength;
    event.targetId = targetsMutationTargetId;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    TargetCatalog* catalog = targetsMutationCatalog;
    CorrelationDecisionLog* decisions = targetsMutationDecisions;
    BoardSdFilesystem filesystem;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool deadlineArmed = false;
    ArduinoFsSessionStoreIo* io = nullptr;
    auto* workspace = static_cast<
        leshy1::storage::TargetDecisionStateStoreWorkspace*>(nullptr);
    resetTargetsStoreDeadlineCancel();
    deadlineArmed = armTargetsStoreDeadline(startedUs == 0 ? 1 : startedUs);
    const auto supervisedCheckpoint = [&]() {
        return !targetsStoreDeadlineCancelled() &&
            heartbeatTargetsStoreDeadline();
    };
    do {
        if (!deadlineArmed) {
            event.status = "deadline_unavailable";
            break;
        }
        if (catalog == nullptr || decisions == nullptr ||
            targetsMutationEvents == nullptr) {
            event.status = "worker_invalid";
            break;
        }
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        const auto owned = appRuntime.activeResources();
        if ((owned & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!loadProductFingerprint(event.expectedFingerprint,
                                    sizeof(event.expectedFingerprint)) ||
            !exactCidFingerprint(event.expectedFingerprint)) {
            event.status = "enrollment_missing";
            break;
        }

        leshy1::storage::SdTransportRunResult identity{};
        for (std::uint8_t attempt = 1;
             attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
             ++attempt) {
            BoardSdSpiTransport transport;
            const bool begun = transport.begin();
            identity = {};
            if (begun) {
                leshy1::storage::SdTransportRunPolicy policy;
                policy.allowPhysical = true;
                policy.explicitlySelected = true;
                policy.identificationOnly = true;
                policy.ownedResources = owned;
                identity = leshy1::storage::runSdIdentificationStateMachine(
                    leshy1::storage::defaultSdIdentificationPlan(), transport,
                    policy);
                transport.end();
            }
            event.identityAttempts = attempt;
            event.identityTransientRetries =
                static_cast<std::uint8_t>(attempt - 1U);
            identityCleanupComplete = transport.cleanupComplete();
            formatCidFingerprint(identity.identity, event.observedFingerprint,
                                 sizeof(event.observedFingerprint));
            if (identityCleanupComplete &&
                identity.status ==
                    leshy1::storage::SdTransportRunStatus::Valid) {
                break;
            }
            const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
                true,
                true,
                true,
                true,
                transport.physicalSpiStarted(),
                identity.status,
                std::strcmp(event.observedFingerprint,
                            "00000000000000000000000000000000") == 0,
                identityCleanupComplete,
                false,
            };
            if (!leshy1::storage::shouldRetryProductStartIdentity(
                    evidence, attempt)) {
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        }
        if (!identityCleanupComplete ||
            identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
            event.status = "identity_failed";
            break;
        }
        if (std::strcmp(event.expectedFingerprint,
                        event.observedFingerprint) != 0) {
            event.status = "fingerprint_mismatch";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

        event.heapFreeBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
        event.heapLargestBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
        workspace = new (std::nothrow)
            leshy1::storage::TargetDecisionStateStoreWorkspace();
        if (workspace == nullptr) {
            event.status = "workspace_unavailable_before_mount";
            break;
        }
        filesystemAttempted = true;
        if (!filesystem.begin()) {
            event.filesystemMountError = filesystem.mountError();
            event.status = "mount_failed";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        event.filesystemMountError = filesystem.mountError();
        const std::uint64_t cardCapacity = filesystem.cardCapacityBytes();
        leshy1::storage::MediaIdentity media;
        media.present = cardCapacity != 0 &&
            cardCapacity == identity.identity.capacityBytes;
        media.kind = leshy1::storage::MediaKind::Sd;
        media.fingerprint = event.observedFingerprint;
        media.capacityBytes = cardCapacity;
        media.freeBytes = filesystem.cachedFreeBytes();
        leshy1::storage::ProductStoreRequest request;
        request.operation =
            leshy1::storage::ProductStoreOperation::CommitSession;
        request.explicitlySelected = true;
        request.expectedFingerprint = event.expectedFingerprint;
        request.rootPath = leshy1::storage::kProductSessionStoreRoot;
        request.rootExists = filesystem.exists(
            leshy1::storage::kProductSessionStoreRoot);
        request.driverWriteEnabled = true;
        request.requiredBytes = kProductSurveyCommitBytes;
        request.reserveBytes = kProductSurveyReserveBytes;
        request.ownedResources = owned;
        request.power = powerSafetyPolicy.writeDisposition();
        const auto permit = leshy1::storage::authorizeProductStore(
            media, request);
        if (!permit.allowed()) {
            event.status =
                leshy1::storage::productStoreAccessStatusName(permit.status);
            break;
        }
        io = new (std::nothrow) ArduinoFsSessionStoreIo(
            filesystem.driveNumber(), sdSessionStoreIoWorkspace);
        if (io == nullptr) {
            event.status = "io_workspace_unavailable";
            break;
        }
        if (!io->openExistingWritable(permit)) {
            event.status = "open_failed";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

