anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        if (event.correlation) {
            if (!targetsComparisonLoaded ||
                targetsBaselineBinding.session == nullptr ||
                targetsCurrentBinding.session == nullptr) {
                event.status = "correlation_sessions_unavailable";
                break;
            }
            leshy1::domain::targets::TargetComparisonSource baselineSource{};
            leshy1::domain::targets::TargetComparisonSource currentSource{};
            if (!leshy1::services::targets::sourceIdForSession(
                    *targetsBaselineBinding.session, &baselineSource.id) ||
                !leshy1::services::targets::sourceIdForSession(
                    *targetsCurrentBinding.session, &currentSource.id)) {
                event.status = "correlation_sources_unavailable";
                break;
            }
            baselineSource.generation = targetsBaselineBinding.generation;
            currentSource.generation = targetsCurrentBinding.generation;
            SurveySessionTargetEvidenceLookup lookup(
                {baselineSource, targetsBaselineBinding.session},
                {currentSource, targetsCurrentBinding.session});
            CorrelationService service(*catalog, *decisions, lookup);
            CorrelationAction action{};
            action.kind = event.correlationKind;
            action.proposal = targetsMutationProposal;
            const auto* target = catalog->find(action.proposal.targetId);
            action.expectedTargetRevision = target == nullptr
                ? 0U : target->revision;
            const auto applied = service.execute(action);
            event.correlationStatus = applied.status;
            if ((event.correlationKind == CorrelationActionKind::Accept &&
                 applied.status != CorrelationDecisionStatus::Accepted) ||
                (event.correlationKind == CorrelationActionKind::Reject &&
                 applied.status != CorrelationDecisionStatus::Rejected)) {
                event.status =
                    leshy1::services::targets::correlationDecisionStatusName(
                        applied.status);
                break;
            }
        } else {
            TargetAction action;
            action.kind = event.actionKind;
            action.targetId = event.targetId;
            action.favorite = event.favorite;
            if ((event.actionKind == TargetActionKind::SetName ||
                 event.actionKind == TargetActionKind::SetNotes ||
                 event.actionKind == TargetActionKind::AddTag ||
                 event.actionKind == TargetActionKind::RemoveTag) &&
                !leshy1::services::targets::setTargetActionText(
                    &action, event.name.data(), event.nameLength)) {
                event.status = "text_invalid";
                break;
            }
            TargetService service(*catalog);
            const auto applied = service.execute(action);
            if (!applied.applied()) {
                event.status =
                    leshy1::domain::targets::targetMutationStatusName(
                        applied.status);
                break;
            }
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        if (targetsStateGeneration == UINT32_MAX ||
            (targetsStateGeneration != 0 &&
             targetsStateHead != leshy1::storage::RecoveryChoice::A &&
             targetsStateHead != leshy1::storage::RecoveryChoice::B)) {
            event.status = "state_generation_invalid";
            break;
        }
        const std::uint32_t nextGeneration =
            targetsStateGeneration == 0 ? 1U : targetsStateGeneration + 1U;
        const leshy1::storage::HeadSlot nextHead =
            targetsStateGeneration == 0 ||
                    targetsStateHead == leshy1::storage::RecoveryChoice::B
                ? leshy1::storage::HeadSlot::A
                : leshy1::storage::HeadSlot::B;
        const auto committed = leshy1::storage::commitTargetDecisionState(
            *io, *workspace, *catalog, *decisions, nextGeneration, nextHead);
        event.storeStatus = committed.status;
        event.commitStage = committed.stage;
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        const auto recovered = leshy1::storage::recoverTargetDecisionState(
            *io, *workspace, catalog, decisions);
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        event.catalogRecovered = recovered.valid();
        if (recovered.valid()) {
            event.generation = recovered.generation;
            event.head = recovered.choice;
        }
        const auto* reopened = catalog->find(event.targetId);
        bool tagReopened = false;
        if (reopened != nullptr &&
            (event.actionKind == TargetActionKind::AddTag ||
             event.actionKind == TargetActionKind::RemoveTag)) {
            for (std::size_t index = 0; index < reopened->tagCount; ++index) {
                if (reopened->tagLengths[index] == event.nameLength &&
                    std::memcmp(reopened->tags[index].data(),
                                event.name.data(), event.nameLength) == 0) {
                    tagReopened = true;
                    break;
                }
            }
        }
        bool valueReopened = false;
        if (event.correlation) {
            const auto* decision = decisions->find(targetsMutationProposal);
            const auto* candidate = catalog->findByIdentity(
                targetsMutationProposal.candidateIdentity);
            const bool decisionReopened = decision != nullptr &&
                decision->decision ==
                    (event.correlationKind == CorrelationActionKind::Accept
                         ? CorrelationDecision::Accept
                         : CorrelationDecision::Reject);
            const bool ownershipReopened =
                event.correlationKind == CorrelationActionKind::Accept
                ? candidate != nullptr &&
                    leshy1::domain::targets::targetIdEqual(
                        candidate->id, targetsMutationProposal.targetId)
                : candidate == nullptr;
            valueReopened = decisionReopened && ownershipReopened;
        } else if (reopened != nullptr) {
            if (event.actionKind == TargetActionKind::SetFavorite) {
                valueReopened = reopened->favorite == event.favorite;
            } else if (event.actionKind == TargetActionKind::SetName) {
                valueReopened = reopened->nameLength == event.nameLength &&
                    std::memcmp(reopened->name.data(), event.name.data(),
                                event.nameLength) == 0;
            } else if (event.actionKind == TargetActionKind::SetNotes) {
                valueReopened = reopened->notesLength == event.nameLength &&
                    std::memcmp(reopened->notes.data(), event.name.data(),
                                event.nameLength) == 0;
            } else if (event.actionKind == TargetActionKind::AddTag) {
                valueReopened = tagReopened;
            } else if (event.actionKind == TargetActionKind::RemoveTag) {
                valueReopened = !tagReopened;
            }
        }
        event.persisted = committed.complete() && recovered.valid() &&
            recovered.generation == committed.generation && valueReopened;
        event.status = event.persisted
            ? "saved"
            : (committed.complete()
                   ? "reopen_failed"
                   : leshy1::storage::targetStateStoreStatusName(
                         committed.status));
    } while (false);

    if (io != nullptr) {
        event.bytesWritten = io->bytesWritten();
        event.writeCalls = io->writeCalls();
        event.fileSyncs = io->fileSyncs();
        event.directorySyncs = io->directorySyncs();
        io->end();
    }
    delete io;
    delete workspace;
    if (filesystem.mounted()) filesystem.end();
    const bool filesystemCleanup = !filesystemAttempted ||
        filesystem.cleanupComplete();
    event.cleanupComplete = identityCleanupComplete && filesystemCleanup &&
        !filesystem.mounted();
    if (!event.cleanupComplete) {
        event.persisted = false;
        event.status = "cleanup_failed";
    }
    if (targetsStoreDeadlineCancelled()) {
        event.persisted = false;
        event.status = "safety_worker_deadline";
    }
    if (deadlineArmed) disarmTargetsStoreDeadline();
    resetTargetsStoreDeadlineCancel();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    event.elapsedUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
    if (targetsMutationEvents != nullptr) {
        xQueueOverwrite(targetsMutationEvents, &event);
    }
    vTaskDelete(nullptr);
}

