anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool requestTargetsMutation(TargetActionKind kind, bool favorite,
                            const char* text, std::size_t textLength) {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (targetsProductRuntime == nullptr ||
        (targetsProductRuntime->controller.view() != TargetsView::Actions &&
         targetsProductRuntime->controller.view() != TargetsView::NameEdit &&
         targetsProductRuntime->controller.view() != TargetsView::TagList &&
         targetsProductRuntime->controller.view() != TargetsView::TagEdit &&
         targetsProductRuntime->controller.view() != TargetsView::NotesEdit) ||
        targetsMutationState == TargetsMutationState::Saving) {
        return false;
    }
    const auto* selected =
        targetsProductRuntime->controller.selectedTarget();
    if (selected == nullptr) return false;
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "power_unsafe";
        lastRuntimeEvent = "targets_store_power_unsafe";
        return true;
    }
    if (targetsMutationEvents == nullptr ||
        targetsMutationTaskHandle != nullptr ||
        targetsMutationCatalog != nullptr ||
        targetsMutationDecisions != nullptr) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
        return true;
    }
    targetsMutationCatalog = new (std::nothrow) TargetCatalog(
        targetsProductRuntime->controller.catalog());
    targetsMutationDecisions = new (std::nothrow) CorrelationDecisionLog(
        targetsProductRuntime->controller.decisions());
    if (targetsMutationCatalog == nullptr || targetsMutationDecisions == nullptr) {
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "workspace_unavailable";
        lastRuntimeEvent = "targets_store_workspace_unavailable";
        return true;
    }
    targetsMutationTargetId = selected->id;
    targetsMutationCorrelation = false;
    targetsMutationProposal = {};
    targetsMutationKind = kind;
    targetsMutationFavorite = favorite;
    targetsMutationText.fill('\0');
    targetsMutationTextLength = 0;
    if (kind == TargetActionKind::SetName ||
        kind == TargetActionKind::SetNotes ||
        kind == TargetActionKind::AddTag ||
        kind == TargetActionKind::RemoveTag) {
        const bool tagAction = kind == TargetActionKind::AddTag ||
            kind == TargetActionKind::RemoveTag;
        const std::size_t maximum = tagAction
            ? TargetRecord::kTagCapacity
            : kind == TargetActionKind::SetNotes
                  ? TargetRecord::kNotesCapacity
                  : TargetRecord::kNameCapacity;
        if (text == nullptr || textLength > maximum ||
            (tagAction && textLength == 0)) {
            delete targetsMutationCatalog;
            delete targetsMutationDecisions;
            targetsMutationCatalog = nullptr;
            targetsMutationDecisions = nullptr;
            targetsMutationState = TargetsMutationState::Failed;
            targetsMutationStatus = tagAction
                ? "tag_invalid"
                : kind == TargetActionKind::SetNotes
                      ? "notes_invalid" : "name_invalid";
            lastRuntimeEvent = tagAction
                ? "targets_store_tag_invalid"
                : kind == TargetActionKind::SetNotes
                      ? "targets_store_notes_invalid"
                      : "targets_store_name_invalid";
            return true;
        }
        if (textLength != 0) {
            std::memcpy(targetsMutationText.data(), text, textLength);
        }
        targetsMutationTextLength = static_cast<std::uint16_t>(textLength);
    }
    targetsMutationReport = {};
    releaseTargetsProduct();
    targetsMutationState = TargetsMutationState::Saving;
    targetsMutationStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runTargetsMutationWorker, "leshy-targets-store", 8192, nullptr, 1,
        &targetsMutationTaskHandle, 0) == pdPASS;
    targetsMutationStartActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    if (!started) {
        targetsMutationTaskHandle = nullptr;
        rebuildTargetsProductFromCatalog(targetsMutationCatalog,
                                         targetsMutationDecisions,
                                         targetsMutationTargetId, true);
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
    } else {
        targetsProductStatus = "saving";
        lastRuntimeEvent = "targets_store_saving";
    }
    return true;
}

bool requestTargetsCorrelationMutation(CorrelationActionKind kind) {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() !=
            TargetsView::CorrelationReview ||
        targetsProductRuntime->controller.correlationReviewSelection() < 2 ||
        targetsMutationState == TargetsMutationState::Saving) {
        return false;
    }
    const auto* proposal =
        targetsProductRuntime->controller.reviewedCorrelationProposal();
    if (proposal == nullptr) return false;
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "power_unsafe";
        lastRuntimeEvent = "targets_store_power_unsafe";
        return true;
    }
    if (targetsMutationEvents == nullptr ||
        targetsMutationTaskHandle != nullptr ||
        targetsMutationCatalog != nullptr ||
        targetsMutationDecisions != nullptr) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
        return true;
    }
    targetsMutationCatalog = new (std::nothrow) TargetCatalog(
        targetsProductRuntime->controller.catalog());
    targetsMutationDecisions = new (std::nothrow) CorrelationDecisionLog(
        targetsProductRuntime->controller.decisions());
    if (targetsMutationCatalog == nullptr || targetsMutationDecisions == nullptr) {
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "workspace_unavailable";
        lastRuntimeEvent = "targets_store_workspace_unavailable";
        return true;
    }
    targetsMutationCorrelation = true;
    targetsMutationCorrelationKind = kind;
    targetsMutationProposal = *proposal;
    targetsMutationTargetId = proposal->targetId;
    targetsMutationText.fill('\0');
    targetsMutationTextLength = 0;
    targetsMutationReport = {};
    releaseTargetsProduct();
    targetsMutationState = TargetsMutationState::Saving;
    targetsMutationStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runTargetsMutationWorker, "leshy-targets-store", 8192, nullptr, 1,
        &targetsMutationTaskHandle, 0) == pdPASS;
    targetsMutationStartActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    if (!started) {
        targetsMutationTaskHandle = nullptr;
        rebuildTargetsProductFromCatalog(
            targetsMutationCatalog, targetsMutationDecisions,
            targetsMutationTargetId, true);
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
    } else {
        targetsProductStatus = "saving";
        lastRuntimeEvent = "targets_correlation_saving";
    }
    return true;
}

bool requestTargetsFavoriteMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::Actions ||
        targetsProductRuntime->controller.selectedAction() !=
            TargetActionItem::Favorite) {
        return false;
    }
    const auto* selected = targetsProductRuntime->controller.selectedTarget();
    return selected != nullptr && requestTargetsMutation(
        TargetActionKind::SetFavorite, !selected->favorite, nullptr, 0);
}

bool requestTargetsNameMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::NameEdit ||
        !targetsProductRuntime->controller.nameEditorDirty()) {
        return false;
    }
    return requestTargetsMutation(
        TargetActionKind::SetName, false,
        targetsProductRuntime->controller.nameEditorText(),
        targetsProductRuntime->controller.nameEditorLength());
}

