anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool requestTargetsTagAddMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::TagEdit ||
        !targetsProductRuntime->controller.tagEditorCanSave()) {
        return false;
    }
    return requestTargetsMutation(
        TargetActionKind::AddTag, false,
        targetsProductRuntime->controller.tagEditorText(),
        targetsProductRuntime->controller.tagEditorLength());
}

bool requestTargetsTagRemoveMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::TagList ||
        targetsProductRuntime->controller.selectedTagIsAdd() ||
        targetsProductRuntime->controller.selectedTagLength() == 0) {
        return false;
    }
    return requestTargetsMutation(
        TargetActionKind::RemoveTag, false,
        targetsProductRuntime->controller.selectedTagText(),
        targetsProductRuntime->controller.selectedTagLength());
}

bool requestTargetsNotesMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::NotesEdit ||
        !targetsProductRuntime->controller.notesEditorDirty()) {
        return false;
    }
    return requestTargetsMutation(
        TargetActionKind::SetNotes, false,
        targetsProductRuntime->controller.notesEditorText(),
        targetsProductRuntime->controller.notesEditorLength());
}

void serviceTargetsMutationWorker() {
    if (targetsMutationEvents == nullptr) return;
    TargetsMutationEvent event;
    if (xQueueReceive(targetsMutationEvents, &event, 0) != pdTRUE) return;
    targetsMutationTaskHandle = nullptr;
    targetsMutationReport = event;
    const bool rebuilt = rebuildTargetsProductFromCatalog(
        event.catalogRecovered ? targetsMutationCatalog : nullptr,
        event.catalogRecovered ? targetsMutationDecisions : nullptr,
        event.targetId, true);
    if (rebuilt && event.correlation && targetsProductRuntime != nullptr) {
        for (std::size_t index = 0; index < 4; ++index) {
            targetsProductRuntime->controller.next();
        }
    } else if (rebuilt && event.actionKind == TargetActionKind::SetName &&
        targetsProductRuntime != nullptr) {
        targetsProductRuntime->controller.next();
    } else if (rebuilt &&
               (event.actionKind == TargetActionKind::AddTag ||
                event.actionKind == TargetActionKind::RemoveTag) &&
               targetsProductRuntime != nullptr) {
        targetsProductRuntime->controller.next();
        targetsProductRuntime->controller.next();
        targetsProductRuntime->controller.openTagList();
    } else if (rebuilt && event.actionKind == TargetActionKind::SetNotes &&
               targetsProductRuntime != nullptr) {
        targetsProductRuntime->controller.next();
        targetsProductRuntime->controller.next();
        targetsProductRuntime->controller.next();
        targetsProductRuntime->controller.openNotesEditor();
    }
    delete targetsMutationCatalog;
    delete targetsMutationDecisions;
    targetsMutationCatalog = nullptr;
    targetsMutationDecisions = nullptr;
    if (event.catalogRecovered) {
        targetsStateGeneration = event.generation;
        targetsStateHead = event.head;
    }
    targetsMutationState = event.persisted && event.cleanupComplete && rebuilt
        ? TargetsMutationState::Saved : TargetsMutationState::Failed;
    targetsMutationStatus = targetsMutationState == TargetsMutationState::Saved
        ? "saved" : event.status;
    targetsProductStatus = rebuilt ? "ready" : targetsProductStatus;
    lastRuntimeEvent = targetsMutationState == TargetsMutationState::Saved
        ? "targets_store_saved" : "targets_store_failed";
    if (uiController.page() == 7) renderInteractiveScreen();
}

bool IRAM_ATTR recordProductBootRecoveryTimeout() {
    if (__atomic_exchange_n(&productBootRecoveryWatchdogArmed, 0,
                            __ATOMIC_ACQ_REL) == 0) {
        return false;
    }
    if (productBootRetryRtcMagic == kProductBootRetryRtcMagic &&
        productBootRetryRestarts <
            leshy1::storage::kProductBootMaximumAttempts) {
        ++productBootRetryRestarts;
        ++productBootRetryTimeouts;
    }
    return true;
}

static_assert(BoardProfile::kBuzzerPin == 2 &&
                  BoardProfile::kNrfCePins[0] == 15 &&
                  BoardProfile::kNrfCePins[1] == 47 &&
                  BoardProfile::kNrfCePins[2] == 14,
              "Task-WDT emergency GPIO masks must match the board profile");

void IRAM_ATTR quiesceEmergencyGpioFromIsr() {
    // GPIO2 is the active-high buzzer. GPIO14/15/47 are every declared nRF CE
    // path. Write-one-to-clear is peripheral-local, allocation-free, and does
    // not depend on a healthy scheduler or flash-resident Arduino code.
    GPIO.out_w1tc = (1U << 2U) | (1U << 14U) | (1U << 15U);
    GPIO.out1_w1tc.val = (1U << (47U - 32U));
}

bool IRAM_ATTR recordRuntimeSafetyWatchdogTrip() {
    if (__atomic_exchange_n(&runtimeSafetyWatchdogArmed, 0,
                            __ATOMIC_ACQ_REL) == 0) {
        return false;
    }
    quiesceEmergencyGpioFromIsr();
    const std::uint32_t appIdentity = runtimeSafetyAppIdentity;
    const std::uint32_t reason =
        static_cast<std::uint32_t>(SafetyReason::RuntimeWatchdog);
    const std::uint32_t tripCount = runtimeSafetyNextTripCount;
    const std::uint32_t quiesceCount = runtimeSafetyNextQuiesceCount;
    // Invalidate first and publish magic last. Complements reject a reset in
    // the middle of this bounded RTC write sequence.
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = leshy1::kernel::safety::kSafetyRetainedSchema;
    safetyRetainedRtc.appIdentity = appIdentity;
    safetyRetainedRtc.appIdentityInverse = ~appIdentity;
    safetyRetainedRtc.reason = reason;
    safetyRetainedRtc.reasonInverse = ~reason;
    safetyRetainedRtc.tripCount = tripCount;
    safetyRetainedRtc.tripCountInverse = ~tripCount;
    safetyRetainedRtc.quiesceCount = quiesceCount;
    safetyRetainedRtc.quiesceCountInverse = ~quiesceCount;
    safetyRetainedRtc.latchConfirmed = 0;
    safetyRetainedRtc.latchConfirmedInverse = ~1U;
    __atomic_thread_fence(__ATOMIC_RELEASE);
    safetyRetainedRtc.magic = leshy1::kernel::safety::kSafetyRetainedMagic;
    return true;
}

extern "C" void IRAM_ATTR esp_task_wdt_isr_user_handler() {
    // The Task WDT ISR is the last-resort path when the scheduler-based
    // watchdog cannot run. Only claim the already armed recovery attempt and
    // retain its reason; the configured panic path performs the reset.
    if (!recordProductBootRecoveryTimeout()) {
        recordRuntimeSafetyWatchdogTrip();
    }
}

void watchProductBootRecovery(void*) {
    delay(leshy1::storage::kProductBootRecoveryWatchdogMs);
    if (recordProductBootRecoveryTimeout()) {
        // Recovery may hold filesystem or console locks. Do not log, flush,
        // or run shutdown handlers here; retain the reason in RTC and force a
        // digital restart from this independent task.
        esp_restart_noos();
    }
    vTaskDelete(nullptr);
}

bool armProductBootRecoveryWatchdog() {
    productBootRecoveryTaskWatchdogAdded = false;
    const esp_err_t taskWatchdogStatus = esp_task_wdt_status(nullptr);
    if (taskWatchdogStatus == ESP_ERR_NOT_FOUND) {
        if (esp_task_wdt_add(nullptr) != ESP_OK) return false;
        productBootRecoveryTaskWatchdogAdded = true;
    } else if (taskWatchdogStatus != ESP_OK) {
        return false;
    }
    if (esp_task_wdt_reset() != ESP_OK) {
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 1,
                     __ATOMIC_RELEASE);
    productBootRecoveryWatchdogTask = nullptr;
    if (xTaskCreatePinnedToCore(
            watchProductBootRecovery, "leshy-sd-boot-watch", 2048, nullptr, 3,
            &productBootRecoveryWatchdogTask, 0) != pdPASS) {
        __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                         __ATOMIC_RELEASE);
        productBootRecoveryWatchdogTask = nullptr;
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    return true;
}

