anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void admitPersistentLibraryCapability(const char* evidence) {
    if (inventory.find("library.persistent_session") == nullptr) {
        inventory.add({"library.persistent_session", CapabilityState::Available,
                       evidence, "validated_session_open"});
    }
    appCatalog.rebuild(inventory);
    renderInteractiveScreen();
}

void emitProductEnrollment(Stream& reply, const char* expectedFingerprint) {
    recoverProductCatalogForFingerprint(expectedFingerprint, false);
    const bool recoveryValid =
        std::strcmp(productBootRecovery.status, "admitted") == 0 &&
        productBootRecovery.catalogAdmitted &&
        productBootRecovery.readOnlyGuaranteed &&
        productBootRecovery.blockedWriteAttempts == 0 &&
        productBootRecovery.cleanupComplete;
    const bool enrollmentSaved = recoveryValid &&
        saveProductFingerprint(expectedFingerprint);
    productBootRecovery.enrolled = enrollmentSaved;
    if (enrollmentSaved) {
        admitPersistentLibraryCapability("explicit_readonly_enrollment");
    }

    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.product_enrollment.v1\","
        "\"kind\":\"result\",\"mode\":\"enroll\",\"status\":\"%s\","
        "\"expected_fingerprint\":\"%s\","
        "\"observed_fingerprint\":\"%s\",\"fingerprint_matched\":%s,"
        "\"mounted_read_only\":%s,\"read_only_guaranteed\":%s,"
        "\"write_enabled\":false,\"blocked_write_attempts\":%lu,"
        "\"catalog_status\":\"%s\",\"catalog_admitted\":%s,"
        "\"generation\":%lu,\"observations\":%u,"
        "\"enrollment_saved\":%s,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"physical_write_calls\":0}",
        enrollmentSaved ? "valid" : "failed", expectedFingerprint,
        productBootRecovery.observedFingerprint,
        productBootRecovery.fingerprintMatched ? "true" : "false",
        productBootRecovery.mountedReadOnly ? "true" : "false",
        productBootRecovery.readOnlyGuaranteed ? "true" : "false",
        static_cast<unsigned long>(productBootRecovery.blockedWriteAttempts),
        leshy1::apps::library::sessionCatalogStatusName(
            productBootRecovery.catalog.status),
        productBootRecovery.catalogAdmitted ? "true" : "false",
        static_cast<unsigned long>(productBootRecovery.catalog.generation),
        static_cast<unsigned>(productBootRecovery.catalog.observations),
        enrollmentSaved ? "true" : "false",
        static_cast<unsigned long>(productBootRecovery.ownedAfter),
        productBootRecovery.cleanupComplete ? "true" : "false");
    reply.println(line);
}

void emitProductUnenrollment(Stream& reply) {
    char enrolledFingerprint[33] = {};
    const bool wasEnrolled = loadProductFingerprint(
        enrolledFingerprint, sizeof(enrolledFingerprint));
    const bool cleared = clearProductFingerprint();
    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.product_enrollment.v1\","
        "\"kind\":\"result\",\"mode\":\"unenroll\",\"status\":\"%s\","
        "\"was_enrolled\":%s,\"cleared_fingerprint\":\"%s\","
        "\"nvs_key_removed\":%s,\"sd_accessed\":false,"
        "\"sd_data_untouched\":true,\"active_catalog_unchanged\":true,"
        "\"reboot_required\":true,\"physical_write_calls\":0}",
        cleared ? "valid" : "failed", wasEnrolled ? "true" : "false",
        wasEnrolled ? enrolledFingerprint : "", cleared ? "true" : "false");
    reply.println(line);
}

bool prepareBatchThroughputSession(std::size_t* encodedBytes) {
    if (encodedBytes == nullptr) return false;
    *encodedBytes = 0;
    librarySession.reset();
    if (librarySession.start("batch-wifi-64", 1000) != SessionStatus::Started) {
        return false;
    }
    for (std::size_t index = 0;
         index < SurveySession::kObservationCapacity; ++index) {
        WifiScanRecord record;
        record.bssid = {
            0x02, 0xBA, 0x7C, 0x48,
            static_cast<std::uint8_t>(index >> 8U),
            static_cast<std::uint8_t>(index + 1U),
        };
        record.channel = static_cast<std::uint8_t>(1U + index % 13U);
        record.rssiDbm = static_cast<std::int16_t>(-35 - index % 55U);
        char label[Observation::kLabelCapacity + 1] = {};
        std::snprintf(label, sizeof(label),
                      "batch-ap-%02u-0123456789abcdefghij",
                      static_cast<unsigned>(index));
        record.ssid = label;
        record.ssidLength = std::strlen(label);
        Observation observation;
        if (!leshy1::drivers::wifi::normalizePassiveRecord(
                record, 2000U + static_cast<std::uint64_t>(index),
                &observation) ||
            librarySession.append(observation) != SessionStatus::Appended) {
            return false;
        }
    }
    if (librarySession.stop(3000) != SessionStatus::Stopped) return false;
    return leshy1::storage::encodeObservationSegment(
               librarySession, sessionStoreWorkspace.segment.data(),
               sessionStoreWorkspace.segment.size(), encodedBytes) ==
               leshy1::storage::SessionCodecStatus::Valid &&
           *encodedBytes >=
               leshy1::services::survey::SessionBatchPolicy{}.targetEncodedBytes;
}

bool parseLittleFsParityCommand(const char* command, char* fingerprint,
                                std::size_t fingerprintCapacity, char* runId,
                                std::size_t runIdCapacity) {
    if (command == nullptr || fingerprint == nullptr || runId == nullptr ||
        fingerprintCapacity < 65 || runIdCapacity < 33 ||
        std::strncmp(command, kLittleFsParityPrefix,
                     std::strlen(kLittleFsParityPrefix)) != 0) {
        return false;
    }
    char extra = '\0';
    const int parsed = std::sscanf(
        command + std::strlen(kLittleFsParityPrefix),
        "%64[0-9a-fA-F] %32[A-Za-z0-9_-] %c", fingerprint, runId, &extra);
    return parsed == 2 && std::strlen(fingerprint) == 64 && runId[0] != '\0';
}

