anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6) {
        if (selfTestController.view() == SelfTestView::ModeMenu) {
            return {back, choose, enter};
        }
        if (selfTestController.view() == SelfTestView::Preflight) {
            return {{NavigationKey::Left, UiTextId::NavModes}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (selfTestController.view() == SelfTestView::VisualCheck) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavNext}};
        }
        if (selfTestController.view() == SelfTestView::ActiveChecks) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
        }
        return {{NavigationKey::Left, UiTextId::NavModes}, {}, {}};
    }
    if (uiController.page() == 7) {
        if (targetsMutationState == TargetsMutationState::Saving) {
            return {{}, {}, {}};
        }
        if (targetsProductRuntime == nullptr) return {back, {}, {}};
        if (targetsProductRuntime->controller.view() == TargetsView::List) {
            return targetsProductRuntime->controller.entryCount() == 0
                ? NavigationFooter{back, {}, {}}
                : NavigationFooter{back, choose, enter};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::Compare) {
            return targetsProductRuntime->controller.comparisonSize() == 0
                ? NavigationFooter{
                      {NavigationKey::Left, UiTextId::NavList}, {}, {}}
                : NavigationFooter{
                      {NavigationKey::Left, UiTextId::NavList}, choose, enter};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CompareDetail) {
            return {{NavigationKey::Left, UiTextId::NavChanges}, {}, {}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationList) {
            return {{NavigationKey::Left, UiTextId::NavActions}, choose,
                    {NavigationKey::RightAndSelect, UiTextId::NavEnter}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationReview) {
            return {{NavigationKey::Left, UiTextId::NavBack}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller
                                 .correlationReviewSelection() < 2
                         ? UiTextId::NavEnter : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationEvidence) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {}, {}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::NameEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.nameEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::TagEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.tagEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::TagList) {
            return {{NavigationKey::Left, UiTextId::NavActions}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller.selectedTagIsAdd()
                         ? UiTextId::NavEnter : UiTextId::NavDelete}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::NotesEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.notesEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::Actions) {
            return {{NavigationKey::Left, UiTextId::NavDetails}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller.selectedAction() ==
                             TargetActionItem::Favorite
                         ? UiTextId::NavToggle : UiTextId::NavEnter}};
        }
        return {{NavigationKey::Left, UiTextId::NavList}, {},
                {NavigationKey::RightAndSelect, UiTextId::NavActions}};
    }
    if (uiController.page() == kDevicePage) return {back, choose, enter};
    return {back, {}, {}};
}

constexpr std::int16_t kNavigationInset = 6;
constexpr std::int16_t kNavigationGap = 4;
constexpr std::int16_t kNavigationArrowWidth = 9;
constexpr std::int16_t kNavigationUpDownWidth = 23;

std::int16_t navigationKeyWidth(NavigationKey key) {
    if (key == NavigationKey::Left) return kNavigationArrowWidth;
    if (key == NavigationKey::UpDown) return kNavigationUpDownWidth;
    if (key == NavigationKey::RightAndSelect) {
        selectUiFont(UiTextRole::Meta);
        return display.textWidth(tr(UiTextId::NavOk)) + 3 +
               kNavigationArrowWidth;
    }
    return 0;
}

void renderNavigationKey(NavigationKey key, std::int16_t x,
                         std::int16_t centerY, std::int16_t textTop) {
    if (key == NavigationKey::Left) {
        display.fillTriangle(x, centerY, x + 8, centerY - 5,
                             x + 8, centerY + 5, Palette::TextSecondary);
    } else if (key == NavigationKey::UpDown) {
        display.fillTriangle(x, centerY + 2, x + 5, centerY - 4,
                             x + 10, centerY + 2,
                             Palette::TextSecondary);
        display.fillTriangle(x + 12, centerY - 2, x + 17, centerY + 4,
                             x + 22, centerY - 2,
                             Palette::TextSecondary);
    } else if (key == NavigationKey::RightAndSelect) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        selectUiFont(UiTextRole::Meta);
        const char* ok = tr(UiTextId::NavOk);
        const std::int16_t okWidth = display.textWidth(ok);
        setUiCursor(UiTextRole::Meta, x, textTop);
        display.print(ok);
        const std::int16_t arrowX = x + okWidth + 3;
        display.fillTriangle(arrowX, centerY - 5, arrowX, centerY + 5,
                             arrowX + 8, centerY,
                             Palette::TextSecondary);
    }
}

void renderNavigationCell(std::uint8_t index, NavigationCell cell) {
    if (cell.key == NavigationKey::None || cell.label == UiTextId::Count) return;
    const Rect bounds = Components::navigationCell(index);
    const char* label = tr(cell.label);
    selectUiFont(UiTextRole::Meta);
    const std::int16_t labelWidth = display.textWidth(label);
    const std::int16_t keyWidth = navigationKeyWidth(cell.key);
    const std::int16_t totalWidth = keyWidth + kNavigationGap + labelWidth;
    const std::int16_t textHeight = kRobotoCondensedMetaAscent +
                                    kRobotoCondensedMetaDescent;
    const std::int16_t textTop = bounds.y + (bounds.height - textHeight) / 2;
    const std::int16_t centerY = bounds.y + bounds.height / 2;
    std::int16_t x = bounds.x + (bounds.width - totalWidth) / 2;
    if (index == 0) x = bounds.x + kNavigationInset;
    if (index == 2) {
        x = bounds.x + bounds.width - kNavigationInset - totalWidth;
    }
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    if (cell.key == NavigationKey::RightAndSelect) {
        setUiCursor(UiTextRole::Meta, x, textTop);
        display.print(label);
        renderNavigationKey(cell.key, x + labelWidth + kNavigationGap,
                            centerY, textTop);
    } else {
        renderNavigationKey(cell.key, x, centerY, textTop);
        setUiCursor(UiTextRole::Meta, x + keyWidth + kNavigationGap,
                    textTop);
        display.print(label);
    }
}

