anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiTextId settingsLabel(std::uint8_t index) {
    switch (static_cast<InterfaceSetting>(index)) {
        case InterfaceSetting::Language: return UiTextId::SettingsLanguage;
        case InterfaceSetting::Brightness: return UiTextId::SettingsBrightness;
        case InterfaceSetting::Theme: return UiTextId::SettingsTheme;
        case InterfaceSetting::Sound: return UiTextId::SettingsSound;
    }
    return UiTextId::SettingsSound;
}

UiTextId settingsNote(std::uint8_t index) {
    switch (static_cast<InterfaceSetting>(index)) {
        case InterfaceSetting::Language:
            return languageController.active() == UiLanguage::Russian
                       ? UiTextId::SettingsLanguageRussian
                       : UiTextId::SettingsLanguageEnglish;
        case InterfaceSetting::Brightness: return settingsBrightnessNote();
        case InterfaceSetting::Theme:
            return interfaceSettingsController.theme() ==
                           InterfaceTheme::HighContrast
                       ? UiTextId::SettingsThemeContrast
                       : UiTextId::SettingsThemeForest;
        case InterfaceSetting::Sound: return UiTextId::SettingsSoundLocked;
    }
    return UiTextId::SettingsSoundLocked;
}

void renderSettingsRow(std::uint8_t index) {
    if (index >= InterfaceSettingsController::kItemCount) return;
    const bool enabled = static_cast<InterfaceSetting>(index) !=
                         InterfaceSetting::Sound;
    renderMenuRow(Components::homeRow(index), tr(settingsLabel(index)),
                  tr(settingsNote(index)),
                  interfaceSettingsController.selection() == index, enabled,
                  enabled ? Tone::Positive : Tone::Muted);
}

void renderSettingsPage(bool clearContent) {
    renderHeader(tr(UiTextId::SettingsTitle), clearContent);
    for (std::uint8_t index = 0;
         index < InterfaceSettingsController::kItemCount; ++index) {
        renderSettingsRow(index);
    }
}

void renderWifiCapturePage(bool clearContent) {
    const auto stats = wifiFrameCapture.stats();
    const auto renderPageHeader = [&](UiTextId stateTitle) {
        renderHeader(tr(stateTitle), clearContent);
    };
    char line[64] = {};
    if (stats.state == WifiFrameCaptureState::Idle) {
        renderPageHeader(UiTextId::CaptureSetup);
        renderMetric(0, tr(UiTextId::CaptureWifiPurpose), Tone::Positive);
        renderMetric(1, tr(UiTextId::CaptureDurationUser));
        renderMetric(2, tr(UiTextId::CaptureAutoChannelsUser));
        return;
    }

    if (stats.state == WifiFrameCaptureState::Running) {
        renderPageHeader(UiTextId::CaptureRunning);
    } else if (stats.state == WifiFrameCaptureState::Complete) {
        const UiTextId title =
            capturePersistState == CapturePersistState::Confirm
                ? UiTextId::CaptureSaveConfirm
                : capturePersistState == CapturePersistState::Saving
                      ? UiTextId::CaptureSaving
                      : capturePersistState == CapturePersistState::Saved
                            ? UiTextId::CaptureSaved
                            : capturePersistState == CapturePersistState::Failed
                                  ? UiTextId::CaptureSaveFailed
                                  : UiTextId::CaptureResult;
        renderPageHeader(title);
    } else {
        renderPageHeader(UiTextId::CaptureError);
    }
    if (stats.state == WifiFrameCaptureState::Failed) {
        renderMetric(0, tr(UiTextId::CaptureRecordFailedUser), Tone::Danger);
        renderMetric(1, tr(UiTextId::CaptureTryAgainUser));
        return;
    }

    if (stats.framesAccepted == 0U &&
        stats.state == WifiFrameCaptureState::Complete) {
        renderMetric(0, tr(UiTextId::CaptureNoPackets), Tone::Warning);
    } else {
        std::snprintf(line, sizeof(line), tr(UiTextId::CapturePacketsFormat),
                      static_cast<unsigned long>(stats.framesAccepted));
        renderMetric(0, line, Tone::Positive);
    }
    if (stats.state == WifiFrameCaptureState::Running) {
        std::snprintf(line, sizeof(line), tr(UiTextId::CaptureChannelFormat),
                      static_cast<unsigned>(
                          wifiFrameCapture.currentChannel()));
        renderMetric(1, line);
        renderMetric(2, tr(UiTextId::CaptureRecordingUser), Tone::Positive);
    } else {
        renderMetric(1, tr(UiTextId::CapturePcapReadyUser), Tone::Positive);
        const UiTextId storageMessage =
            capturePersistState == CapturePersistState::Confirm
                ? UiTextId::CaptureIdentifiersWarning
                : capturePersistState == CapturePersistState::Saving
                      ? UiTextId::CaptureSavingUser
                      : capturePersistState == CapturePersistState::Saved
                            ? UiTextId::CaptureSavedUser
                            : capturePersistState == CapturePersistState::Failed
                                  ? UiTextId::CaptureSaveFailedUser
                                  : UiTextId::CaptureReadyToSave;
        renderMetric(2, tr(storageMessage),
                     capturePersistState == CapturePersistState::Failed
                         ? Tone::Danger
                         : capturePersistState == CapturePersistState::Confirm
                               ? Tone::Warning
                               : Tone::Positive);
    }
    const std::uint32_t dropped = stats.framesDroppedCapacity +
                                  stats.framesDroppedInvalid;
    if (dropped != 0U) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::CaptureLossWarningFormat),
                      static_cast<unsigned long>(dropped));
        renderMetric(3, line, Tone::Warning);
    }
    if (stats.state == WifiFrameCaptureState::Running) {
        wifiCaptureRenderedFrames = stats.framesAccepted;
        wifiCaptureRenderedChannel = wifiFrameCapture.currentChannel();
        wifiCaptureRenderedDrops = dropped;
    }
}

void renderWifiCaptureLiveData() {
    const auto stats = wifiFrameCapture.stats();
    if (stats.state != WifiFrameCaptureState::Running) return;
    char line[64] = {};
    if (wifiCaptureRenderedFrames != stats.framesAccepted) {
        const Rect bounds = Components::metricRow(0);
        display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                         Palette::Canvas);
        std::snprintf(line, sizeof(line), tr(UiTextId::CapturePacketsFormat),
                      static_cast<unsigned long>(stats.framesAccepted));
        renderMetric(0, line, Tone::Positive);
        wifiCaptureRenderedFrames = stats.framesAccepted;
    }
    const std::uint8_t channel = wifiFrameCapture.currentChannel();
    if (wifiCaptureRenderedChannel != channel) {
        const Rect bounds = Components::metricRow(1);
        display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                         Palette::Canvas);
        std::snprintf(line, sizeof(line), tr(UiTextId::CaptureChannelFormat),
                      static_cast<unsigned>(channel));
        renderMetric(1, line);
        wifiCaptureRenderedChannel = channel;
    }
    const std::uint32_t dropped = stats.framesDroppedCapacity +
                                  stats.framesDroppedInvalid;
    if (wifiCaptureRenderedDrops != dropped) {
        const Rect bounds = Components::metricRow(3);
        display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                         Palette::Canvas);
        if (dropped != 0U) {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::CaptureLossWarningFormat),
                          static_cast<unsigned long>(dropped));
            renderMetric(3, line, Tone::Warning);
        }
        wifiCaptureRenderedDrops = dropped;
    }
}

void renderCaptureSourceMenu(bool clearContent) {
    renderHeader(tr(UiTextId::CaptureSources), clearContent);
    renderMenuRow(Components::choiceRow(0), tr(UiTextId::CaptureWifiSource),
                  tr(UiTextId::CaptureWifiSourceNote),
                  captureSourceSelection == 0, true, Tone::Positive);
    renderMenuRow(Components::choiceRow(1), tr(UiTextId::CaptureIrSource),
                  tr(UiTextId::CaptureIrSourceNote),
                  captureSourceSelection == 1, BoardProfile::kIrDeclared,
                  BoardProfile::kIrDeclared ? Tone::Positive : Tone::Muted);
}

void renderInfraredCapturePage(bool clearContent) {
    const auto& stats = infraredCapture.stats();
    char line[64] = {};
    if (stats.state == InfraredCaptureState::Idle) {
        renderHeader(tr(UiTextId::CaptureIrSource), clearContent);
        renderMetric(0, tr(UiTextId::IrAimDevice), Tone::Positive);
        renderMetric(1, tr(UiTextId::IrPressButton));
        renderMetric(2, tr(UiTextId::IrWaitUser));
        return;
    }

    UiTextId title = UiTextId::IrError;
    if (stats.state == InfraredCaptureState::Waiting) {
        title = UiTextId::IrWaiting;
    } else if (stats.state == InfraredCaptureState::Capturing) {
        title = UiTextId::IrCapturing;
    } else if (stats.state == InfraredCaptureState::Complete) {
        title = UiTextId::IrResult;
    } else if (stats.state == InfraredCaptureState::TimedOut) {
        title = UiTextId::IrNoSignal;
    } else if (stats.state == InfraredCaptureState::Unreliable) {
        title = UiTextId::IrUnreliable;
    }
    renderHeader(tr(title), clearContent);
    if (stats.state == InfraredCaptureState::Waiting) {
        renderMetric(0, tr(UiTextId::IrAimDevice), Tone::Positive);
        renderMetric(1, tr(UiTextId::IrPressButton));
        renderMetric(2, tr(UiTextId::IrWaitUser));
    } else if (stats.state == InfraredCaptureState::Capturing) {
        renderMetric(0, tr(UiTextId::IrSignalDetected), Tone::Positive);
        renderMetric(1, tr(UiTextId::IrKeepPressed));
    } else if (stats.state == InfraredCaptureState::Complete) {
        renderMetric(0, tr(UiTextId::IrSignalDetected), Tone::Positive);
        if (infraredCapture.decode().integrityValid) {
            std::snprintf(line, sizeof(line), tr(UiTextId::IrProtocolFormat),
                          leshy1::domain::captures::infraredProtocolName(
                              infraredCapture.decode().protocol));
            renderMetric(1, line, Tone::Positive);
            std::snprintf(line, sizeof(line), tr(UiTextId::IrCodeFormat),
                          static_cast<unsigned long>(
                              infraredCapture.decode().rawCode));
            renderMetric(2, line);
        } else {
            renderMetric(1, tr(UiTextId::IrUnknownFormat), Tone::Warning);
        }
        const UiTextId storageMessage =
            infraredCapturePersistState == CapturePersistState::Saving
                ? UiTextId::CaptureSavingUser
                : infraredCapturePersistState == CapturePersistState::Saved
                      ? UiTextId::CaptureSavedUser
                      : infraredCapturePersistState == CapturePersistState::Failed
                            ? UiTextId::CaptureSaveFailedUser
                            : UiTextId::CaptureReadyToSave;
        renderMetric(3, tr(storageMessage),
                     infraredCapturePersistState == CapturePersistState::Failed
                         ? Tone::Danger : Tone::Positive);
    } else if (stats.state == InfraredCaptureState::TimedOut) {
        renderMetric(0, tr(UiTextId::IrNoSignalDetected), Tone::Warning);
        renderMetric(1, tr(UiTextId::IrTryCloser));
        renderMetric(2, tr(UiTextId::CaptureTryAgainUser));
    } else if (stats.state == InfraredCaptureState::Unreliable) {
        renderMetric(0, tr(UiTextId::IrSignalDetected), Tone::Warning);
        renderMetric(1, tr(UiTextId::IrReadUnreliable), Tone::Danger);
        renderMetric(2, tr(UiTextId::CaptureTryAgainUser));
    } else {
        renderMetric(0, tr(UiTextId::CaptureRecordFailedUser), Tone::Danger);
        renderMetric(1, tr(UiTextId::CaptureTryAgainUser));
    }
}

void renderCapturePage(bool clearContent) {
    if (captureView == CaptureView::SourceMenu) {
        renderCaptureSourceMenu(clearContent);
    } else if (captureView == CaptureView::Infrared) {
        renderInfraredCapturePage(clearContent);
    } else {
        renderWifiCapturePage(clearContent);
    }
}

void renderSelfTestModeRow(std::uint8_t index) {
    const UiTextId labels[2] = {UiTextId::Quick, UiTextId::FullGuided};
    const UiTextId notes[2] = {UiTextId::QuickNote, UiTextId::FullNote};
    if (index >= 2) return;
    const bool selected = selfTestController.selection() == index;
    renderMenuRow(Components::choiceRow(index), tr(labels[index]),
                  tr(notes[index]), selected, true,
                  index == 0 ? Tone::Positive : Tone::Warning);
}

void renderSelfTestPage(bool clearContent) {
    char line[96] = {};
    if (selfTestController.view() == SelfTestView::ModeMenu) {
        renderHeader(tr(UiTextId::SelfTestTitle), clearContent);
        for (std::uint8_t index = 0; index < 2; ++index) {
            renderSelfTestModeRow(index);
        }
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::SelfTestNoBoot));
        return;
    }

