anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (selfTestController.view() == SelfTestView::Preflight) {
        renderHeader(tr(UiTextId::FullPreflight), clearContent);
        renderMetric(0, tr(UiTextId::QuickChecks9));
        renderMetric(1, tr(UiTextId::CapabilityPlanStaged));
        renderMetric(2, tr(UiTextId::SideEffectsNone));
        renderMetric(3, tr(UiTextId::ResultBlocked), Tone::Warning);
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 203);
        display.print(tr(UiTextId::GuidedLater));
        return;
    }

    if (selfTestController.view() == SelfTestView::VisualCheck) {
        renderHeader(tr(UiTextId::VisualCheckTitle), clearContent);
        constexpr UiTextId states[SelfTestController::kVisualStateCount] = {
            UiTextId::VisualDialog,
            UiTextId::VisualUnavailable,
            UiTextId::VisualDegraded,
            UiTextId::VisualError,
            UiTextId::VisualRunning,
        };
        constexpr UiTextId details[SelfTestController::kVisualStateCount] = {
            UiTextId::VisualDialogDetail,
            UiTextId::VisualUnavailableDetail,
            UiTextId::VisualDegradedDetail,
            UiTextId::VisualErrorDetail,
            UiTextId::VisualRunningDetail,
        };
        constexpr Tone tones[SelfTestController::kVisualStateCount] = {
            Tone::Focus, Tone::Muted, Tone::Warning, Tone::Danger, Tone::Positive,
        };
        const std::uint8_t state = selfTestController.visualState();
        renderStateCard(tr(states[state]), tr(details[state]), tones[state], state);
        return;
    }

    if (selfTestController.view() == SelfTestView::ActiveChecks) {
        const bool artifactPhase =
            fullGuidedRfState.step == FullGuidedRfStep::Complete;
        renderHeader(tr(artifactPhase ? UiTextId::FullActiveDataTitle
                                     : UiTextId::FullActiveTitle),
                     clearContent);
        if (artifactPhase) {
            const bool disposablePhase =
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableCommit ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableRemountExport ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableCleanup ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::ProductVerify;
            if (disposablePhase) {
                renderMetric(
                    0,
                    fullGuidedArtifactState.disposableCommitPassed
                        ? tr(UiTextId::FullActiveScratchPass)
                        : tr(UiTextId::FullActiveScratchRun),
                    fullGuidedArtifactState.disposableCommitPassed
                        ? Tone::Positive : Tone::Warning);
                renderMetric(
                    1,
                    fullGuidedArtifactState.disposableExportPassed
                        ? tr(UiTextId::FullActiveRemountPass)
                        : tr(UiTextId::FullActiveRemountRun),
                    fullGuidedArtifactState.disposableExportPassed
                        ? Tone::Positive : Tone::Warning);
                renderMetric(
                    2,
                    fullGuidedArtifactState.disposableCleanupPassed &&
                            fullGuidedArtifactState.productVerifyPassed
                        ? tr(UiTextId::FullActiveCleanupPass)
                        : tr(UiTextId::FullActiveCleanupRun),
                    fullGuidedArtifactState.disposableCleanupPassed &&
                            fullGuidedArtifactState.productVerifyPassed
                        ? Tone::Positive : Tone::Warning);
                display.setTextColor(Palette::TextMuted, Palette::Canvas);
                setUiCursor(UiTextRole::Meta, 14, 207);
                display.print(tr(UiTextId::FullActiveDataSafety));
                return;
            }
            renderMetric(
                0,
                fullGuidedArtifactState.recoveryPassed
                    ? tr(UiTextId::FullActiveStoragePass)
                    : tr(UiTextId::FullActiveStorageRun),
                fullGuidedArtifactState.recoveryPassed ? Tone::Positive
                                                       : Tone::Warning);
            renderMetric(
                1,
                fullGuidedArtifactState.libraryPassed
                    ? tr(UiTextId::FullActiveLibraryPass)
                    : tr(UiTextId::FullActiveLibraryRun),
                fullGuidedArtifactState.libraryPassed ? Tone::Positive
                                                      : Tone::Warning);
            renderMetric(2, tr(UiTextId::FullActiveCaptureRun), Tone::Warning);
            display.setTextColor(Palette::TextMuted, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(tr(UiTextId::FullActiveDataSafety));
            return;
        }
        if (fullGuidedRfState.step == FullGuidedRfStep::Idle) {
            renderMetric(0, tr(UiTextId::FullActivePreparing), Tone::Warning);
        } else {
            renderMetric(
                0,
                fullGuidedRfState.nrf24Passed
                    ? tr(UiTextId::FullActiveNrfPass)
                    : tr(UiTextId::FullActiveNrfRunning),
                fullGuidedRfState.nrf24Passed ? Tone::Positive
                                               : Tone::Warning);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::FullActiveCcFormat),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins));
        renderMetric(1, line,
                     fullGuidedRfState.cc1101Passed ? Tone::Positive
                                                    : Tone::Warning);
        const unsigned s5ReceiveChecks =
            static_cast<unsigned>(fullGuidedRfState.subGhzOokComplete) +
            static_cast<unsigned>(fullGuidedRfState.subGhzFskComplete) +
            static_cast<unsigned>(fullGuidedRfState.infraredComplete);
        std::snprintf(line, sizeof(line), tr(UiTextId::FullActiveS5Format),
                      s5ReceiveChecks);
        renderMetric(2, line,
                     fullGuidedRfState.subGhzOokPassed &&
                             fullGuidedRfState.subGhzFskPassed &&
                             fullGuidedRfState.infraredPassed
                         ? Tone::Positive : Tone::Warning);
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::FullActiveSafety));
        return;
    }

    const SelfTestReport& report = selfTestController.report();
    renderHeader(report.status == SelfTestResultStatus::Pass
                     ? tr(UiTextId::SelfTestPass)
                     : (report.status == SelfTestResultStatus::Fail
                            ? tr(UiTextId::SelfTestFail)
                            : tr(UiTextId::SelfTestBlocked)),
                 clearContent);
    renderMetric(0,
                 report.mode == SelfTestMode::Quick ? tr(UiTextId::ModeQuick)
                                                    : tr(UiTextId::ModeFull),
                 report.status == SelfTestResultStatus::Pass
                     ? Tone::Positive
                     : (report.status == SelfTestResultStatus::Fail
                            ? Tone::Danger
                            : Tone::Warning));
    std::snprintf(line, sizeof(line), tr(UiTextId::ChecksFormat),
                  static_cast<unsigned>(report.passed),
                  static_cast<unsigned>(report.checkCount));
    renderMetric(1, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::FailBlockedFormat),
                  static_cast<unsigned>(report.failed),
                  static_cast<unsigned>(report.blocked),
                  static_cast<unsigned>(report.notApplicable));
    renderMetric(2, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::HeapMinFormat),
                  static_cast<unsigned long>(report.facts.heapMinimum / 1024U));
    renderMetric(3, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::InputDropsFormat),
                  static_cast<unsigned long>(report.facts.inputQueueDrops));
    renderMetric(4, line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 218);
    display.print(tr(report.readOnly ? UiTextId::SelfTestReportUsb
                                    : UiTextId::SelfTestReportActiveUsb));
}

