anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderOverview(bool clearContent) {
    char line[80] = {};
    renderHeader(tr(UiTextId::DiagnosticsTitle), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 82);
    display.print(tr(UiTextId::ProfileN16));

    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::FlashFormat),
                  static_cast<unsigned long>(bootMetrics.flashBytes / 1024U));
    setUiCursor(UiTextRole::Body, 14, 120);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::HeapFreeFormat),
                  static_cast<unsigned long>(ESP.getFreeHeap() / 1024U));
    setUiCursor(UiTextRole::Body, 14, 144);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::UiReadyFormat),
                  static_cast<unsigned long long>(bootMetrics.interactiveReadyUs));
    setUiCursor(UiTextRole::Body, 14, 168);
    display.print(line);

}

UiTextId safetyReasonTextId() {
    switch (safetySupervisor.reason()) {
        case SafetyReason::RuntimeWatchdog:
            return UiTextId::SafetyWatchdogReason;
        case SafetyReason::SupervisorUnavailable:
            return UiTextId::SafetySupervisorReason;
        case SafetyReason::OutputInvariant:
            return UiTextId::SafetyOutputReason;
        case SafetyReason::WorkerDeadline:
            return UiTextId::SafetyWorkerReason;
        default:
            return UiTextId::SafetyOutputReason;
    }
}

void renderSafetyStop(bool clearContent) {
    renderHeader(tr(UiTextId::SafetyStopTitle), clearContent);
    display.setTextColor(Palette::Danger, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 52);
    display.print(tr(safetyReasonTextId()));

    display.fillRoundRect(Layout::Edge, 88, Layout::ContentWidth, 82,
                          Layout::Radius, Palette::Surface);
    display.setTextColor(Palette::Positive, Palette::Surface);
    setUiCursor(UiTextRole::Body, 20, 101);
    display.print(tr(UiTextId::SafetyOutputsStopped));
    display.setTextColor(Palette::Warning, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 20, 137);
    display.print(tr(UiTextId::SafetyPowerWarning));

    display.setTextColor(Palette::TextPrimary, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 202);
    display.print(tr(safetySupervisor.clearPending()
                         ? UiTextId::SafetyClearConfirm
                         : UiTextId::SafetyClearPrompt));
    if (safetySupervisor.clearPending()) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 240);
        display.print(tr(UiTextId::SafetyClearCancel));
    }
}

constexpr std::size_t kVisibleSurveyRows = 2;
constexpr std::int16_t kSurveyFilterY = 101;
constexpr std::int16_t kSurveyRowsY = 132;
constexpr std::size_t kVisibleWifiNetworkRows = 4;

std::size_t surveyFirstVisible(std::size_t selection) {
    return selection < kVisibleSurveyRows
        ? 0
        : selection - kVisibleSurveyRows + 1;
}

void renderSurveyListRow(std::size_t index, std::size_t firstVisible) {
    const Observation* observation = surveyController.visibleAt(index);
    if (observation == nullptr) return;
    const std::int32_t y =
        kSurveyRowsY + static_cast<std::int32_t>(index - firstVisible) * 40;
    const bool selected = !surveyController.filterFocused() &&
                          surveyController.selection() == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, y, Layout::ContentWidth, 36,
                          Layout::Radius, background);
    renderFocusCue({Layout::Edge, static_cast<std::int16_t>(y),
                    Layout::ContentWidth, 36}, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset, y - 2);
    char visibleLabel[24] = {};
    const std::size_t visibleLength = observation->labelLength < 15U
        ? observation->labelLength : 15U;
    if (visibleLength == 0) {
        std::strcpy(visibleLabel, tr(UiTextId::Hidden));
    } else {
        std::memcpy(visibleLabel, observation->label.data(), visibleLength);
        if (observation->labelLength > visibleLength) {
            visibleLabel[visibleLength - 1U] = '~';
        }
    }
    display.print(visibleLabel);
    char line[96] = {};
    display.setTextColor(Palette::Positive, background);
    if (observation->radio == RadioKind::Ble) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleRssiFormat),
                      static_cast<int>(observation->rssiDbm));
    } else {
        std::snprintf(line, sizeof(line), tr(UiTextId::ChannelRssiFormat),
                      static_cast<unsigned>(observation->channel),
                      static_cast<int>(observation->rssiDbm));
    }
    setUiCursor(UiTextRole::Meta, 146, y + 13);
    display.print(line);
}

std::size_t wifiNetworkFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0
        : selection - kVisibleWifiNetworkRows + 1U;
}

std::uint8_t wifiSignalLevel(std::int16_t rssiDbm) {
    if (rssiDbm >= -55) return 4;
    if (rssiDbm >= -67) return 3;
    if (rssiDbm >= -78) return 2;
    return 1;
}

void renderWifiSignalBars(Rect bounds, std::int16_t rssiDbm,
                          std::uint16_t background) {
    constexpr std::int16_t kBarWidth = 4;
    constexpr std::int16_t kBarGap = 2;
    constexpr std::int16_t kBarCount = 4;
    const std::int16_t x = bounds.x + bounds.width - 30;
    const std::int16_t baseline = bounds.y + bounds.height - 12;
    const std::uint8_t level = wifiSignalLevel(rssiDbm);
    for (std::int16_t index = 0; index < kBarCount; ++index) {
        const std::int16_t height = 4 + index * 3;
        display.fillRect(x + index * (kBarWidth + kBarGap), baseline - height,
                         kBarWidth, height,
                         index < level ? Palette::Positive
                                       : Palette::TextMuted);
        display.drawFastHLine(
            x + index * (kBarWidth + kBarGap), baseline, kBarWidth,
            background);
    }
}

UiTextId radioSignalQualityText(std::int16_t rssiDbm) {
    switch (wifiSignalLevel(rssiDbm)) {
        case 4: return UiTextId::RadioSignalExcellent;
        case 3: return UiTextId::RadioSignalGood;
        case 2: return UiTextId::RadioSignalWeak;
        default: return UiTextId::RadioSignalVeryWeak;
    }
}

void renderRadioSignalCard(
        std::int16_t rssiDbm,
        const Rect& bounds = {
            Layout::Edge, 128, Layout::ContentWidth, 104}) {
    constexpr std::int16_t kTrackInset = 10;
    const bool compact = bounds.height < 100;
    const std::int16_t kTrackY = bounds.y + (compact ? 50 : 59);
    const std::int16_t kTrackWidth = bounds.width - 2 * kTrackInset;
    constexpr std::int16_t kTrackHeight = 14;
    const std::uint8_t level = wifiSignalLevel(rssiDbm);
    const std::uint16_t tone = level >= 3U
        ? Palette::Positive : (level == 2U ? Palette::Warning
                                           : Palette::Danger);
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Surface);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, bounds.x + 10, bounds.y + 9);
    display.print(tr(UiTextId::RadioSignalLabel));
    display.setTextColor(tone, Palette::Surface);
    setUiCursor(UiTextRole::Body, bounds.x + 10, bounds.y + 29);
    display.print(tr(radioSignalQualityText(rssiDbm)));
    char value[24] = {};
    std::snprintf(value, sizeof(value), tr(UiTextId::RadioSignalDbmFormat),
                  static_cast<int>(rssiDbm));
    setUiCursor(UiTextRole::Body, bounds.x + 10, bounds.y + 29);
    const std::int16_t valueX = bounds.x + bounds.width - 10 -
                                display.textWidth(value);
    setUiCursor(UiTextRole::Body, valueX, bounds.y + 29);
    display.print(value);
    display.fillRect(bounds.x + kTrackInset, kTrackY, kTrackWidth,
                     kTrackHeight, Palette::Canvas);
    display.drawRect(bounds.x + kTrackInset, kTrackY, kTrackWidth,
                     kTrackHeight, Palette::Divider);
    const std::int16_t clamped = rssiDbm < -100
        ? -100 : (rssiDbm > -40 ? -40 : rssiDbm);
    const std::int16_t fillWidth = static_cast<std::int16_t>(
        (static_cast<std::int32_t>(clamped + 100) * (kTrackWidth - 2)) / 60);
    if (fillWidth > 0) {
        display.fillRect(bounds.x + kTrackInset + 1, kTrackY + 1,
                         fillWidth, kTrackHeight - 2, tone);
    }
    if (!compact) {
        display.setTextColor(Palette::TextMuted, Palette::Surface);
        const std::int16_t scaleY = bounds.y + 79;
        setUiCursor(UiTextRole::Meta, bounds.x + kTrackInset, scaleY);
        display.print(tr(UiTextId::RadioSignalScaleWeak));
        const char* strong = tr(UiTextId::RadioSignalScaleStrong);
        const std::int16_t strongX = bounds.x + bounds.width - kTrackInset -
                                     display.textWidth(strong);
        setUiCursor(UiTextRole::Meta, strongX, scaleY);
        display.print(strong);
    }
}

void renderWifiNetworkRow(std::size_t index, std::size_t firstVisible) {
    const Observation* observation = wifiNetworkAt(index);
    if (observation == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleWifiNetworkRows) {
        return;
    }
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = wifiNetworkSelection == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    char label[24] = {};
    const std::size_t visibleLength = observation->labelLength < 18U
        ? observation->labelLength : 18U;
    if (visibleLength == 0) {
        std::snprintf(label, sizeof(label), "%s", tr(UiTextId::Hidden));
    } else {
        std::memcpy(label, observation->label.data(), visibleLength);
        if (observation->labelLength > visibleLength) {
            label[visibleLength - 1U] = '~';
        }
    }
    const std::int16_t labelTop = menuRowTextTop(bounds);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(label);
    char note[48] = {};
    std::snprintf(note, sizeof(note), tr(UiTextId::ChannelRssiFormat),
                  static_cast<unsigned>(observation->channel),
                  static_cast<int>(observation->rssiDbm));
    display.setTextColor(Palette::Positive, background);
    setUiCursor(UiTextRole::Meta,
                bounds.x + kInteractiveRowTextInset,
                labelTop + kRobotoCondensedBodyAscent +
                    kRobotoCondensedBodyDescent + 1);
    display.print(note);
    renderWifiSignalBars(bounds, observation->rssiDbm, background);
}

void renderWifiNetworksData() {
    const std::size_t visibleSize = wifiNetworkVisibleSize();
    if (visibleSize == 0) {
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 70);
        display.print(tr(UiTextId::WifiNetworksSearching));
        return;
    }
    const std::size_t first = wifiNetworkFirstVisible(wifiNetworkSelection);
    const std::size_t end = visibleSize <
            first + kVisibleWifiNetworkRows
        ? visibleSize : first + kVisibleWifiNetworkRows;
    for (std::size_t index = first; index < end; ++index) {
        renderWifiNetworkRow(index, first);
    }
}

void renderWifiNetworks(bool clearContent) {
    renderHeader(tr(UiTextId::WifiMenuNetworks), clearContent);
    renderWifiNetworksData();
}

bool wifiNetworkDetailStaticFieldsDiffer(const Observation& left,
                                         const Observation& right) {
    return left.channel != right.channel ||
        left.frequencyKhz != right.frequencyKhz ||
        left.labelLength != right.labelLength ||
        std::memcmp(left.label.data(), right.label.data(),
                    left.labelLength) != 0 ||
        !leshy1::domain::observations::wifiNetworkFactsEqual(
            left.wifiNetwork, right.wifiNetwork);
}

UiTextId wifiNetworkTrendText(std::int16_t trendDb) {
    if (trendDb >= 4) return UiTextId::WifiNetworkTrendStronger;
    if (trendDb <= -4) return UiTextId::WifiNetworkTrendWeaker;
    return UiTextId::WifiNetworkTrendStable;
}

void renderWifiNetworkRadar(const Observation& network,
                            const WifiNetworkSignalStats& signal) {
    constexpr Rect kRadar = {
        Layout::Edge, 222, Layout::ContentWidth, 67};
    constexpr std::int16_t kInset = 10;
    constexpr std::int16_t kTrackY = 258;
    constexpr std::int16_t kTrackHeight = 12;
    const std::int16_t trackWidth = kRadar.width - 2 * kInset;
    const std::uint8_t level = wifiSignalLevel(network.rssiDbm);
    const std::uint16_t tone = level >= 3U
        ? Palette::Positive : (level == 2U ? Palette::Warning
                                           : Palette::Danger);
    display.fillRect(kRadar.x, kRadar.y, kRadar.width, kRadar.height,
                     Palette::Canvas);
    display.fillRoundRect(kRadar.x, kRadar.y, kRadar.width, kRadar.height,
                          Layout::Radius, Palette::Surface);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, kRadar.x + kInset, 228);
    display.print(tr(UiTextId::RadioSignalLabel));
    char line[32] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::RadioSignalDbmFormat),
                  static_cast<int>(network.rssiDbm));
    display.setTextColor(tone, Palette::Surface);
    const std::int16_t valueX = kRadar.x + kRadar.width - kInset -
                                display.textWidth(line);
    setUiCursor(UiTextRole::Meta, valueX, 228);
    display.print(line);
    setUiCursor(UiTextRole::Body, kRadar.x + kInset, 243);
    display.print(tr(radioSignalQualityText(network.rssiDbm)));

    display.fillRect(kRadar.x + kInset, kTrackY, trackWidth,
                     kTrackHeight, Palette::Canvas);
    display.drawRect(kRadar.x + kInset, kTrackY, trackWidth,
                     kTrackHeight, Palette::Divider);
    const std::int16_t clamped = network.rssiDbm < -100
        ? -100 : (network.rssiDbm > -40 ? -40 : network.rssiDbm);
    const std::int16_t fillWidth = static_cast<std::int16_t>(
        (static_cast<std::int32_t>(clamped + 100) * (trackWidth - 2)) / 60);
    if (fillWidth > 0) {
        display.fillRect(kRadar.x + kInset + 1, kTrackY + 1,
                         fillWidth, kTrackHeight - 2, tone);
    }
    std::snprintf(line, sizeof(line), tr(UiTextId::WifiNetworkRangeFormat),
                  static_cast<int>(signal.minimumRssiDbm),
                  static_cast<int>(signal.maximumRssiDbm));
    display.setTextColor(Palette::TextMuted, Palette::Surface);
    setUiCursor(UiTextRole::Meta, kRadar.x + kInset, 274);
    display.print(line);
    const char* trend = tr(wifiNetworkTrendText(signal.rssiTrendDb));
    const std::int16_t trendX = kRadar.x + kRadar.width - kInset -
                                display.textWidth(trend);
    const std::uint16_t trendTone = signal.rssiTrendDb >= 4
        ? Palette::Positive : (signal.rssiTrendDb <= -4
            ? Palette::Danger : Palette::TextMuted);
    display.setTextColor(trendTone, Palette::Surface);
    setUiCursor(UiTextRole::Meta, trendX, 274);
    display.print(trend);
}

