anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
std::size_t bleDeviceFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0 : selection - kVisibleWifiNetworkRows + 1U;
}

void formatBleAddress(const Observation& device, char* output,
                      std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    std::snprintf(output, capacity, tr(UiTextId::BleAddressFormat),
                  static_cast<unsigned>(device.identity[0]),
                  static_cast<unsigned>(device.identity[1]),
                  static_cast<unsigned>(device.identity[2]),
                  static_cast<unsigned>(device.identity[3]),
                  static_cast<unsigned>(device.identity[4]),
                  static_cast<unsigned>(device.identity[5]));
}

UiTextId wifiDeviceTrendText(std::int16_t trendDb);

UiTextId bleDeviceKindText(BleDeviceKind kind) {
    switch (kind) {
        case BleDeviceKind::Phone: return UiTextId::BleKindPhone;
        case BleDeviceKind::Computer: return UiTextId::BleKindComputer;
        case BleDeviceKind::Watch: return UiTextId::BleKindWatch;
        case BleDeviceKind::Audio: return UiTextId::BleKindAudio;
        case BleDeviceKind::Keyboard: return UiTextId::BleKindKeyboard;
        case BleDeviceKind::Mouse: return UiTextId::BleKindMouse;
        case BleDeviceKind::Input: return UiTextId::BleKindInput;
        case BleDeviceKind::Heart: return UiTextId::BleKindHeart;
        case BleDeviceKind::Thermometer: return UiTextId::BleKindThermometer;
        case BleDeviceKind::Tag: return UiTextId::BleKindTag;
        case BleDeviceKind::Display: return UiTextId::BleKindDisplay;
        case BleDeviceKind::Fitness: return UiTextId::BleKindFitness;
        case BleDeviceKind::Unknown:
        default: return UiTextId::BleKindUnknown;
    }
}

UiTextId bleAddressTypeText(std::uint8_t type) {
    switch (type) {
        case 0U: return UiTextId::BleAddressPublic;
        case 2U: return UiTextId::BleAddressPublicIdentity;
        case 3U: return UiTextId::BleAddressRandomIdentity;
        case 1U:
        default: return UiTextId::BleAddressRandom;
    }
}

UiTextId bleAdvertisementModeText(
        const leshy1::domain::observations::BleAdvertisementFacts& facts) {
    if (facts.connectable) return UiTextId::BleAdvertisementConnectable;
    if (facts.scannable) return UiTextId::BleAdvertisementScannable;
    return UiTextId::BleAdvertisementBroadcast;
}

bool bleDeviceVendor(const Observation& device, char* output,
                     std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return false;
    output[0] = '\0';
    const auto& facts = device.bleAdvertisement;
    if (facts.companyKnown &&
        bleCompanyDatabase.lookup(facts.companyId, output, capacity)) {
        return true;
    }
    if ((facts.knownServiceMask &
         leshy1::domain::observations::BleAdvertisementFacts::kServiceXiaomi)
        != 0U) {
        std::snprintf(output, capacity, "Xiaomi");
        return true;
    }
    return false;
}

void compactBlePrimary(const Observation& device, char* output,
                       std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    output[0] = '\0';
    const char* source = nullptr;
    if (device.labelLength != 0U) {
        source = device.label.data();
    } else {
        const char* subtype = leshy1::apps::ble::bleSubtypeName(
            leshy1::apps::ble::classifyBleSubtype(device));
        if (subtype[0] != '\0') source = subtype;
    }
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    if (source == nullptr && bleDeviceVendor(device, vendor, sizeof(vendor))) {
        source = vendor;
    }
    if (source == nullptr) {
        source = tr(bleDeviceKindText(
            leshy1::apps::ble::classifyBleDevice(device)));
    }
    std::snprintf(output, capacity, "%s", source);
    if (std::strlen(source) >= capacity && capacity > 2U) {
        output[capacity - 2U] = '~';
    }
}

const char* bleDeviceDescriptor(const Observation& device, char* vendor,
                                std::size_t vendorCapacity) {
    const BleSubtype subtype =
        leshy1::apps::ble::classifyBleSubtype(device);
    const char* subtypeName = leshy1::apps::ble::bleSubtypeName(subtype);
    if (subtypeName[0] != '\0') return subtypeName;
    const BleDeviceKind kind =
        leshy1::apps::ble::classifyBleDevice(device);
    if (kind != BleDeviceKind::Unknown) return tr(bleDeviceKindText(kind));
    if (bleDeviceVendor(device, vendor, vendorCapacity)) return vendor;
    return tr(UiTextId::BleKindUnknown);
}

const char* compactBleService(const Observation& device, char* output,
                              std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return "";
    output[0] = '\0';
    const auto& facts = device.bleAdvertisement;
    const char* friendly =
        leshy1::apps::ble::bleServiceName(facts.knownServiceMask);
    if (friendly[0] != '\0') {
        std::snprintf(output, capacity, "%s", friendly);
        return output;
    }
    if (facts.firstServiceUuidLength == 0U) return output;
    std::snprintf(output, capacity, "%s", facts.firstServiceUuid.data());
    return output;
}

void renderBleDeviceRow(std::size_t index, std::size_t firstVisible) {
    const Observation* device = bleDeviceAt(index);
    if (device == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleWifiNetworkRows) {
        return;
    }
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = bleDeviceSelection == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    char label[22] = {};
    compactBlePrimary(*device, label, sizeof(label));
    const std::int16_t labelTop = menuRowTextTop(bounds);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(label);
    char note[64] = {};
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    const char* descriptor =
        bleDeviceDescriptor(*device, vendor, sizeof(vendor));
    if (std::strcmp(label, descriptor) == 0) {
        const bool hasDifferentVendor =
            bleDeviceVendor(*device, vendor, sizeof(vendor)) &&
            std::strcmp(label, vendor) != 0;
        descriptor = hasDifferentVendor
            ? vendor
            : tr(bleAdvertisementModeText(device->bleAdvertisement));
    }
    std::snprintf(note, sizeof(note), tr(UiTextId::BleDeviceRowFormat),
                  descriptor, static_cast<int>(device->rssiDbm));
    display.setTextColor(
        leshy1::apps::ble::classifyBleTracker(*device) !=
                BleTrackerKind::None
            ? Palette::Warning : Palette::Positive,
        background);
    setUiCursor(UiTextRole::Meta,
                bounds.x + kInteractiveRowTextInset,
                labelTop + kRobotoCondensedBodyAscent +
                    kRobotoCondensedBodyDescent + 1);
    display.print(note);
    renderWifiSignalBars(bounds, device->rssiDbm, background);
}

void renderBleDevicesData() {
    if (bleDeviceCatalog.size() == 0U) {
        const bool unavailable = productSurveySourceUnavailableVisible();
        display.setTextColor(unavailable ? Palette::Danger : Palette::Positive,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 70);
        display.print(tr(unavailable ? UiTextId::BleReceiverUnavailable
                                     : UiTextId::BleDevicesSearching));
        return;
    }
    const std::size_t first = bleDeviceFirstVisible(bleDeviceSelection);
    const std::size_t end = bleDeviceVisibleSize() <
            first + kVisibleWifiNetworkRows
        ? bleDeviceVisibleSize() : first + kVisibleWifiNetworkRows;
    for (std::size_t index = first; index < end; ++index) {
        renderBleDeviceRow(index, first);
    }
}

void renderBleDevices(bool clearContent) {
    renderHeader(tr(UiTextId::BleDevicesTitle), clearContent);
    renderBleDevicesData();
}

bool bleDeviceDetailStaticFieldsDiffer(const Observation& left,
                                       const Observation& right) {
    return left.identity != right.identity ||
        left.labelLength != right.labelLength ||
        std::memcmp(left.label.data(), right.label.data(), left.labelLength) != 0 ||
        !leshy1::domain::observations::bleAdvertisementFactsEqual(
            left.bleAdvertisement, right.bleAdvertisement);
}

void renderBleDeviceRadar(const Observation& device,
                          const BleDeviceSignalStats& signal) {
    constexpr std::int16_t kRadarTop = 170;
    display.fillRect(Layout::Edge, kRadarTop, Layout::ContentWidth,
                     Layout::FooterDividerY - kRadarTop, Palette::Canvas);
    renderRadioSignalCard(
        device.rssiDbm,
        {Layout::Edge, kRadarTop, Layout::ContentWidth, 68});
    char line[64] = {};
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::WifiDeviceRssiRangeFormat),
                  static_cast<int>(signal.minimumRssiDbm),
                  static_cast<int>(signal.maximumRssiDbm));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 246);
    display.print(line);
    display.setTextColor(
        signal.rssiTrendDb >= 4 ? Palette::Positive :
        (signal.rssiTrendDb <= -4 ? Palette::Danger : Palette::TextMuted),
        Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 269);
    display.print(tr(wifiDeviceTrendText(signal.rssiTrendDb)));
}

void renderBleDeviceDetailData() {
    const Observation& device = *liveBleDeviceDetail();
    const BleDeviceSignalStats& signal = *liveBleDeviceSignal();
    bleDeviceDetail = device;
    bleDeviceDetailSignal = signal;
    display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                     Layout::FooterDividerY - Layout::ContentTop,
                     Palette::Canvas);
    char primary[24] = {};
    compactBlePrimary(device, primary, sizeof(primary));
    display.setTextColor(Palette::Focus, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 34);
    display.print(primary);
    char line[96] = {};
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    const BleTrackerKind tracker =
        leshy1::apps::ble::classifyBleTracker(device);
    const char* descriptor =
        bleDeviceDescriptor(device, vendor, sizeof(vendor));
    if (tracker != BleTrackerKind::None) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleTrackerFormat),
                      descriptor);
    } else {
        std::snprintf(line, sizeof(line), "%s", descriptor);
    }
    display.setTextColor(tracker != BleTrackerKind::None
                             ? Palette::Warning : Palette::TextSecondary,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 57);
    display.print(line);

