anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderNrf24FinderPage(bool clearContent) {
    renderHeader(tr(UiTextId::Nrf24FinderTitle), clearContent);
    renderNrf24FinderAxis();
    renderNrf24FinderResult(true);
    renderNrf24FinderGraph(true);
}

void renderCcFinderResult(bool force) {
    const Cc1101SignalFinderState state = cc1101SignalFinder.state();
    const bool found = cc1101SignalFinder.found();
    const std::uint32_t frequency = cc1101SignalFinder.strongestFrequencyKHz();
    if (!force && state == ccFinderRenderedState &&
        found == ccFinderRenderedFound &&
        (!found || frequency == ccFinderRenderedFrequencyKHz)) {
        return;
    }
    display.fillRect(0, kNrfFinderInfoY, Layout::ScreenWidth,
                     kNrfFinderInfoHeight, Palette::Canvas);
    if (state == Cc1101SignalFinderState::Fault) {
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 12);
        display.print(tr(UiTextId::CcFinderFault));
    } else if (state == Cc1101SignalFinderState::Calibrating) {
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 6);
        display.print(tr(UiTextId::CcFinderCalibrating));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 32);
        display.print(tr(UiTextId::CcFinderCalibratingNote));
    } else if (!found) {
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 6);
        display.print(tr(UiTextId::CcFinderWaiting));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 32);
        display.print(tr(UiTextId::CcFinderWaitingNote));
    } else {
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 1);
        display.print(tr(UiTextId::CcFinderFound));
        char line[32] = {};
        std::snprintf(line, sizeof(line), tr(UiTextId::CcFinderFrequencyFormat),
                      static_cast<unsigned long>(frequency / 1000U),
                      static_cast<unsigned long>(frequency % 1000U));
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 19);
        display.print(line);
        const char* hint = cc1101SignalFinder.bandHint();
        if (hint[0] != '\0') {
            selectUiFont(UiTextRole::Meta);
            display.setTextColor(Palette::TextSecondary, Palette::Canvas);
            setUiCursor(UiTextRole::Meta,
                        Layout::ScreenWidth - 8 - display.textWidth(hint),
                        kNrfFinderInfoY + 23);
            display.print(hint);
        }
    }
    ccFinderRenderedState = state;
    ccFinderRenderedFound = found;
    ccFinderRenderedFrequencyKHz = frequency;
}

void renderCcFinderGraph(bool force) {
    if (force) {
        display.fillRect(0, kNrfFinderGraphY, Layout::ScreenWidth,
                         kNrfFinderGraphHeight, kSpectrumNoSignal);
        ccFinderRenderedHeights.fill(0);
    }
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        std::size_t first = static_cast<std::size_t>(x) *
            Cc1101SignalFinder::kBinCount / Layout::ScreenWidth;
        std::size_t last = static_cast<std::size_t>(x + 1) *
            Cc1101SignalFinder::kBinCount / Layout::ScreenWidth;
        if (last <= first) last = first + 1U;
        std::uint8_t strength = 0;
        for (std::size_t bin = first;
             bin < last && bin < Cc1101SignalFinder::kBinCount; ++bin) {
            const std::uint8_t candidate = cc1101SignalFinder.strength(bin);
            if (candidate > strength) strength = candidate;
        }
        const std::int16_t height = static_cast<std::int16_t>(
            (strength < Cc1101SignalFinder::kGraphFullScaleDb
                 ? strength : Cc1101SignalFinder::kGraphFullScaleDb) *
            kNrfFinderGraphHeight /
            Cc1101SignalFinder::kGraphFullScaleDb);
        const std::int16_t previous =
            ccFinderRenderedHeights[static_cast<std::size_t>(x)];
        if (height < previous) {
            display.drawFastVLine(x, kNrfFinderAxisY - previous,
                                  previous - height, kSpectrumNoSignal);
        } else if (height > previous) {
            display.drawFastVLine(
                x, kNrfFinderAxisY - height, height - previous,
                strength >= Cc1101SignalFinder::kDetectionRiseDb
                    ? Palette::Positive : Palette::TextMuted);
        }
        ccFinderRenderedHeights[static_cast<std::size_t>(x)] = height;
    }
    ccFinderRenderedRevision = cc1101SignalFinder.revision();
}

std::int16_t ccFinderAxisX(std::uint32_t frequencyKHz) {
    std::size_t bestBin = 0;
    std::uint32_t bestDistance = UINT32_MAX;
    for (std::size_t bin = 0; bin < Cc1101SignalFinder::kBinCount; ++bin) {
        const std::uint32_t candidate =
            Cc1101SignalFinder::frequencyKHz(bin);
        const std::uint32_t distance = candidate > frequencyKHz
            ? candidate - frequencyKHz : frequencyKHz - candidate;
        if (distance < bestDistance) {
            bestDistance = distance;
            bestBin = bin;
        }
    }
    return static_cast<std::int16_t>(bestBin * Layout::ScreenWidth /
                                     Cc1101SignalFinder::kBinCount);
}

void renderCcFinderAxis() {
    display.fillRect(0, kNrfFinderLegendY, Layout::ScreenWidth,
                     kNrfFinderLegendHeight, Palette::Surface);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kNrfFinderLegendY + 1);
    display.print(tr(UiTextId::CcFinderResponse));

    display.fillRect(0, kNrfFinderAxisY, Layout::ScreenWidth,
                     kNrfFinderAxisHeight, Palette::Canvas);
    struct Tick final { std::uint32_t frequencyKHz; const char* label; };
    constexpr Tick ticks[] = {
        {315000U, "315"}, {433920U, "433"},
        {868350U, "868"}, {915000U, "915"},
    };
    selectUiFont(UiTextRole::Meta);
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    for (const Tick& tick : ticks) {
        const std::int16_t x = ccFinderAxisX(tick.frequencyKHz);
        display.drawFastVLine(x, kNrfFinderAxisY, 3, Palette::Divider);
        const std::int16_t width = display.textWidth(tick.label);
        setUiCursor(UiTextRole::Meta, x - width / 2,
                    kNrfFinderAxisY + 2);
        display.print(tick.label);
    }
}

void renderCcFinderPage(bool clearContent) {
    renderHeader(tr(UiTextId::CcFinderTitle), clearContent);
    renderCcFinderAxis();
    renderCcFinderResult(true);
    renderCcFinderGraph(true);
}

void formatCcFrequency(std::uint32_t frequencyKHz, char* output,
                       std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    std::snprintf(output, capacity, "%lu.%03lu",
                  static_cast<unsigned long>(frequencyKHz / 1000U),
                  static_cast<unsigned long>(frequencyKHz % 1000U));
}

void renderCc1101SpectrumAxis() {
    display.fillRect(0, kSpectrumAxisY, Layout::ScreenWidth,
                     kSpectrumAxisHeight, Palette::Canvas);
    const Cc1101PassiveSpectrumPlan plan = cc1101SpectrumController.plan();
    char first[16] = {};
    char middle[16] = {};
    char last[16] = {};
    formatCcFrequency(plan.firstKHz, first, sizeof(first));
    formatCcFrequency(plan.firstKHz + (plan.lastKHz - plan.firstKHz) / 2U,
                      middle, sizeof(middle));
    formatCcFrequency(plan.lastKHz, last, sizeof(last));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    selectUiFont(UiTextRole::Meta);
    setUiCursor(UiTextRole::Meta, 2, kSpectrumAxisY);
    display.print(first);
    setUiCursor(UiTextRole::Meta,
                (Layout::ScreenWidth - display.textWidth(middle)) / 2,
                kSpectrumAxisY);
    display.print(middle);
    setUiCursor(UiTextRole::Meta,
                Layout::ScreenWidth - 2 - display.textWidth(last),
                kSpectrumAxisY);
    display.print(last);
}

