anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderCc1101SpectrumLegend() {
    const Cc1101SpectrumViewState state = cc1101SpectrumController.state();
    renderSpectrumLegend(
        state == Cc1101SpectrumViewState::Running
            ? UiTextId::CcSpectrumOverlayRunning
            : (state == Cc1101SpectrumViewState::Paused
                   ? UiTextId::CcSpectrumOverlayPaused : UiTextId::SpectrumFault),
        state == Cc1101SpectrumViewState::Fault ? Tone::Danger : Tone::Positive);
}

void renderCc1101SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumTitle), clearContent);
    renderActiveSpectrumData();
    renderCc1101SpectrumLegend();
    renderCc1101SpectrumAxis();
}

void renderInventoryPage(bool clearContent) {
    char line[96] = {};
    if (bleProductView == BleProductView::DeviceDetail) {
        renderBleDeviceDetail(clearContent);
        return;
    }
    if (bleProductView == BleProductView::Devices) {
        renderBleDevices(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Menu) {
        renderWifiProductMenu(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::NetworkDetail) {
        renderWifiNetworkDetail(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::DeviceDetail) {
        renderWifiDeviceDetail(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Channels) {
        renderWifiChannels(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Devices) {
        renderWifiDevices(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SourceMenu) {
        renderRfSpectrumSourceMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
        renderNrf24ModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
        renderNrf24FinderPage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
        renderSubGhzModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::CcFinder) {
        renderCcFinderPage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
        renderRfCcBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu) {
        renderSubGhzCaptureModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
        renderSubGhzCaptureBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
        renderSubGhzRawCapturePage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Live) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            renderCc1101SpectrumPage(clearContent);
        } else {
            renderNrf24SpectrumPage(clearContent);
        }
        return;
    }
    if (wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Setup &&
        std::strcmp(productSurveyRuntime.status, "preparing") == 0) {
        renderHeader(tr(UiTextId::WifiMenuNetworks), clearContent);
        renderMetric(0, tr(UiTextId::SurveySearchWifi), Tone::Positive);
        return;
    }
    if (wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Running) {
        renderWifiNetworks(clearContent);
        return;
    }
    if (productSurveySourceUnavailableVisible()) {
        renderHeader(tr(UiTextId::SurveyUnavailable), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(tr(UiTextId::SourceUnavailableReason));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 116);
        display.print(tr(UiTextId::NoSessionCreated));
        setUiCursor(UiTextRole::Body, 14, 150);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderHeader(tr(UiTextId::SurveySources), clearContent);
            for (std::uint8_t index = 0;
                 index < SurveySourceController::kSourceCount; ++index) {
                renderSurveySourceRow(index);
            }
        } else {
            const UiTextId title = wifiProductView == WifiProductView::Visit
                ? UiTextId::WifiMenuVisit
                : surveySourceController.scope() ==
                    SurveySourceScope::WifiOnly
                ? UiTextId::WifiScanSetup
                : (surveySourceController.scope() ==
                           SurveySourceScope::BleOnly
                       ? UiTextId::BleScanSetup
                       : UiTextId::SurveySetup);
            renderHeader(tr(title), clearContent);
            for (std::uint8_t index = 0;
                 index < surveySourceController.planItemCount(); ++index) {
                renderSurveyPlanRow(index);
            }
        }
        if (surveySourceController.view() == SurveySetupView::Sources) {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(tr(UiTextId::SurveyChooseSources));
        }
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Result) {
        renderHeader(tr(UiTextId::SurveyCommitted), clearContent);
        std::snprintf(line, sizeof(line), tr(UiTextId::SurveyFoundFormat),
                      static_cast<unsigned>(surveySession.size()));
        renderMetric(0, line, Tone::Positive);
        renderMetric(1, tr(surveyWorkflow.persistent()
                               ? UiTextId::SurveyResultsSaved
                               : UiTextId::SurveyResultsTemporary),
                     surveyWorkflow.persistent() ? Tone::Positive
                                                 : Tone::Warning);
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Error) {
        renderHeader(tr(UiTextId::SurveyError), clearContent);
        renderMetric(0, tr(UiTextId::SurveyCouldNotStart), Tone::Danger);
        renderMetric(1, tr(UiTextId::SurveyPreviousSafe));
        renderMetric(2, tr(UiTextId::CaptureTryAgainUser));
        return;
    }
    if (surveyController.view() == SurveyView::Filter) {
        renderHeader(tr(UiTextId::SurveyFilter), clearContent);
        for (std::uint8_t index = 0;
             index <= static_cast<std::uint8_t>(SurveyFilter::Ble); ++index) {
            renderSurveyFilterOption(index);
        }
        return;
    }
    if (surveyController.view() == SurveyView::Detail) {
        renderHeader(tr(UiTextId::SurveyDetail), clearContent);
        const Observation* observation = surveyController.selected();
        if (observation == nullptr) return;
        display.setTextFont(4);
        activeDisplayFont = ActiveDisplayFont::None;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        display.setCursor(14, 88);
        display.print(observation->label.data());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        if (observation->radio == RadioKind::Ble) {
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(tr(UiTextId::BluetoothDevice));
            std::snprintf(
                line, sizeof(line), tr(UiTextId::BleAddressFormat),
                static_cast<unsigned>(observation->identity[0]),
                static_cast<unsigned>(observation->identity[1]),
                static_cast<unsigned>(observation->identity[2]),
                static_cast<unsigned>(observation->identity[3]),
                static_cast<unsigned>(observation->identity[4]),
                static_cast<unsigned>(observation->identity[5]));
            setUiCursor(UiTextRole::Meta, 14, 151);
            display.print(line);
        } else {
            std::snprintf(line, sizeof(line), tr(UiTextId::ChannelFormat),
                          static_cast<unsigned>(observation->channel));
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(line);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::RssiFormat),
                      static_cast<int>(observation->rssiDbm));
        setUiCursor(UiTextRole::Body, 14,
                    observation->radio == RadioKind::Ble ? 174 : 148);
        display.print(line);
        const ObservationHistory history = surveyController.selectedHistory();
        if (history.valid) {
            renderRssiHistory(history);
        } else {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 203);
            display.print(tr(UiTextId::NoSignalHistory));
        }
        return;
    }

