anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                        ? Tone::Positive : Tone::Muted;
                    break;
                case 3:
                    label = tr(UiTextId::TargetsNotes);
                    if (target->notesLength != 0) {
                        std::memcpy(note, target->notes.data(),
                                    target->notesLength);
                        tone = Tone::Positive;
                    } else {
                        std::snprintf(note, sizeof(note), "%s",
                                      tr(UiTextId::TargetsNotesEmpty));
                        tone = Tone::Muted;
                    }
                    break;
                default: {
                    label = tr(UiTextId::TargetsCorrelations);
                    const std::size_t count =
                        controller.selectedCorrelationCount();
                    std::snprintf(
                        note, sizeof(note),
                        tr(UiTextId::TargetsCorrelationsCountFormat),
                        static_cast<unsigned>(count));
                    enabled = count != 0;
                    tone = enabled ? Tone::Positive : Tone::Muted;
                    break;
                }
            }
            fitTargetRowText(note, sizeof(note), UiTextRole::Meta);
            renderMenuRow(Components::homeRow(index - first), label, note,
                          controller.actionSelection() == index, enabled,
                          tone);
        }
        return;
    }
    if (controller.view() == TargetsView::Detail) {
        renderHeader(tr(UiTextId::TargetsDetail), clearContent);
        const TargetListRow* row = controller.selectedRow();
        const auto* target = controller.selectedTarget();
        if (row == nullptr || target == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        char line[64] = {};
        formatTargetName(*row, line, sizeof(line));
        renderMetric(0, line, Tone::Positive);
        char identity[24] = {};
        formatTargetIdentity(row->identity, identity, sizeof(identity));
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::TargetsIdentityFormat), identity);
        renderMetric(1, line);
        if (row->latest.radio == RadioKind::Wifi) {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::TargetsWifiRowFormat),
                          static_cast<int>(row->latest.rssiDbm),
                          static_cast<unsigned>(row->latest.channel));
        } else {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::TargetsBleRowFormat),
                          static_cast<int>(row->latest.rssiDbm));
        }
        renderMetric(2, line);
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::TargetsEvidenceGenerationFormat),
                      static_cast<unsigned>(target->evidenceCount),
                      static_cast<unsigned long>(
                          row->evidence.sourceGeneration));
        renderMetric(3, line);
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::TargetsTagsDetailFormat),
                      tr(target->favorite ? UiTextId::TargetsFavoriteOn
                                          : UiTextId::TargetsFavoriteOff),
                      static_cast<unsigned>(target->tagCount));
        renderMetric(4, line,
                     target->favorite ? Tone::Positive : Tone::Muted);
        return;
    }

    char title[32] = {};
    if (controller.truncated()) {
        std::snprintf(title, sizeof(title),
                      tr(UiTextId::TargetsLimitedTitleFormat),
                      static_cast<unsigned>(controller.size()),
                      static_cast<unsigned>(controller.sourceIdentityCount()));
    }
    renderHeader(controller.truncated() ? title : tr(UiTextId::AppTargets),
                 clearContent);
    if (controller.status() != TargetsLoadStatus::Ready) {
        renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
        return;
    }
    if (controller.entryCount() == 0) {
        renderMetric(0, tr(UiTextId::TargetsEmpty), Tone::Muted);
        return;
    }
    const std::size_t first = targetsFirstVisible(controller.selection());
    const std::size_t end = controller.entryCount() < first + kVisibleTargetRows
        ? controller.entryCount() : first + kVisibleTargetRows;
    for (std::size_t index = first; index < end; ++index) {
        renderTargetListRow(index, first);
    }
}

struct UiRenderSnapshot final {
    bool valid = false;
    std::uint8_t page = 0;
    std::uint8_t rootSelection = 0;
    std::uint8_t deviceSelection = 0;
    std::uint8_t settingsSelection = 0;
    std::uint8_t settingsBrightnessIndex = 0;
    std::uint8_t settingsTheme = 0;
    std::uint8_t settingsLanguage = 0;
    std::uint8_t selfTestView = 0;
    std::uint8_t selfTestSelection = 0;
    std::uint8_t wifiProductView = 0;
    std::uint8_t wifiProductSelection = 0;
    std::size_t wifiNetworkSelection = 0;
    std::size_t wifiNetworkSize = 0;
    std::uint32_t wifiNetworkRevision = 0;
    std::size_t wifiDeviceSelection = 0;
    std::size_t wifiDeviceSize = 0;
    std::uint32_t wifiDeviceRevision = 0;
    bool wifiDeviceActive = false;
    std::uint8_t bleProductView = 0;
    std::size_t bleDeviceSelection = 0;
    std::size_t bleDeviceSize = 0;
    std::uint32_t bleDeviceRevision = 0;
    std::uint32_t wifiChannelRevision = 0;
    bool wifiChannelActive = false;
    std::uint8_t rfSpectrumView = 0;
    std::uint8_t rfSpectrumSelection = 0;
    std::uint8_t nrf24ModeSelection = 0;
    std::uint8_t subGhzModeSelection = 0;
    std::uint8_t subGhzCaptureModeSelection = 0;
    std::uint8_t rfCcBandSelection = 0;
    std::uint8_t rfSpectrumDisplayMode = 0;
    std::uint8_t surveyState = 0;
    std::uint8_t surveySetupView = 0;
    std::uint8_t surveySetupSelection = 0;
    std::uint8_t surveySourceMask = 0;
    std::uint8_t surveyView = 0;
    std::uint8_t surveyFilter = 0;
    std::uint8_t surveyDraftFilter = 0;
    bool surveyFilterFocused = false;
    std::size_t surveySelection = 0;
    std::size_t surveySize = 0;
    std::size_t surveyVisibleSize = 0;
    std::uint8_t libraryView = 0;
    std::size_t librarySelection = 0;
    std::size_t librarySize = 0;
    std::uint8_t targetsView = 0;
    std::size_t targetsSelection = 0;
    std::size_t targetsSize = 0;
};

UiRenderSnapshot renderedUi{};

