anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiRenderSnapshot captureUiRenderSnapshot() {
    return {
        true,
        uiController.page(),
        uiController.selection(),
        deviceSelection,
        interfaceSettingsController.selection(),
        interfaceSettingsController.brightnessIndex(),
        static_cast<std::uint8_t>(interfaceSettingsController.theme()),
        static_cast<std::uint8_t>(languageController.active()),
        static_cast<std::uint8_t>(selfTestController.view()),
        selfTestController.selection(),
        static_cast<std::uint8_t>(wifiProductView),
        wifiProductSelection,
        wifiNetworkSelection,
        wifiNetworkVisibleSize(),
        wifiNetworkCatalog.revision(),
        wifiDeviceSelection,
        wifiDeviceVisibleSize(),
        wifiDeviceCatalog.revision(),
        wifiFrameCapture.deviceMonitorStats().active,
        static_cast<std::uint8_t>(bleProductView),
        bleDeviceSelection,
        bleDeviceVisibleSize(),
        bleDeviceCatalog.revision(),
        wifiFrameCapture.channelLoadSnapshot().revision,
        wifiFrameCapture.channelMonitorStats().active,
        static_cast<std::uint8_t>(rfSpectrumView),
        rfSpectrumSelection,
        nrf24ModeSelection,
        subGhzModeSelection,
        subGhzCaptureModeSelection,
        ccBandSelectionIndex(),
        static_cast<std::uint8_t>(spectrumViewport.mode()),
        static_cast<std::uint8_t>(surveyWorkflow.state()),
        static_cast<std::uint8_t>(surveySourceController.view()),
        surveySourceController.selection(),
        surveySourceController.selectedMask(),
        static_cast<std::uint8_t>(surveyController.view()),
        static_cast<std::uint8_t>(surveyController.filter()),
        static_cast<std::uint8_t>(surveyController.draftFilter()),
        surveyController.filterFocused(),
        surveyController.selection(),
        surveySession.size(),
        surveyController.visibleSize(),
        static_cast<std::uint8_t>(libraryController.view()),
        libraryController.selection(),
        libraryController.size(),
        targetsProductRuntime == nullptr
            ? static_cast<std::uint8_t>(0)
            : static_cast<std::uint8_t>(
                targetsProductRuntime->controller.view()),
        targetsProductRuntime == nullptr
            ? 0U : targetsProductRuntime->controller.navigationSelection(),
        targetsProductRuntime == nullptr
            ? 0U : targetsProductRuntime->controller.navigationCount(),
    };
}

bool renderSelectionDelta() {
    if (!renderedUi.valid || renderedUi.page != uiController.page()) return false;

    if (uiController.isRoot()) {
        const std::uint8_t current = uiController.selection();
        if (renderedUi.rootSelection == current) return false;
        const std::uint8_t oldFirst =
            homeFirstVisible(renderedUi.rootSelection);
        const std::uint8_t currentFirst = homeFirstVisible(current);
        if (oldFirst != currentFirst) {
            renderHome(false);
            return true;
        }
        renderHomeRow(renderedUi.rootSelection, currentFirst);
        renderHomeRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == kDevicePage) {
        if (renderedUi.deviceSelection == deviceSelection) return false;
        const std::uint8_t oldFirst =
            deviceFirstVisible(renderedUi.deviceSelection);
        const std::uint8_t currentFirst = deviceFirstVisible(deviceSelection);
        if (oldFirst != currentFirst) {
            renderDevicePage(false);
            return true;
        }
        renderDeviceRow(renderedUi.deviceSelection, currentFirst);
        renderDeviceRow(deviceSelection, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::DeviceDetail &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::DeviceDetail)) {
        if (renderedUi.bleDeviceRevision == bleDeviceCatalog.revision()) {
            return false;
        }
        const Observation& live = *liveBleDeviceDetail();
        const BleDeviceSignalStats& signal = *liveBleDeviceSignal();
        if (bleDeviceDetailStaticFieldsDiffer(
                bleDeviceRenderedDetail, live)) {
            renderBleDeviceDetailData();
        } else {
            renderBleDeviceRadar(live, signal);
            bleDeviceDetail = live;
            bleDeviceDetailSignal = signal;
            bleDeviceRenderedDetail = live;
        }
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::Devices &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::Devices)) {
        const std::size_t current = bleDeviceSelection;
        const std::size_t oldFirst =
            bleDeviceFirstVisible(renderedUi.bleDeviceSelection);
        const std::size_t currentFirst = bleDeviceFirstVisible(current);
        const bool dataChanged =
            renderedUi.bleDeviceSize != bleDeviceVisibleSize() ||
            renderedUi.bleDeviceRevision != bleDeviceCatalog.revision();
        const bool stateChanged = renderedUi.surveyState !=
            static_cast<std::uint8_t>(surveyWorkflow.state());
        if (dataChanged || oldFirst != currentFirst) {
            const bool clearRows = oldFirst != currentFirst ||
                renderedUi.bleDeviceSize == 0U ||
                bleDeviceVisibleSize() == 0U;
            if (clearRows) {
                display.fillRect(
                    Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                    Layout::FooterDividerY - Layout::ContentTop,
                    Palette::Canvas);
                renderBleDevicesData();
            } else {
                const std::size_t end = bleDeviceVisibleSize() <
                        currentFirst + kVisibleWifiNetworkRows
                    ? bleDeviceVisibleSize()
                    : currentFirst + kVisibleWifiNetworkRows;
                for (std::size_t index = currentFirst; index < end; ++index) {
                    renderBleDeviceRow(index, currentFirst);
                }
            }
        }
        if (stateChanged) {
            display.fillRect(128, 0, Layout::ScreenWidth - 128,
                             Layout::HeaderHeight, Palette::Header);
            renderHeaderStatus();
            renderNavigationFooter();
        }
        if (dataChanged || stateChanged || oldFirst != currentFirst) {
            return true;
        }
        if (renderedUi.bleDeviceSelection == current) {
            // The shared survey worker can report a duplicate advertisement.
            // Nothing visible changed, so acknowledge the refresh without a
            // fallback full-screen repaint.
            return true;
        }
        renderBleDeviceRow(renderedUi.bleDeviceSelection, currentFirst);
        renderBleDeviceRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Menu &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Menu)) {
        if (renderedUi.wifiProductSelection == wifiProductSelection) {
            return false;
        }
        renderWifiProductRow(renderedUi.wifiProductSelection);
        renderWifiProductRow(wifiProductSelection);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Networks)) {
        const std::size_t current = wifiNetworkSelection;
        const std::size_t oldFirst =
            wifiNetworkFirstVisible(renderedUi.wifiNetworkSelection);
        const std::size_t currentFirst = wifiNetworkFirstVisible(current);
        const bool dataChanged = productSurveyIncrementalRefreshPending ||
            renderedUi.wifiNetworkSize != wifiNetworkVisibleSize() ||
            renderedUi.wifiNetworkRevision != wifiNetworkCatalog.revision();
        if (dataChanged || oldFirst != currentFirst) {
            const bool clearRows = oldFirst != currentFirst ||
                renderedUi.wifiNetworkSize == 0 ||
                wifiNetworkVisibleSize() == 0;
            if (clearRows) {
                display.fillRect(
                    Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                    Layout::FooterDividerY - Layout::ContentTop,
                    Palette::Canvas);
                renderWifiNetworksData();
            } else {
                const std::size_t end = wifiNetworkVisibleSize() <
                        currentFirst + kVisibleWifiNetworkRows
                    ? wifiNetworkVisibleSize()
                    : currentFirst + kVisibleWifiNetworkRows;
                for (std::size_t index = currentFirst; index < end; ++index) {
                    renderWifiNetworkRow(index, currentFirst);
                }
            }
            if (renderedUi.surveyState !=
                static_cast<std::uint8_t>(SurveyWorkflowState::Running)) {
                display.fillRect(128, 0, Layout::ScreenWidth - 128,
                                 Layout::HeaderHeight, Palette::Header);
                renderHeaderStatus();
                renderNavigationFooter();
            }
            return true;
        }
        if (renderedUi.wifiNetworkSelection == current) return false;
        renderWifiNetworkRow(renderedUi.wifiNetworkSelection, currentFirst);
        renderWifiNetworkRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::NetworkDetail &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::NetworkDetail)) {
        if (renderedUi.wifiNetworkRevision == wifiNetworkCatalog.revision()) {
            return false;
        }
        const Observation& live = *liveWifiNetworkDetail();
        const WifiNetworkSignalStats& signal = *liveWifiNetworkSignal();
        if (wifiNetworkDetailStaticFieldsDiffer(
                wifiNetworkRenderedDetail, live)) {
            renderWifiNetworkDetailData();
        } else {
            renderWifiNetworkRadar(live, signal);
            wifiNetworkDetail = live;
            wifiNetworkDetailSignal = signal;
            wifiNetworkRenderedDetail = live;
        }
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::DeviceDetail &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::DeviceDetail)) {
        if (renderedUi.wifiDeviceRevision == wifiDeviceCatalog.revision()) {
            return false;
        }
        renderWifiDeviceDetailLiveData();
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Devices &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Devices)) {
        const std::size_t current = wifiDeviceSelection;
        const std::size_t oldFirst =
            wifiDeviceFirstVisible(renderedUi.wifiDeviceSelection);
        const std::size_t currentFirst = wifiDeviceFirstVisible(current);
        const bool dataChanged =
            renderedUi.wifiDeviceSize != wifiDeviceVisibleSize() ||
            renderedUi.wifiDeviceRevision != wifiDeviceCatalog.revision() ||
            renderedUi.wifiDeviceActive !=
                wifiFrameCapture.deviceMonitorStats().active;
        if (dataChanged || oldFirst != currentFirst) {
            const bool clearRows = oldFirst != currentFirst ||
                renderedUi.wifiDeviceSize == 0U ||
                wifiDeviceVisibleSize() == 0U;
            if (clearRows) {
                display.fillRect(
                    Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                    Layout::FooterDividerY - Layout::ContentTop,
                    Palette::Canvas);
                renderWifiDevicesData();
            } else {
                const std::size_t end = wifiDeviceVisibleSize() <
                        currentFirst + kVisibleWifiNetworkRows
                    ? wifiDeviceVisibleSize()
                    : currentFirst + kVisibleWifiNetworkRows;
                for (std::size_t index = currentFirst; index < end; ++index) {
                    renderWifiDeviceRow(index, currentFirst);
                }
            }
            return true;
        }
        if (renderedUi.wifiDeviceSelection == current) return false;
        renderWifiDeviceRow(renderedUi.wifiDeviceSelection, currentFirst);
        renderWifiDeviceRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Channels &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Channels)) {
        const auto stats = wifiFrameCapture.channelMonitorStats();
        if (renderedUi.wifiChannelActive != stats.active) return false;
        const auto snapshot = wifiFrameCapture.channelLoadSnapshot();
        if (renderedUi.wifiChannelRevision == snapshot.revision) return false;
        renderWifiChannelsData(false);
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SourceMenu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::SourceMenu)) {
        const std::uint8_t current = rfSpectrumSelection;
        if (renderedUi.rfSpectrumSelection == current) return false;
        renderRfSpectrumSourceRow(renderedUi.rfSpectrumSelection);
        renderRfSpectrumSourceRow(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::Nrf24Menu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::Nrf24Menu)) {
        const std::uint8_t current = nrf24ModeSelection;
        if (renderedUi.nrf24ModeSelection == current) return false;
        renderNrf24ModeRow(renderedUi.nrf24ModeSelection, false);
        renderNrf24ModeRow(current, true);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SubGhzMenu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::SubGhzMenu)) {
        const std::uint8_t current = subGhzModeSelection;
        if (renderedUi.subGhzModeSelection == current) return false;
        renderSubGhzModeRow(renderedUi.subGhzModeSelection, false);
        renderSubGhzModeRow(current, true);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu &&
        renderedUi.rfSpectrumView == static_cast<std::uint8_t>(
            RfSpectrumView::SubGhzCaptureModeMenu)) {
        const std::uint8_t current = subGhzCaptureModeSelection;
        if (renderedUi.subGhzCaptureModeSelection == current) return false;
        renderSubGhzCaptureModeMenu(false);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        (rfSpectrumView == RfSpectrumView::CcBandMenu ||
         rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(rfSpectrumView)) {
        const std::uint8_t current = ccBandSelectionIndex();
        if (renderedUi.rfCcBandSelection == current) return false;
        renderRfCcBandRow(renderedUi.rfCcBandSelection);
        renderRfCcBandRow(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Setup &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Setup) &&
        renderedUi.surveySetupView ==
            static_cast<std::uint8_t>(surveySourceController.view()) &&
        renderedUi.surveySourceMask == surveySourceController.selectedMask()) {
        const std::uint8_t current = surveySourceController.selection();
        if (renderedUi.surveySetupSelection == current) return false;
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderSurveySourceRow(renderedUi.surveySetupSelection);
            renderSurveySourceRow(current);
        } else {
            renderSurveyPlanRow(renderedUi.surveySetupSelection);
            renderSurveyPlanRow(current);
        }
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::Filter &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::Filter) &&
        renderedUi.surveySize == surveySession.size()) {
        const std::uint8_t current =
            static_cast<std::uint8_t>(surveyController.draftFilter());
        if (renderedUi.surveyDraftFilter == current) return false;
        renderSurveyFilterOption(renderedUi.surveyDraftFilter);
        renderSurveyFilterOption(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::List &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::List) &&
        renderedUi.surveyFilter ==
            static_cast<std::uint8_t>(surveyController.filter())) {
        const std::size_t current = surveyController.selection();
        const bool currentFilterFocused = surveyController.filterFocused();
        if (productSurveyIncrementalRefreshPending) {
            renderSurveyFilterBar();
            display.fillRect(Layout::Edge, kSurveyRowsY, Layout::ContentWidth,
                             92, Palette::Canvas);
            const std::size_t first = surveyFirstVisible(current);
            const std::size_t end =
                surveyController.visibleSize() < first + kVisibleSurveyRows
                    ? surveyController.visibleSize()
                    : first + kVisibleSurveyRows;
            for (std::size_t index = first; index < end; ++index) {
                renderSurveyListRow(index, first);
            }
            return true;
        }
        if (renderedUi.surveySelection == current &&
            renderedUi.surveyFilterFocused == currentFilterFocused) return false;
        if (renderedUi.surveyFilterFocused != currentFilterFocused) {
            renderSurveyFilterBar();
            if (!renderedUi.surveyFilterFocused) {
                renderSurveyListRow(renderedUi.surveySelection,
                                    surveyFirstVisible(renderedUi.surveySelection));
            }
            if (!currentFilterFocused) {
                renderSurveyListRow(current, surveyFirstVisible(current));
            }
            renderNavigationFooter();
            return true;
        }
        const std::size_t oldFirst =
            surveyFirstVisible(renderedUi.surveySelection);
        const std::size_t currentFirst = surveyFirstVisible(current);
        if (oldFirst == currentFirst) {
            renderSurveyListRow(renderedUi.surveySelection, currentFirst);
            renderSurveyListRow(current, currentFirst);
        } else {
            display.fillRect(Layout::Edge, kSurveyRowsY, Layout::ContentWidth, 92,
                             Palette::Canvas);
            const std::size_t end =
                surveyController.visibleSize() < currentFirst + kVisibleSurveyRows
                    ? surveyController.visibleSize()
                    : currentFirst + kVisibleSurveyRows;
            for (std::size_t index = currentFirst; index < end; ++index) {
                renderSurveyListRow(index, currentFirst);
            }
        }
        return true;
    }

    if (uiController.page() == 3 &&
        libraryController.view() == LibraryView::SessionList &&
        renderedUi.libraryView ==
            static_cast<std::uint8_t>(LibraryView::SessionList) &&
        renderedUi.librarySize == libraryController.size()) {
        const std::size_t current = libraryController.selection();
        if (renderedUi.librarySelection == current) return false;
        renderLibraryListRow(renderedUi.librarySelection);
        renderLibraryListRow(current);
        return true;
    }

    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        (targetsProductRuntime->controller.view() == TargetsView::List ||
         targetsProductRuntime->controller.view() == TargetsView::Compare) &&
        renderedUi.targetsView == static_cast<std::uint8_t>(
            targetsProductRuntime->controller.view()) &&
        renderedUi.targetsSize ==
            targetsProductRuntime->controller.navigationCount()) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t current = controller.navigationSelection();
        if (renderedUi.targetsSelection == current) return false;
        const std::size_t oldFirst =
            targetsFirstVisible(renderedUi.targetsSelection);
        const std::size_t currentFirst = targetsFirstVisible(current);
        if (oldFirst != currentFirst) {
            display.fillRect(
                Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                Layout::FooterDividerY - Layout::ContentTop,
                Palette::Canvas);
            renderTargetsPage(false);
            return true;
        }
        if (controller.view() == TargetsView::Compare) {
            renderTargetComparisonRow(renderedUi.targetsSelection,
                                      currentFirst);
            renderTargetComparisonRow(current, currentFirst);
        } else {
            renderTargetListRow(renderedUi.targetsSelection, currentFirst);
            renderTargetListRow(current, currentFirst);
        }
        return true;
    }

    if (uiController.page() == 5) {
        if (renderedUi.settingsLanguage !=
                static_cast<std::uint8_t>(languageController.active()) ||
            renderedUi.settingsTheme != static_cast<std::uint8_t>(
                interfaceSettingsController.theme())) {
            return false;
        }
        const std::uint8_t current = interfaceSettingsController.selection();
        if (renderedUi.settingsSelection != current) {
            renderSettingsRow(renderedUi.settingsSelection);
            renderSettingsRow(current);
            return true;
        }
        if (renderedUi.settingsBrightnessIndex !=
            interfaceSettingsController.brightnessIndex()) {
            renderSettingsRow(static_cast<std::uint8_t>(
                InterfaceSetting::Brightness));
            return true;
        }
        return false;
    }

