anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void armSpectrumWaterfallForCurrentReceiver() {
    const std::uint32_t sweeps = activeSpectrumSweeps();
    spectrumWaterfallSourceSweepBaseline = sweeps;
    spectrumWaterfallLastSourceSweep = sweeps;
}

void serviceSpectrumWaterfallCadence() {
    if (!activeSpectrumRunning()) return;
    const std::uint32_t sourceSweeps = activeSpectrumSweeps();
    if (sourceSweeps == spectrumWaterfallLastSourceSweep) return;
    if (sourceSweeps < spectrumWaterfallLastSourceSweep) {
        armSpectrumWaterfallForCurrentReceiver();
        return;
    }
    const std::uint32_t newlyCompleted =
        sourceSweeps - spectrumWaterfallLastSourceSweep;
    if (newlyCompleted > 1U) {
        spectrumWaterfallMeasurementsSkipped += newlyCompleted - 1U;
    }
    spectrumWaterfallLastSourceSweep = sourceSweeps;

    // One complete receiver sweep becomes exactly one physical TFT row.  No
    // fixed display timer can replay a partial or stale receiver snapshot.
    const bool renderRows = !uiController.isRoot() &&
        uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Waterfall;
    if (renderRows) display.startWrite();
    const std::uint64_t rowStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (spectrumWaterfallPreviousRowUs != 0) {
        const std::uint64_t intervalUs =
            rowStartedUs - spectrumWaterfallPreviousRowUs;
        spectrumWaterfallRowIntervalTotalUs += intervalUs;
        if (intervalUs > spectrumWaterfallRowIntervalMaxUs) {
            spectrumWaterfallRowIntervalMaxUs = intervalUs;
        }
    }
    spectrumWaterfallPreviousRowUs = rowStartedUs;
    if (!pushActiveSpectrumHistory()) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            boardCc1101Spectrum.end();
            cc1101SpectrumController.fail();
        } else {
            boardNrf24Spectrum.end();
            nrf24SpectrumController.fail();
        }
        lastRuntimeEvent = "spectrum_history_fault";
        if (renderRows) display.endWrite();
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t pushedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const std::uint64_t pushUs = pushedUs - rowStartedUs;
    spectrumWaterfallPushTotalUs += pushUs;
    if (pushUs > spectrumWaterfallPushMaxUs) {
        spectrumWaterfallPushMaxUs = pushUs;
    }
    if (spectrumWaterfallStartedUs == 0) {
        spectrumWaterfallStartedUs = rowStartedUs;
    }
    ++spectrumWaterfallRowsEmitted;
    ++spectrumWaterfallMeasurementsConsumed;
    if (spectrumWaterfallCompletedUs == 0 &&
        spectrumViewport.rowsStored() == SpectrumViewport::kHistoryRows) {
        spectrumWaterfallCompletedUs = rowStartedUs;
    }
    if (renderRows) {
        renderLatestWaterfallRow();
    }
    const std::uint64_t renderedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const std::uint64_t renderUs = renderedUs - pushedUs;
    spectrumWaterfallRenderTotalUs += renderUs;
    if (renderUs > spectrumWaterfallRenderMaxUs) {
        spectrumWaterfallRenderMaxUs = renderUs;
    }
    const std::uint64_t serviceUs = renderedUs - rowStartedUs;
    if (serviceUs > spectrumWaterfallServiceMaxUs) {
        spectrumWaterfallServiceMaxUs = serviceUs;
    }
    if (renderRows) display.endWrite();
}

void releaseFullGuidedRfResource() {
    if (fullGuidedRfState.resourceAcquired) {
        resourceBroker.release(
            AppRuntime::kForegroundOwner,
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi));
    }
    fullGuidedRfState.resourceReleased =
        resourceBroker.ownerOf(Resource::RadioSpi) ==
        leshy1::kernel::runtime::kNoOwner;
}

void restoreFullGuidedLibraryView() {
    if (libraryController.view() == LibraryView::ExportReady) {
        libraryController.back();
    }
    if (libraryController.view() == LibraryView::SessionDetail) {
        libraryController.back();
    }
}

void finishFullGuidedActiveChecks(bool success);

void releaseFullGuidedDisposableResources() {
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::storage::kSdIdentificationResources);
    fullGuidedArtifactState.disposableResourceReleased =
        resourceBroker.ownerOf(Resource::Storage) ==
            leshy1::kernel::runtime::kNoOwner &&
        resourceBroker.ownerOf(Resource::RadioSpi) ==
            leshy1::kernel::runtime::kNoOwner;
}

bool acquireFullGuidedDisposableResources() {
    fullGuidedArtifactState.disposableResourceReleased = false;
    fullGuidedArtifactState.disposableResourceAcquired =
        resourceBroker.acquire(
            AppRuntime::kForegroundOwner,
            leshy1::storage::kSdIdentificationResources);
    return fullGuidedArtifactState.disposableResourceAcquired;
}

bool identifyFullGuidedDisposableMedia(std::uint64_t* capacityBytes) {
    if (capacityBytes == nullptr) return false;
    *capacityBytes = 0;
    BoardSdSpiTransport transport;
    if (!transport.begin()) return false;
    leshy1::storage::SdTransportRunPolicy policy;
    policy.allowPhysical = true;
    policy.explicitlySelected = true;
    policy.identificationOnly = true;
    policy.ownedResources = resourceBroker.ownedBy(
        AppRuntime::kForegroundOwner);
    const leshy1::storage::SdTransportRunResult identity =
        leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            policy);
    transport.end();
    fullGuidedArtifactState.disposableObservedFingerprint[0] = '\0';
    if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
        formatCidFingerprint(
            identity.identity,
            fullGuidedArtifactState.disposableObservedFingerprint,
            sizeof(fullGuidedArtifactState.disposableObservedFingerprint));
        *capacityBytes = identity.identity.capacityBytes;
    }
    fullGuidedArtifactState.disposableIdentityPassed =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        transport.cleanupComplete() &&
        std::strcmp(
            fullGuidedArtifactState.disposableObservedFingerprint,
            fullGuidedArtifactState.expectedFingerprint) == 0;
    return fullGuidedArtifactState.disposableIdentityPassed;
}

leshy1::storage::MediaIdentity fullGuidedDisposableMedia(
    const BoardSdFilesystem& filesystem, std::uint64_t identifiedCapacity) {
    leshy1::storage::MediaIdentity media;
    media.present = filesystem.mounted() && identifiedCapacity != 0 &&
        filesystem.cardCapacityBytes() == identifiedCapacity &&
        filesystem.filesystemCapacityBytes() != 0 &&
        filesystem.filesystemCapacityBytes() <= identifiedCapacity;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint =
        fullGuidedArtifactState.disposableObservedFingerprint;
    media.capacityBytes = filesystem.cardCapacityBytes();
    media.freeBytes = filesystem.freeBytes();
    return media;
}

bool removeFullGuidedDisposableScratch(BoardSdFilesystem& filesystem,
                                       const leshy1::storage::MediaIdentity& media) {
    const bool exists = filesystem.exists(
        fullGuidedArtifactState.disposableScratchPath);
    if (!exists) {
        fullGuidedArtifactState.scratchRemoved = true;
        return true;
    }
    leshy1::storage::ScratchCleanupRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint =
        fullGuidedArtifactState.expectedFingerprint;
    request.runId = kFullGuidedDisposableRunId;
    request.scratchExists = true;
    const leshy1::storage::ScratchCleanupPermit permit =
        leshy1::storage::authorizeScratchCleanup(media, request);
    ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                               sdSessionStoreIoWorkspace);
    const bool removed = permit.allowed() && io.removeScratch(permit);
    fullGuidedArtifactState.disposableFilesRemoved += io.filesRemoved();
    fullGuidedArtifactState.scratchRemoved = removed &&
        !filesystem.exists(fullGuidedArtifactState.disposableScratchPath);
    return fullGuidedArtifactState.scratchRemoved;
}

void runFullGuidedDisposableCommit() {
    bool filesystemAttempted = false;
    bool filesystemCleanup = true;
    bool passed = false;
    if (acquireFullGuidedDisposableResources()) {
        std::uint64_t identifiedCapacity = 0;
        if (identifyFullGuidedDisposableMedia(&identifiedCapacity)) {
            BoardSdFilesystem filesystem;
            filesystemAttempted = true;
            if (filesystem.begin()) {
                const leshy1::storage::MediaIdentity media =
                    fullGuidedDisposableMedia(filesystem, identifiedCapacity);
                fullGuidedArtifactState.scratchPreexisting =
                    filesystem.exists(
                        fullGuidedArtifactState.disposableScratchPath);
                const bool staleReady =
                    !fullGuidedArtifactState.scratchPreexisting ||
                    removeFullGuidedDisposableScratch(filesystem, media);
                leshy1::storage::WriteRequest request;
                request.explicitlyDisposable = true;
                request.expectedFingerprint =
                    fullGuidedArtifactState.expectedFingerprint;
                request.runId = kFullGuidedDisposableRunId;
                request.scratchExists = filesystem.exists(
                    fullGuidedArtifactState.disposableScratchPath);
                request.requiredBytes = kFullGuidedDisposableBytes;
                request.reserveBytes = kFullGuidedDisposableReserve;
                const leshy1::storage::WritePermit permit =
                    leshy1::storage::authorizeScratchWrite(media, request);

                littleFsResetSession.reset();
                const std::uint8_t selectedSourceMask =
                    leshy1::services::survey::sourceMask(RadioKind::Wifi);
                const CaptureMetadata metadata =
                    productCaptureMetadata(selectedSourceMask);
                const SourceWindow wifiWindow{
                    RadioKind::Wifi, SourceWindowState::Active,
                    SourceWindowReason::None, 1000, 3000, 3, 0};
                leshy1::services::survey::SourceRuntimeSummary wifiSummary;
                wifiSummary.selected = true;
                wifiSummary.state = SourceWindowState::Stopped;
                wifiSummary.activeUs = 2000;
                wifiSummary.accepted = 3;
                wifiSummary.windows = 1;
                leshy1::services::survey::SourceRuntimeSummary bleSummary;
                const bool fixtureReady = staleReady && permit.allowed() &&
                    littleFsResetSession.start(
                        kFullGuidedDisposableRunId, 1000) ==
                        SessionStatus::Started &&
                    littleFsResetSession.configureCaptureMetadata(metadata) ==
                        leshy1::services::survey::
                            CaptureMetadataStatus::Configured &&
                    littleFsResetSession.startTimeline(
                        selectedSourceMask, 1000) ==
                        leshy1::services::survey::
                            SessionTimelineStatus::Started &&
                    appendGoldenObservations(littleFsResetSession) &&
                    littleFsResetSession.appendTimelineWindow(wifiWindow) ==
                        leshy1::services::survey::
                            SessionTimelineStatus::Appended &&
                    littleFsResetSession.finalizeTimeline(
                        3000, wifiSummary, bleSummary, 0) ==
                        leshy1::services::survey::
                            SessionTimelineStatus::Finalized &&
                    littleFsResetSession.stop(3000) == SessionStatus::Stopped;
                if (fixtureReady) {
                    ArduinoFsSessionStoreIo io(
                        filesystem.driveNumber(), sdSessionStoreIoWorkspace);
                    const bool prepared = io.prepare(permit);
                    fullGuidedArtifactState.scratchCreated = prepared &&
                        filesystem.exists(permit.scratchPath);
                    fullGuidedArtifactState.scratchRemoved = false;
                    leshy1::storage::SessionStoreCommitResult commit;
                    leshy1::storage::SessionStoreRecoveryResult recovery;
                    if (fullGuidedArtifactState.scratchCreated) {
                        commit = leshy1::storage::commitNextSession(
                            io, sessionStoreWorkspace,
                            littleFsResetSession);
                        if (commit.complete()) {
                            recovery = leshy1::storage::recoverSession(
                                io, sessionStoreWorkspace,
                                &sessionStoreWorkspace.validationSession);
                        }
                    }
                    fullGuidedArtifactState.disposableStorageWriteBytes +=
                        io.bytesWritten();
                    fullGuidedArtifactState.disposableStorageWriteCalls +=
                        io.writeCalls();
                    fullGuidedArtifactState.disposableFileSyncs +=
                        io.fileSyncs();
                    fullGuidedArtifactState.disposableDirectorySyncs +=
                        io.directorySyncs();
                    fullGuidedArtifactState.disposableGeneration =
                        recovery.generation;
                    fullGuidedArtifactState.disposableObservations =
                        recovery.observations;
                    passed = commit.complete() && commit.generation == 1 &&
                        recovery.valid() && recovery.generation == 1 &&
                        recovery.observations == 3 &&
                        io.bytesWritten() != 0 && io.writeCalls() == 3 &&
                        io.fileSyncs() == 3 && io.directorySyncs() == 3;
                    io.end();
                }
            }
            filesystem.end();
            filesystemCleanup = filesystem.cleanupComplete();
        }
    }
    releaseFullGuidedDisposableResources();
    fullGuidedArtifactState.disposableCommitComplete = true;
    fullGuidedArtifactState.disposableCommitPassed = passed &&
        (!filesystemAttempted || filesystemCleanup) &&
        fullGuidedArtifactState.disposableResourceReleased;
    fullGuidedArtifactState.workflowPassed =
        fullGuidedArtifactState.workflowPassed &&
        fullGuidedArtifactState.disposableCommitPassed;
    fullGuidedArtifactState.step =
        fullGuidedArtifactState.disposableCommitPassed
            ? FullGuidedArtifactStep::DisposableRemountExport
            : FullGuidedArtifactStep::DisposableCleanup;
    lastRuntimeEvent = fullGuidedArtifactState.disposableCommitPassed
        ? "self_test_disposable_remount"
        : "self_test_disposable_commit_failed";
    renderInteractiveScreen(true);
}

void runFullGuidedDisposableRemountExport() {
    bool filesystemAttempted = false;
    bool filesystemCleanup = true;
    bool remountPassed = false;
    bool exportPassed = false;
    if (acquireFullGuidedDisposableResources()) {
        std::uint64_t identifiedCapacity = 0;
        if (identifyFullGuidedDisposableMedia(&identifiedCapacity)) {
            BoardSdFilesystem filesystem;
            filesystemAttempted = true;
            if (filesystem.beginReadOnly()) {
                const leshy1::storage::MediaIdentity media =
                    fullGuidedDisposableMedia(filesystem, identifiedCapacity);
                leshy1::storage::ExistingScratchReadRequest request;
                request.explicitlySelected = true;
                request.expectedFingerprint =
                    fullGuidedArtifactState.expectedFingerprint;
                request.runId = kFullGuidedDisposableRunId;
                request.scratchExists = filesystem.exists(
                    fullGuidedArtifactState.disposableScratchPath);
                const leshy1::storage::ReadPermit permit =
                    leshy1::storage::authorizeExistingScratchRead(
                        media, request);
                ArduinoFsSessionStoreIo io(
                    filesystem.driveNumber(), sdSessionStoreIoWorkspace);
                const bool opened = permit.allowed() &&
                    io.openExistingReadOnly(permit);
                leshy1::storage::SessionStoreRecoveryResult recovery;
                if (opened) {
                    recovery = leshy1::storage::recoverSession(
                        io, sessionStoreWorkspace,
                        &sessionStoreWorkspace.validationSession);
                }
                remountPassed = opened && recovery.valid() &&
                    recovery.generation == 1 && recovery.observations == 3 &&
                    io.bytesWritten() == 0 && io.writeCalls() == 0 &&
                    io.fileSyncs() == 0 && io.directorySyncs() == 0;
                if (remountPassed) {
                    LibraryController disposableLibrary;
                    exportPassed = disposableLibrary.add(
                        sessionStoreWorkspace.validationSession,
                        recovery.generation, SessionIntegrity::Valid, true,
                        false) && disposableLibrary.openSelected() &&
                        disposableLibrary.requestExport();
                    if (exportPassed) {
                        const auto json =
                            disposableLibrary.formatSelectedJsonExport(
                                diagnosticJson, sizeof(diagnosticJson));
                        fullGuidedArtifactState.disposableJsonBytes =
                            json.bytes;
                        const auto metadata = disposableLibrary.
                            formatSelectedCaptureMetadata(
                                diagnosticJson, sizeof(diagnosticJson));
                        fullGuidedArtifactState.disposableMetadataBytes =
                            metadata.bytes;
                        char row[256] = {};
                        const auto header =
                            disposableLibrary.formatSelectedCsvHeader(
                                row, sizeof(row));
                        fullGuidedArtifactState.disposableCsvBytes =
                            header.bytes;
                        exportPassed = json.valid() && json.bytes != 0 &&
                            metadata.valid() && metadata.bytes != 0 &&
                            header.valid() && header.bytes != 0;
                        for (std::size_t index = 0;
                             exportPassed && index < recovery.observations;
                             ++index) {
                            const auto record =
                                disposableLibrary.formatSelectedCsvRow(
                                    index, row, sizeof(row));
                            exportPassed = record.valid() &&
                                record.bytes != 0;
                            if (exportPassed) {
                                fullGuidedArtifactState.disposableCsvBytes +=
                                    record.bytes;
                                ++fullGuidedArtifactState.
                                    disposableCsvRecords;
                            }
                        }
                        exportPassed = exportPassed &&
                            fullGuidedArtifactState.disposableCsvRecords == 3;
                    }
                }
                io.end();
            }
            filesystem.end();
            filesystemCleanup = filesystem.cleanupComplete() &&
                filesystem.blockedWriteAttempts() == 0;
        }
    }
    releaseFullGuidedDisposableResources();
    fullGuidedArtifactState.disposableRemountComplete = true;
    fullGuidedArtifactState.disposableRemountPassed = remountPassed &&
        (!filesystemAttempted || filesystemCleanup) &&
        fullGuidedArtifactState.disposableResourceReleased;
    fullGuidedArtifactState.disposableExportComplete = true;
    fullGuidedArtifactState.disposableExportPassed = exportPassed &&
        fullGuidedArtifactState.disposableRemountPassed;
    fullGuidedArtifactState.workflowPassed =
        fullGuidedArtifactState.workflowPassed &&
        fullGuidedArtifactState.disposableRemountPassed &&
        fullGuidedArtifactState.disposableExportPassed;
    fullGuidedArtifactState.step = FullGuidedArtifactStep::DisposableCleanup;
    lastRuntimeEvent = fullGuidedArtifactState.disposableExportPassed
        ? "self_test_disposable_cleanup"
        : "self_test_disposable_remount_failed";
    renderInteractiveScreen(true);
}

bool runFullGuidedDisposableCleanup() {
    bool filesystemAttempted = false;
    bool filesystemCleanup = true;
    bool passed = !fullGuidedArtifactState.scratchCreated;
    if (acquireFullGuidedDisposableResources()) {
        std::uint64_t identifiedCapacity = 0;
        if (identifyFullGuidedDisposableMedia(&identifiedCapacity)) {
            BoardSdFilesystem filesystem;
            filesystemAttempted = true;
            if (filesystem.begin()) {
                const leshy1::storage::MediaIdentity media =
                    fullGuidedDisposableMedia(filesystem, identifiedCapacity);
                passed = removeFullGuidedDisposableScratch(filesystem, media);
            }
            filesystem.end();
            filesystemCleanup = filesystem.cleanupComplete();
        }
    }
    releaseFullGuidedDisposableResources();
    fullGuidedArtifactState.disposableCleanupComplete = true;
    fullGuidedArtifactState.disposableCleanupPassed = passed &&
        (!filesystemAttempted || filesystemCleanup) &&
        fullGuidedArtifactState.disposableResourceReleased;
    fullGuidedArtifactState.workflowPassed =
        fullGuidedArtifactState.workflowPassed &&
        fullGuidedArtifactState.disposableCleanupPassed;
    fullGuidedArtifactState.step = FullGuidedArtifactStep::ProductVerify;
    lastRuntimeEvent = fullGuidedArtifactState.disposableCleanupPassed
        ? "self_test_product_verify"
        : "self_test_disposable_cleanup_failed";
    renderInteractiveScreen(true);
    return fullGuidedArtifactState.disposableCleanupPassed;
}

void runFullGuidedProductVerify() {
    char expectedFingerprint[33] = {};
    std::snprintf(expectedFingerprint, sizeof(expectedFingerprint), "%s",
                  fullGuidedArtifactState.expectedFingerprint);
    recoverProductCatalogForFingerprint(expectedFingerprint, true);
    fullGuidedArtifactState.productVerifyComplete = true;
    fullGuidedArtifactState.productGenerationFinal =
        productBootRecovery.catalog.generation;
    fullGuidedArtifactState.productObservationsFinal =
        productBootRecovery.catalog.observations;
    const LibraryEntry* entry = libraryController.selected();
    fullGuidedArtifactState.productVerifyPassed =
        std::strcmp(productBootRecovery.status, "admitted") == 0 &&
        productBootRecovery.catalogAdmitted &&
        productBootRecovery.readOnlyGuaranteed &&
        productBootRecovery.cleanupComplete &&
        productBootRecovery.ownedAfter == 0 &&
        productBootRecovery.blockedWriteAttempts == 0 &&
        fullGuidedArtifactState.productGenerationFinal ==
            fullGuidedArtifactState.generationBefore &&
        fullGuidedArtifactState.productObservationsFinal ==
            fullGuidedArtifactState.observationsBefore &&
        entry != nullptr && entry->session != nullptr && entry->persistent &&
        entry->generation == fullGuidedArtifactState.generationBefore;
    fullGuidedArtifactState.workflowPassed =
        fullGuidedArtifactState.workflowPassed &&
        fullGuidedArtifactState.productVerifyPassed;
    finishFullGuidedActiveChecks(fullGuidedArtifactState.workflowPassed);
}

