anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool startWifiFrameCapture() {
    wifiFrameCapture.reset();
    capturePersistState = CapturePersistState::Result;
    capturePersistStatus = "volatile";
    capturePersistGeneration = 0;
    capturePersistHeapFreeBeforeMount = 0;
    capturePersistHeapLargestBeforeMount = 0;
    capturePersistFilesystemMountError = 0;
    wifiCaptureRenderedFrames = UINT32_MAX;
    wifiCaptureRenderedDrops = UINT32_MAX;
    wifiCaptureRenderedChannel = 0xffU;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started =
        wifiFrameCapture.begin(kProductWifiFrameCapturePlan, startedUs);
    nextCaptureUiRefreshUs = startedUs + 500000ULL;
    lastRuntimeEvent = started ? "capture_running" : "capture_start_failed";
    if (!started) releaseWifiFrameCaptureRfLease();
    return true;
}

bool stopWifiFrameCapture() {
    std::uint64_t endedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    releaseWifiFrameCaptureRfLease();
    const auto state = wifiFrameCapture.stats().state;
    lastRuntimeEvent =
        state == WifiFrameCaptureState::Complete && cleanup
            ? "capture_complete"
            : "capture_failed";
    return true;
}

void serviceWifiFrameCapture() {
    const auto before = wifiFrameCapture.stats();
    if (before.state != WifiFrameCaptureState::Running) return;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto after = wifiFrameCapture.stats();
    const bool terminal = after.state != WifiFrameCaptureState::Running;
    if (terminal) {
        releaseWifiFrameCaptureRfLease();
        lastRuntimeEvent = after.state == WifiFrameCaptureState::Complete &&
                                   wifiFrameCapture.cleanupComplete()
                               ? "capture_complete"
                               : "capture_failed";
    }
    const bool captureRoute = uiController.page() == 4 &&
        captureView == CaptureView::Wifi;
    if (captureRoute && terminal) {
        nextCaptureUiRefreshUs = 0;
        renderInteractiveScreen(true);
    } else if (captureRoute && nowUs >= nextCaptureUiRefreshUs) {
        nextCaptureUiRefreshUs = nowUs + 500000ULL;
        display.startWrite();
        renderWifiCaptureLiveData();
        display.endWrite();
    }
}

bool startInfraredCapture() {
    infraredCapture.reset();
    infraredCapturePersistState = CapturePersistState::Result;
    infraredCapturePersistStatus = "volatile";
    infraredCapturePersistGeneration = 0;
    infraredCapturePersistHeapFreeBeforeMount = 0;
    infraredCapturePersistHeapLargestBeforeMount = 0;
    infraredCapturePersistFilesystemMountError = 0;
    infraredReceiverReport = {};
    bool initialLevel = true;
    std::uint64_t startedUs = 0;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardInfraredReceiver.begin(
        owned, &infraredReceiverReport, &initialLevel, &startedUs);
    const bool started = hardwareReady && infraredCapture.begin(
        kProductInfraredCapturePlan, startedUs, initialLevel);
    if (!started) {
        boardInfraredReceiver.end();
        if (infraredCapture.stats().state == InfraredCaptureState::Waiting) {
            infraredCapture.fail(-1, startedUs == 0U ? 1U : startedUs);
        }
    }
    nextCaptureUiRefreshUs = startedUs + 200000ULL;
    lastRuntimeEvent = started ? "infrared_raw_waiting"
                               : "infrared_raw_start_failed";
    return true;
}

bool stopInfraredCapture() {
    std::uint64_t endedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const auto state = infraredCapture.stats().state;
    if (state == InfraredCaptureState::Waiting ||
        state == InfraredCaptureState::Capturing) {
        infraredCapture.cancel(endedUs);
    }
    const bool cleanup = boardInfraredReceiver.end();
    nextCaptureUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "infrared_raw_stopped"
                               : "infrared_raw_cleanup_failed";
    return true;
}

void serviceInfraredCapture() {
    if (uiController.page() != 4 || captureView != CaptureView::Infrared) {
        return;
    }
    const auto before = infraredCapture.stats().state;
    if (before != InfraredCaptureState::Waiting &&
        before != InfraredCaptureState::Capturing) {
        return;
    }
    bool level = true;
    std::uint64_t sampleUs = 0;
    if (!boardInfraredReceiver.sample(&level, &sampleUs)) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        infraredCapture.fail(-2, nowUs == 0U ? 1U : nowUs);
        boardInfraredReceiver.end();
        lastRuntimeEvent = "infrared_raw_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    infraredCapture.ingest({sampleUs, level});
    const auto after = infraredCapture.stats().state;
    const bool terminal = after != InfraredCaptureState::Waiting &&
        after != InfraredCaptureState::Capturing;
    if (terminal) {
        const bool cleanup = boardInfraredReceiver.end();
        lastRuntimeEvent = !cleanup
            ? "infrared_raw_cleanup_failed"
            : after == InfraredCaptureState::Complete
                  ? "infrared_raw_complete"
                  : after == InfraredCaptureState::TimedOut
                        ? "infrared_raw_no_signal"
                        : after == InfraredCaptureState::Unreliable
                              ? "infrared_raw_unreliable"
                              : "infrared_raw_terminal";
    }
    // The TFT and touch controller share long transactions with GPIO timing.
    // Once the first IR edge is observed, keep the hot path measurement-only.
    if (terminal) {
        nextCaptureUiRefreshUs = 0;
        renderInteractiveScreen(true);
    }
}

