anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitTargetsState(Stream& reply) {
    const TargetsController* controller = targetsProductRuntime == nullptr
        ? nullptr : &targetsProductRuntime->controller;
    const TargetListRow* selected = controller == nullptr
        ? nullptr : controller->selectedRow();
    const auto* selectedTarget = controller == nullptr
        ? nullptr : controller->selectedTarget();
    const auto* comparison = controller != nullptr &&
            controller->compareAvailable()
        ? &controller->comparison() : nullptr;
    const auto* selectedComparison = controller == nullptr
        ? nullptr : controller->selectedComparisonItem();
    TargetComparisonSide baselineSide{};
    TargetComparisonSide currentSide{};
    if (selectedComparison != nullptr) {
        controller->comparisonSide(controller->comparisonSelection(), false,
                                   &baselineSide);
        controller->comparisonSide(controller->comparisonSelection(), true,
                                   &currentSide);
    }
    const char* view = controller == nullptr
        ? "none"
        : controller->view() == TargetsView::Detail
              ? "detail"
              : controller->view() == TargetsView::Actions
                    ? "actions"
              : controller->view() == TargetsView::NameEdit
                    ? "name_edit"
              : controller->view() == TargetsView::TagList
                    ? "tag_list"
              : controller->view() == TargetsView::TagEdit
                    ? "tag_edit"
              : controller->view() == TargetsView::NotesEdit
                    ? "notes_edit"
              : controller->view() == TargetsView::CorrelationList
                    ? "correlation_list"
              : controller->view() == TargetsView::CorrelationReview
                    ? "correlation_review"
              : controller->view() == TargetsView::CorrelationEvidence
                    ? "correlation_evidence"
              : controller->view() == TargetsView::Compare
                    ? "compare"
                    : controller->view() == TargetsView::CompareDetail
                          ? "compare_detail" : "list";
    const char* stateHead = targetsStateHead ==
            leshy1::storage::RecoveryChoice::A
        ? "a"
        : targetsStateHead == leshy1::storage::RecoveryChoice::B
              ? "b" : "none";
    char selectedTargetId[TargetId::kSize * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        for (std::size_t index = 0; index < TargetId::kSize; ++index) {
            std::snprintf(selectedTargetId + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              selectedTarget->id.bytes[index]));
        }
    }
    const auto encodeHex = [](const char* input, std::size_t length,
                              char* output, std::size_t capacity) {
        if (output == nullptr || capacity == 0) return;
        output[0] = '\0';
        if (input == nullptr || capacity < length * 2U + 1U) return;
        for (std::size_t index = 0; index < length; ++index) {
            std::snprintf(output + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              static_cast<unsigned char>(input[index])));
        }
    };
    char selectedNameHex[TargetRecord::kNameCapacity * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        encodeHex(selectedTarget->name.data(), selectedTarget->nameLength,
                  selectedNameHex, sizeof(selectedNameHex));
    }
    char editorNameHex[TargetRecord::kNameCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::NameEdit) {
        encodeHex(controller->nameEditorText(), controller->nameEditorLength(),
                  editorNameHex, sizeof(editorNameHex));
    }
    char selectedTagHex[TargetRecord::kTagCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::TagList &&
        !controller->selectedTagIsAdd()) {
        encodeHex(controller->selectedTagText(),
                  controller->selectedTagLength(), selectedTagHex,
                  sizeof(selectedTagHex));
    }
    char editorTagHex[TargetRecord::kTagCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::TagEdit) {
        encodeHex(controller->tagEditorText(), controller->tagEditorLength(),
                  editorTagHex, sizeof(editorTagHex));
    }
    constexpr std::size_t kNotesProbePrefix =
        TargetRecord::kTagCapacity;
    char selectedNotesPrefixHex[kNotesProbePrefix * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        const std::size_t length = selectedTarget->notesLength < kNotesProbePrefix
            ? selectedTarget->notesLength : kNotesProbePrefix;
        encodeHex(selectedTarget->notes.data(), length,
                  selectedNotesPrefixHex, sizeof(selectedNotesPrefixHex));
    }
    char editorNotesPrefixHex[kNotesProbePrefix * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::NotesEdit) {
        const std::size_t length = controller->notesEditorLength() <
                kNotesProbePrefix
            ? controller->notesEditorLength() : kNotesProbePrefix;
        encodeHex(controller->notesEditorText(), length,
                  editorNotesPrefixHex, sizeof(editorNotesPrefixHex));
    }
    const CorrelationProposal* correlationProposal = controller == nullptr
        ? nullptr : controller->reviewedCorrelationProposal();
    Observation correlationKnown{};
    Observation correlationCandidate{};
    const bool correlationKnownLoaded = correlationProposal != nullptr &&
        controller->correlationEvidence(false, &correlationKnown);
    const bool correlationCandidateLoaded = correlationProposal != nullptr &&
        controller->correlationEvidence(true, &correlationCandidate);
    char correlationProposalId[33] = {};
    char correlationCandidateIdentityHex[
        leshy1::domain::targets::TargetIdentity::kValueCapacity * 2U + 1U] = {};
    if (correlationProposal != nullptr) {
        for (std::size_t index = 0;
             index < correlationProposal->id.bytes.size(); ++index) {
            std::snprintf(correlationProposalId + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              correlationProposal->id.bytes[index]));
        }
        for (std::size_t index = 0;
             index < correlationProposal->candidateIdentity.length; ++index) {
            std::snprintf(correlationCandidateIdentityHex + index * 2U, 3,
                          "%02X", static_cast<unsigned>(
                              correlationProposal->candidateIdentity
                                  .value[index]));
        }
    }
    const auto correlationConfidenceName = [](const CorrelationProposal* value) {
        if (value == nullptr) return "none";
        using leshy1::domain::targets::CorrelationConfidence;
        switch (value->confidence) {
            case CorrelationConfidence::Low: return "low";
            case CorrelationConfidence::Medium: return "medium";
            case CorrelationConfidence::High: return "high";
            case CorrelationConfidence::Stale: return "stale";
        }
        return "unknown";
    };
    const auto correlationFeatureName = [](const CorrelationProposal* value) {
        if (value == nullptr || value->featureCount == 0) return "none";
        using leshy1::domain::targets::CorrelationFeatureKind;
        switch (value->features[0].kind) {
            case CorrelationFeatureKind::AssignedVendorMatch:
                return "assigned_vendor";
            case CorrelationFeatureKind::AdvertisedNameMatch:
                return "advertised_name";
            case CorrelationFeatureKind::CoOccurrencePattern:
                return "co_occurrence";
            case CorrelationFeatureKind::ChannelPatternMatch:
                return "channel_pattern";
            case CorrelationFeatureKind::SignalTrendMatch:
                return "signal_trend";
        }
        return "unknown";
    };
    auto& line = diagnosticJson;
    std::memset(line, 0, sizeof(line));
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.targets.product.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"workspace_allocated\":%s,"
        "\"page_open\":%s,\"view\":\"%s\","
        "\"target_count\":%u,\"source_identity_count\":%u,"
        "\"truncated\":%s,\"entry_count\":%u,\"selection\":%u,"
        "\"compare_available\":%s,\"baseline_generation\":%lu,"
        "\"current_generation\":%lu,\"added\":%u,\"removed\":%u,"
        "\"changed\":%u,\"unchanged\":%u,"
        "\"comparison_count\":%u,\"comparison_selection\":%u,"
        "\"selected_change_class\":\"%s\","
        "\"selected_change_mask\":%u,"
        "\"baseline_evidence_present\":%s,"
        "\"baseline_evidence_generation\":%lu,"
        "\"baseline_observation_sequence\":%llu,"
        "\"baseline_rssi_dbm\":%d,\"baseline_channel\":%u,"
        "\"current_evidence_present\":%s,"
        "\"current_evidence_generation\":%lu,"
        "\"current_observation_sequence\":%llu,"
        "\"current_rssi_dbm\":%d,\"current_channel\":%u,"
        "\"selected_generation\":%lu,\"selected_rssi_dbm\":%d,"
        "\"selected_target_present\":%s,\"selected_target_id\":\"%s\","
        "\"selected_favorite\":%s,"
        "\"selected_name_length\":%u,\"selected_name_hex\":\"%s\","
        "\"selected_tag_count\":%u,\"tag_selection\":%u,"
        "\"selected_tag_length\":%u,\"selected_tag_hex\":\"%s\","
        "\"selected_revision\":%lu,"
        "\"action_selection\":%u,\"name_editor_selection\":%u,"
        "\"name_editor_length\":%u,\"name_editor_hex\":\"%s\","
        "\"name_editor_glyph\":%u,\"name_editor_dirty\":%s,"
        "\"tag_editor_selection\":%u,\"tag_editor_length\":%u,"
        "\"tag_editor_hex\":\"%s\",\"tag_editor_glyph\":%u,"
        "\"tag_editor_can_save\":%s,"
        "\"selected_notes_length\":%u,"
        "\"selected_notes_prefix_hex\":\"%s\","
        "\"notes_editor_selection\":%u,\"notes_editor_length\":%u,"
        "\"notes_editor_prefix_hex\":\"%s\",\"notes_editor_glyph\":%u,"
        "\"notes_editor_dirty\":%s,"
        "\"correlation_count\":%u,\"correlation_selection\":%u,"
        "\"correlation_review_selection\":%u,"
        "\"correlation_proposal_present\":%s,"
        "\"correlation_proposal_id\":\"%s\","
        "\"correlation_candidate_identity_kind\":%u,"
        "\"correlation_candidate_identity_discriminator\":%u,"
        "\"correlation_candidate_identity_hex\":\"%s\","
        "\"correlation_score_permille\":%u,"
        "\"correlation_confidence\":\"%s\","
        "\"correlation_stale\":%s,\"correlation_feature_count\":%u,"
        "\"correlation_feature_kind\":\"%s\","
        "\"correlation_feature_strength_permille\":%u,"
        "\"correlation_feature_maximum_points\":%u,"
        "\"correlation_feature_awarded_points\":%u,"
        "\"correlation_known_loaded\":%s,"
        "\"correlation_known_generation\":%lu,"
        "\"correlation_known_sequence\":%llu,"
        "\"correlation_known_radio\":%u,"
        "\"correlation_known_rssi_dbm\":%d,"
        "\"correlation_known_channel\":%u,"
        "\"correlation_candidate_loaded\":%s,"
        "\"correlation_candidate_generation\":%lu,"
        "\"correlation_candidate_sequence\":%llu,"
        "\"correlation_candidate_radio\":%u,"
        "\"correlation_candidate_rssi_dbm\":%d,"
        "\"correlation_candidate_channel\":%u,"
        "\"correlation_evidence_candidate\":%s,"
        "\"read_only\":false,\"write_enabled\":%s,"
        "\"target_state_generation\":%lu,\"target_state_head\":\"%s\","
        "\"mutation_state\":\"%s\",\"mutation_status\":\"%s\","
        "\"mutation_correlation\":%s,"
        "\"mutation_correlation_kind\":\"%s\","
        "\"mutation_correlation_status\":\"%s\","
        "\"mutation_persisted\":%s,\"mutation_generation\":%lu,"
        "\"mutation_action_us\":%llu,\"mutation_elapsed_us\":%llu,"
        "\"mutation_bytes_written\":%llu,\"mutation_write_calls\":%lu,"
        "\"mutation_file_syncs\":%lu,\"mutation_directory_syncs\":%lu,"
        "\"mutation_heap_free_before_mount\":%lu,"
        "\"mutation_heap_largest_before_mount\":%lu,"
        "\"mutation_identity_attempts\":%u,"
        "\"mutation_identity_transient_retries\":%u,"
        "\"mutation_expected_cid\":\"%s\","
        "\"mutation_observed_cid\":\"%s\","
        "\"blocked_write_attempts\":%lu,"
        "\"filesystem_mount_error\":%d,\"cleanup_complete\":%s,"
        "\"lease_mask\":%lu,\"heap_free_before\":%lu,"
        "\"heap_free_now\":%lu,\"heap_free_after_release\":%lu}",
        targetsProductStatus,
        controller == nullptr ? "false" : "true",
        uiController.page() == 7 ? "true" : "false", view,
        static_cast<unsigned>(controller == nullptr ? 0 : controller->size()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->sourceIdentityCount()),
        controller != nullptr && controller->truncated() ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->entryCount()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->selection()),
        comparison == nullptr ? "false" : "true",
        static_cast<unsigned long>(comparison == nullptr
                                       ? 0 : comparison->baseline.generation),
        static_cast<unsigned long>(comparison == nullptr
                                       ? 0 : comparison->current.generation),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->added),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->removed),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->changed),
        static_cast<unsigned>(comparison == nullptr
                                  ? 0 : comparison->unchanged),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->comparisonSize()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->comparisonSelection()),
        selectedComparison == nullptr
            ? "none"
            : leshy1::domain::targets::targetComparisonClassName(
                  selectedComparison->classification),
        static_cast<unsigned>(selectedComparison == nullptr
                                  ? 0 : selectedComparison->changes),
        baselineSide.present ? "true" : "false",
        static_cast<unsigned long>(baselineSide.present
            ? baselineSide.evidence.sourceGeneration : 0),
        static_cast<unsigned long long>(baselineSide.present
            ? baselineSide.evidence.observationSequence : 0),
        static_cast<int>(baselineSide.present
            ? baselineSide.observation.rssiDbm : 0),
        static_cast<unsigned>(baselineSide.present
            ? baselineSide.observation.channel : 0),
        currentSide.present ? "true" : "false",
        static_cast<unsigned long>(currentSide.present
            ? currentSide.evidence.sourceGeneration : 0),
        static_cast<unsigned long long>(currentSide.present
            ? currentSide.evidence.observationSequence : 0),
        static_cast<int>(currentSide.present
            ? currentSide.observation.rssiDbm : 0),
        static_cast<unsigned>(currentSide.present
            ? currentSide.observation.channel : 0),
        static_cast<unsigned long>(selected == nullptr
                                       ? 0 : selected->evidence.sourceGeneration),
        static_cast<int>(selected == nullptr ? 0 : selected->latest.rssiDbm),
        selectedTarget == nullptr ? "false" : "true",
        selectedTargetId,
        selectedTarget != nullptr && selectedTarget->favorite
            ? "true" : "false",
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->nameLength),
        selectedNameHex,
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->tagCount),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagSelection()),
        static_cast<unsigned>(controller == nullptr ||
                                      controller->view() != TargetsView::TagList
                                  ? 0 : controller->selectedTagLength()),
        selectedTagHex,
        static_cast<unsigned long>(selectedTarget == nullptr
                                       ? 0 : selectedTarget->revision),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->actionSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorLength()),
        editorNameHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorGlyph()),
        controller != nullptr && controller->nameEditorDirty()
            ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorLength()),
        editorTagHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorGlyph()),
        controller != nullptr && controller->tagEditorCanSave()
            ? "true" : "false",
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->notesLength),
        selectedNotesPrefixHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorLength()),
        editorNotesPrefixHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorGlyph()),
        controller != nullptr && controller->notesEditorDirty()
            ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->selectedCorrelationCount()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->correlationSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->correlationReviewSelection()),
        correlationProposal == nullptr ? "false" : "true",
        correlationProposalId,
        correlationProposal == nullptr ? 0U : static_cast<unsigned>(
            correlationProposal->candidateIdentity.kind),
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateIdentity.discriminator),
        correlationCandidateIdentityHex,
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->scorePermille),
        correlationConfidenceName(correlationProposal),
        correlationProposal != nullptr && correlationProposal->stale
            ? "true" : "false",
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->featureCount),
        correlationFeatureName(correlationProposal),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .strengthPermille),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .maximumPoints),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .awardedPoints),
        correlationKnownLoaded ? "true" : "false",
        static_cast<unsigned long>(correlationProposal == nullptr ||
                                           correlationProposal->featureCount == 0
                                       ? 0
                                       : correlationProposal->features[0]
                                             .targetEvidence.sourceGeneration),
        static_cast<unsigned long long>(correlationProposal == nullptr ||
                                                correlationProposal
                                                        ->featureCount == 0
                                            ? 0
                                            : correlationProposal->features[0]
                                                  .targetEvidence
                                                  .observationSequence),
        static_cast<unsigned>(correlationKnownLoaded
                                  ? correlationKnown.radio : RadioKind{}),
        static_cast<int>(correlationKnownLoaded ? correlationKnown.rssiDbm : 0),
        static_cast<unsigned>(correlationKnownLoaded
                                  ? correlationKnown.channel : 0),
        correlationCandidateLoaded ? "true" : "false",
        static_cast<unsigned long>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateEvidence.sourceGeneration),
        static_cast<unsigned long long>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateEvidence.observationSequence),
        static_cast<unsigned>(correlationCandidateLoaded
                                  ? correlationCandidate.radio : RadioKind{}),
        static_cast<int>(correlationCandidateLoaded
                             ? correlationCandidate.rssiDbm : 0),
        static_cast<unsigned>(correlationCandidateLoaded
                                  ? correlationCandidate.channel : 0),
        controller != nullptr && controller->correlationEvidenceIsCandidate()
            ? "true" : "false",
        controller != nullptr &&
                ((controller->view() == TargetsView::Actions &&
                  controller->selectedAction() == TargetActionItem::Favorite) ||
                 (controller->view() == TargetsView::NameEdit &&
                  controller->nameEditorDirty()) ||
                 (controller->view() == TargetsView::TagList &&
                  !controller->selectedTagIsAdd()) ||
                 (controller->view() == TargetsView::TagEdit &&
                  controller->tagEditorCanSave()) ||
                 (controller->view() == TargetsView::NotesEdit &&
                  controller->notesEditorDirty()) ||
                 (controller->view() == TargetsView::CorrelationReview &&
                  controller->correlationReviewSelection() >= 2)) &&
                targetsMutationState != TargetsMutationState::Saving
            ? "true" : "false",
        static_cast<unsigned long>(targetsStateGeneration), stateHead,
        targetsMutationStateName(targetsMutationState),
        targetsMutationStatus,
        targetsMutationReport.correlation ? "true" : "false",
        targetsMutationReport.correlationKind == CorrelationActionKind::Accept
            ? "accept" : "reject",
