anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitSurveyBrowser(Stream& reply) {
    const Observation* selected = surveyController.selected();
    const ObservationHistory history = surveyController.selectedHistory();
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.browser.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"filter\":\"%s\",\"draft_filter\":\"%s\","
        "\"filter_focused\":%s,\"total\":%u,\"visible\":%u,"
        "\"selection\":%u,\"selected\":%s,\"selected_radio\":\"%s\","
        "\"history_valid\":%s,\"history_samples\":%u,"
        "\"history_retained\":%u,\"history_min_rssi_dbm\":%d,"
        "\"history_max_rssi_dbm\":%d,\"history_latest_rssi_dbm\":%d,"
        "\"read_only_query\":true,\"radio_touched\":false,"
        "\"storage_touched\":false}",
        leshy1::apps::survey::surveyViewName(surveyController.view()),
        leshy1::apps::survey::surveyFilterName(surveyController.filter()),
        leshy1::apps::survey::surveyFilterName(surveyController.draftFilter()),
        surveyController.filterFocused() ? "true" : "false",
        static_cast<unsigned>(surveySession.size()),
        static_cast<unsigned>(surveyController.visibleSize()),
        static_cast<unsigned>(surveyController.selection()),
        selected == nullptr ? "false" : "true",
        selected == nullptr ? "none"
                            : (selected->radio == RadioKind::Ble ? "ble" : "wifi"),
        history.valid ? "true" : "false",
        static_cast<unsigned>(history.sampleCount),
        static_cast<unsigned>(history.retainedSamples),
        static_cast<int>(history.minimumRssiDbm),
        static_cast<int>(history.maximumRssiDbm),
        static_cast<int>(history.latestRssiDbm));
    reply.println(line);
}

bool startWifiNetworksProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    closeProductSurveyBackend();
    wifiNetworkCatalog.reset();
    wifiNetworkNavigationOrder.reset();
    wifiNetworkSelection = 0;
    wifiNetworkDetail = {};
    wifiNetworkRenderedDetail = {};
    wifiNetworkDetailSignal = {};
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::WifiOnly);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    wifiProductView = WifiProductView::Networks;
    if (!startProductSurvey()) {
        wifiProductView = WifiProductView::Menu;
        return false;
    }
    lastRuntimeEvent = "wifi_networks_preparing";
    return true;
}

bool startBleDevicesProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    closeProductSurveyBackend();
    bleDeviceCatalog.reset();
    bleDeviceNavigationOrder.reset();
    bleDeviceSelection = 0;
    bleDeviceDetail = {};
    bleDeviceRenderedDetail = {};
    bleDeviceDetailSignal = {};
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::BleOnly);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    bleProductView = BleProductView::Devices;
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return true;
    }
    if (!startProductSurvey()) return true;
    lastRuntimeEvent = "ble_devices_preparing";
    return true;
}

bool startWifiDevicesProduct() {
    wifiFrameCapture.reset();
    wifiDeviceCatalog.reset();
    wifiDeviceNavigationOrder.reset();
    wifiDeviceSelection = 0;
    wifiDeviceDetail = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginDeviceMonitor(startedUs);
    wifiProductView = WifiProductView::Devices;
    nextWifiDeviceUiRefreshUs = startedUs + 250000ULL;
    lastRuntimeEvent = started ? "wifi_devices_listening"
                               : "wifi_devices_start_failed";
    return true;
}

bool stopWifiDevicesProduct() {
    std::uint64_t endedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 1;
    nextWifiDeviceUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "wifi_menu" : "wifi_devices_cleanup_failed";
    return true;
}

void serviceWifiDevicesProduct() {
    const auto before = wifiFrameCapture.deviceMonitorStats();
    if (!before.active) return;
    std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    bool changed = false;
    const WifiDeviceRecord* selected = wifiDeviceAt(wifiDeviceSelection);
    const std::array<std::uint8_t, 6> selectionAnchor = selected == nullptr
        ? std::array<std::uint8_t, 6>{} : selected->address;
    const bool selectionAnchored = selected != nullptr;
    WifiDeviceObservation observation{};
    while (wifiFrameCapture.pollDevice(&observation)) {
        const std::size_t existingIndex =
            wifiDeviceCatalog.indexOfAddress(observation.address);
        if (wifiDeviceNavigationOrder.locked() &&
            existingIndex >= wifiDeviceCatalog.size()) {
            observation = {};
            continue;
        }
        if (!observation.locallyAdministered &&
            observation.wpsManufacturerLength == 0U) {
            const WifiDeviceRecord* existing =
                wifiDeviceCatalog.at(existingIndex);
            const bool needsVendor = existing == nullptr ||
                (existing->wpsManufacturerLength == 0U &&
                 existing->ouiVendorLength == 0U);
            if (needsVendor) {
                char vendor[WifiDeviceObservation::kWpsTextCapacity] = {};
                if (wifiOuiDatabase.lookup(observation.address.data(), vendor,
                                           sizeof(vendor))) {
                    std::snprintf(observation.ouiVendor.data(),
                                  observation.ouiVendor.size(), "%s", vendor);
                    observation.ouiVendorLength = static_cast<std::uint8_t>(
                        std::strlen(observation.ouiVendor.data()));
                }
            }
        }
        changed = wifiDeviceCatalog.upsert(observation) || changed;
        observation = {};
    }
    if (changed && selectionAnchored &&
        !wifiDeviceNavigationOrder.locked()) {
        const std::size_t anchored =
            wifiDeviceCatalog.indexOfAddress(selectionAnchor);
        wifiDeviceSelection = anchored < wifiDeviceCatalog.size()
            ? anchored : wifiDeviceCatalog.size() - 1U;
    }
    if (changed &&
        wifiProductView == WifiProductView::DeviceDetail) {
        const std::size_t detailIndex =
            wifiDeviceCatalog.indexOfAddress(wifiDeviceDetail.address);
        const WifiDeviceRecord* current = wifiDeviceCatalog.at(detailIndex);
        if (current != nullptr) wifiDeviceDetail = *current;
    }
    const auto after = wifiFrameCapture.deviceMonitorStats();
    const bool terminal = before.active && !after.active;
    if (terminal) lastRuntimeEvent = "wifi_devices_failed";
    // At most four data-only refreshes per second. Device identity remains
    // stable while the integrated selected-channel radar updates in place.
    if ((changed || terminal) && uiController.page() == 2 &&
        (wifiProductView == WifiProductView::Devices ||
         wifiProductView == WifiProductView::DeviceDetail) &&
        (terminal || nowUs >= nextWifiDeviceUiRefreshUs)) {
        nextWifiDeviceUiRefreshUs = nowUs + 250000ULL;
        renderInteractiveScreen(false);
    }
}

bool startWifiChannelsProduct() {
    wifiFrameCapture.reset();
    wifiChannelRenderedLoads.fill(0xffffU);
    wifiChannelRenderedAverages.fill(0xffffU);
    wifiChannelRenderedBest = 0xffU;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginChannelMonitor(startedUs);
    wifiProductView = WifiProductView::Channels;
    lastRuntimeEvent = started ? "wifi_channels_measuring"
                               : "wifi_channels_start_failed";
    return true;
}

bool openWifiVisitProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    const bool cleanup = closeProductSurveyBackend();
    if (!cleanup) {
        lastRuntimeEvent = "wifi_visit_cleanup_failed";
        return false;
    }
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    productSurveyRuntime.cleanupComplete = true;
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::WifiOnly);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    wifiProductView = WifiProductView::Visit;
    lastRuntimeEvent = "wifi_visit_setup";
    return true;
}

bool stopWifiChannelsProduct() {
    std::uint64_t endedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 2;
    lastRuntimeEvent = cleanup ? "wifi_menu" : "wifi_channels_cleanup_failed";
    return true;
}

void serviceWifiChannelsProduct() {
    const auto beforeStats = wifiFrameCapture.channelMonitorStats();
    if (!beforeStats.active) return;
    const auto before = wifiFrameCapture.channelLoadSnapshot();
    std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto afterStats = wifiFrameCapture.channelMonitorStats();
    const auto after = wifiFrameCapture.channelLoadSnapshot();
    const bool terminal = beforeStats.active && !afterStats.active;
    if (terminal) lastRuntimeEvent = "wifi_channels_failed";
    if ((terminal || after.revision != before.revision) &&
        uiController.page() == 2 &&
        wifiProductView == WifiProductView::Channels) {
        renderInteractiveScreen(false);
    }
}

