anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                wifiProductView = WifiProductView::Devices;
                lastRuntimeEvent = "wifi_devices";
                changed = true;
            }
        } else if (wifiProductView == WifiProductView::Devices) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiDeviceNavigationOrder.lock(wifiDeviceCatalog);
            }
            if (action == UiAction::Up && wifiDeviceSelection > 0U) {
                --wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiDeviceSelection + 1U < wifiDeviceVisibleSize()) {
                ++wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const WifiDeviceRecord* device =
                    wifiDeviceAt(wifiDeviceSelection);
                if (device != nullptr) {
                    wifiDeviceDetail = *device;
                    std::uint64_t nowUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (nowUs == 0U) nowUs = 1U;
                    const bool locked = wifiFrameCapture.lockDeviceChannel(
                        wifiDeviceDetail.channel, nowUs);
                    wifiProductView = WifiProductView::DeviceDetail;
                    nextWifiDeviceUiRefreshUs = nowUs;
                    lastRuntimeEvent = locked
                        ? "wifi_device_detail_live"
                        : "wifi_device_detail_live_unavailable";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = stopWifiDevicesProduct();
            }
        } else if (wifiProductView == WifiProductView::Channels) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopWifiChannelsProduct();
            }
        } else if (wifiProductView == WifiProductView::Networks &&
                   surveyWorkflow.state() == SurveyWorkflowState::Running) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiNetworkNavigationOrder.lock(wifiNetworkCatalog);
            }
            if (action == UiAction::Up && wifiNetworkSelection > 0) {
                --wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiNetworkSelection + 1U <
                           wifiNetworkVisibleSize()) {
                ++wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const Observation* observation = wifiNetworkAt(
                    wifiNetworkSelection);
                if (observation != nullptr) {
                    wifiNetworkDetail = *observation;
                    const std::size_t catalogIndex =
                        wifiNetworkCatalog.indexOfIdentity(*observation);
                    const WifiNetworkSignalStats* signal =
                        wifiNetworkCatalog.signalAt(catalogIndex);
                    wifiNetworkDetailSignal = signal == nullptr
                        ? WifiNetworkSignalStats{
                            1U, observation->rssiDbm,
                            observation->rssiDbm, 0}
                        : *signal;
                    wifiProductView = WifiProductView::NetworkDetail;
                    lastRuntimeEvent = "wifi_network_detail";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = requestProductSurveyWorkerStop(true);
            }
        } else if (wifiProductView == WifiProductView::Visit &&
                   (surveyWorkflow.state() == SurveyWorkflowState::Result ||
                    surveyWorkflow.state() == SurveyWorkflowState::Error) &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            surveyPipeline.resetToSetup();
            wifiProductView = WifiProductView::Menu;
            wifiProductSelection = 3;
            lastRuntimeEvent = "wifi_menu";
            changed = true;
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            productSurveySourceUnavailableVisible() &&
            (action == UiAction::Select || action == UiAction::Right ||
             action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            lastRuntimeEvent = "source_unavailable_waiting_back";
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   surveySourceController.view() ==
                       SurveySetupView::Sources) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveySourceController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveySourceController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                const SurveySetupActivation activation =
                    surveySourceController.activate();
                changed = activation ==
                    SurveySetupActivation::SourceChanged;
                lastRuntimeEvent = leshy1::apps::survey::
                    surveySetupActivationName(activation);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                handled = true;
                changed = surveySourceController.back();
                if (changed) lastRuntimeEvent = "survey_source_plan";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            changed = action == UiAction::Up
                ? surveySourceController.previous()
                : surveySourceController.next();
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            const SurveySetupActivation activation =
                surveySourceController.activate();
            lastRuntimeEvent = leshy1::apps::survey::
                surveySetupActivationName(activation);
            if (activation == SurveySetupActivation::OpenedSources) {
                changed = true;
            } else if (activation ==
                       SurveySetupActivation::OpenedSpectrum) {
                const bool available = BoardProfile::kRfShieldDeclared &&
                    !BoardProfile::kGpsDeclared &&
                    !BoardProfile::kPn532Declared;
                if (available) {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    rfSpectrumSelection = 0;
                    changed = true;
                }
            } else if (activation ==
                       SurveySetupActivation::StartRequested) {
                if (productSurveyRuntime.selected) {
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Idle) {
                        changed = startProductSurvey();
                    }
                } else {
                    std::uint64_t startedUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (startedUs == 0) startedUs = 1;
                    const SurveyPipelineStatus started = surveyPipeline.start(
                        "product-wifi-preview", startedUs);
                    changed = started == SurveyPipelineStatus::Started &&
                              publishGoldenObservations(surveyPipeline);
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(
                            changed ? surveyPipeline.lastStatus() : started);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            if (wifiProductView == WifiProductView::Visit &&
                surveySourceController.view() == SurveySetupView::Plan &&
                productSurveyControl() == ProductSurveyWorkerControl::Idle) {
                handled = true;
                surveyPipeline.resetToSetup();
                wifiProductView = WifiProductView::Menu;
                wifiProductSelection = 3;
                lastRuntimeEvent = "wifi_menu";
                changed = true;
            } else if (productSurveyRuntime.selected &&
                productSurveyControl() != ProductSurveyWorkerControl::Idle) {
                handled = true;
                changed = requestProductSurveyWorkerStop(true);
            } else {
                surveyPipeline.cancel();
                if (productSurveyRuntime.selected) {
                    const bool cleanup = closeProductSurveyBackend();
                    productSurveyRuntime.status = cleanup ? "cancelled"
                                                           : "cleanup_failed";
                }
                lastRuntimeEvent =
                    leshy1::apps::survey::surveyPipelineStatusName(
                        surveyPipeline.lastStatus());
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Filter) {
            handled = true;
            if (action == UiAction::Up) {
                changed = surveyController.previous();
            } else if (action == UiAction::Down) {
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = surveyController.activateFilter();
                if (changed) lastRuntimeEvent = "survey_filter_applied";
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = surveyController.back();
                if (changed) lastRuntimeEvent = "survey_filter_cancelled";
            } else {
                handled = false;
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Detail) {
            if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                changed = surveyController.back();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                if (productSurveyRuntime.selected) {
                    changed =
                        productSurveyControl() ==
                                ProductSurveyWorkerControl::Paused
                            ? commitPausedProductSurvey()
                            : requestProductSurveyWorkerStop(false);
                } else {
                    const SurveyPipelineStatus status =
                        surveyPipeline.stopAndCommit(
                            static_cast<std::uint64_t>(esp_timer_get_time()));
                    changed = status == SurveyPipelineStatus::Committed;
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(status);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::List) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveyController.previous();
                if (changed && surveyController.filterFocused() &&
                    productSurveyRuntime.selected &&
                    productSurveyControl() ==
                        ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerPause() || changed;
                }
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                changed = surveyController.openSelected();
            } else if ((action == UiAction::Back || action == UiAction::Left) &&
                       surveyWorkflow.state() == SurveyWorkflowState::Running) {
                if (productSurveyRuntime.selected) {
                    handled = true;
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Paused) {
                        releaseProductSurveyAfterTerminal("cancelled", true);
                        changed = true;
                    } else {
                        changed = requestProductSurveyWorkerStop(true);
                    }
                } else {
                    surveyPipeline.cancel();
                    lastRuntimeEvent = "survey_cancelled";
                }
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 3) {
        bool handled = false;
        bool changed = false;
        if (libraryController.view() == LibraryView::ExportReady &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            changed = libraryController.requestExport();
        } else if (libraryController.view() == LibraryView::SessionList) {
            if (action == UiAction::Up) {
                handled = true;
                changed = libraryController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = libraryController.next();
            } else if (action == UiAction::Select || action == UiAction::Right) {
                handled = true;
                changed = libraryController.openSelected();
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 7 &&
        targetsMutationState == TargetsMutationState::Saving) {
        uiController.recordHandledAction(action);
        return finish(false);
    }
    if (!wasRoot && uiController.page() == 7 &&
        targetsProductRuntime != nullptr) {
        TargetsController& controller = targetsProductRuntime->controller;
        bool handled = false;
        bool changed = false;
        if ((controller.view() == TargetsView::Detail ||
             controller.view() == TargetsView::Actions ||
             controller.view() == TargetsView::NameEdit ||
             controller.view() == TargetsView::TagList ||
             controller.view() == TargetsView::TagEdit ||
             controller.view() == TargetsView::NotesEdit ||
             controller.view() == TargetsView::CorrelationList ||
             controller.view() == TargetsView::CorrelationReview ||
             controller.view() == TargetsView::CorrelationEvidence ||
             controller.view() == TargetsView::CompareDetail) &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = controller.back();
        } else if (controller.view() == TargetsView::Detail &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            changed = controller.openSelected();
        } else if (controller.view() == TargetsView::Actions &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if (controller.view() == TargetsView::Actions &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::Actions &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            switch (controller.selectedAction()) {
                case TargetActionItem::Favorite:
                    changed = requestTargetsFavoriteMutation();
                    break;
                case TargetActionItem::Name:
                    changed = controller.openNameEditor();
                    break;
                case TargetActionItem::Tags:
                    changed = controller.openTagList();
                    break;
                case TargetActionItem::Notes:
                    changed = controller.openNotesEditor();
                    break;
                case TargetActionItem::Correlations:
                    changed = controller.openCorrelationList();
                    break;
            }
        } else if (controller.view() == TargetsView::NameEdit &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if (controller.view() == TargetsView::NameEdit &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::NameEdit &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            switch (controller.nameEditorSelection()) {
                case 0: changed = controller.cycleNameEditorGlyph(); break;
                case 1: changed = controller.appendNameEditorGlyph(); break;
                case 2: changed = controller.eraseNameEditorGlyph(); break;
                case 3: changed = requestTargetsNameMutation(); break;
            }
        } else if (controller.view() == TargetsView::TagList &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if (controller.view() == TargetsView::TagList &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::TagList &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            changed = controller.selectedTagIsAdd()
                ? controller.openTagEditor()
                : requestTargetsTagRemoveMutation();
        } else if (controller.view() == TargetsView::TagEdit &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if (controller.view() == TargetsView::TagEdit &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::TagEdit &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            switch (controller.tagEditorSelection()) {
                case 0: changed = controller.cycleTagEditorGlyph(); break;
                case 1: changed = controller.appendTagEditorGlyph(); break;
                case 2: changed = controller.eraseTagEditorGlyph(); break;
                case 3: changed = requestTargetsTagAddMutation(); break;
            }
        } else if (controller.view() == TargetsView::NotesEdit &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if (controller.view() == TargetsView::NotesEdit &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::NotesEdit &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            switch (controller.notesEditorSelection()) {
                case 0: changed = controller.cycleNotesEditorGlyph(); break;
                case 1: changed = controller.appendNotesEditorGlyph(); break;
                case 2: changed = controller.eraseNotesEditorGlyph(); break;
                case 3: changed = requestTargetsNotesMutation(); break;
            }
        } else if ((controller.view() == TargetsView::CorrelationList ||
                    controller.view() == TargetsView::CorrelationReview) &&
                   action == UiAction::Up) {
            handled = true;
            changed = controller.previous();
        } else if ((controller.view() == TargetsView::CorrelationList ||
                    controller.view() == TargetsView::CorrelationReview) &&
                   action == UiAction::Down) {
            handled = true;
            changed = controller.next();
        } else if (controller.view() == TargetsView::CorrelationList &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            changed = controller.openSelected();
        } else if (controller.view() == TargetsView::CorrelationReview &&
                   (action == UiAction::Select || action == UiAction::Right)) {
            handled = true;
            if (controller.correlationReviewSelection() < 2) {
                changed = controller.openSelected();
            } else {
                changed = requestTargetsCorrelationMutation(
                    controller.correlationReviewSelection() == 2
                        ? CorrelationActionKind::Accept
                        : CorrelationActionKind::Reject);
            }
        } else if (controller.view() == TargetsView::List ||
                   controller.view() == TargetsView::Compare) {
            if (action == UiAction::Up) {
                handled = true;
                changed = controller.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = controller.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                changed = controller.openSelected();
            } else if (controller.view() == TargetsView::Compare &&
                       (action == UiAction::Back ||
                        action == UiAction::Left)) {
                handled = true;
                changed = controller.back();
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 4) {
        if (captureView == CaptureView::SourceMenu) {
            bool handled = false;
            bool changed = false;
