anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
            if (action == UiAction::Up && captureSourceSelection != 0) {
                captureSourceSelection = 0;
                handled = changed = true;
            } else if (action == UiAction::Down &&
                       captureSourceSelection != 1) {
                captureSourceSelection = 1;
                handled = changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       (captureSourceSelection == 0 ||
                        BoardProfile::kIrDeclared)) {
                captureView = captureSourceSelection == 0
                    ? CaptureView::Wifi : CaptureView::Infrared;
                lastRuntimeEvent = captureSourceSelection == 0
                    ? "capture_wifi_setup" : "capture_infrared_setup";
                handled = changed = true;
            }
            if (handled) {
                uiController.recordHandledAction(action);
                return finish(changed);
            }
        } else if (captureView == CaptureView::Infrared) {
            const auto state = infraredCapture.stats().state;
            if (state == InfraredCaptureState::Idle &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState == CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(requestInfraredRawCapturePersist());
            }
            if (infraredCapturePersistState == CapturePersistState::Saving) {
                uiController.recordHandledAction(action);
                return finish(false);
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState != CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (state != InfraredCaptureState::Waiting &&
                state != InfraredCaptureState::Capturing &&
                state != InfraredCaptureState::Complete &&
                (action == UiAction::Select || action == UiAction::Right)) {
                uiController.recordHandledAction(action);
                return finish(startInfraredCapture());
            }
            if (action == UiAction::Back || action == UiAction::Left) {
                if (state == InfraredCaptureState::Waiting ||
                    state == InfraredCaptureState::Capturing) {
                    stopInfraredCapture();
                }
                infraredCapture.reset();
                infraredCapturePersistState = CapturePersistState::Result;
                infraredCapturePersistStatus = "volatile";
                infraredCapturePersistGeneration = 0;
                captureView = CaptureView::SourceMenu;
                lastRuntimeEvent = "capture_source_menu";
                uiController.recordHandledAction(action);
                return finish(true);
            }
        } else {
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(startWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Running &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(stopWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result &&
            (action == UiAction::Select || action == UiAction::Right)) {
            capturePersistState = CapturePersistState::Confirm;
            capturePersistStatus = "awaiting_confirmation";
            lastRuntimeEvent = "capture_store_confirm";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(requestWifiFrameCapturePersist());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Back || action == UiAction::Left)) {
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            lastRuntimeEvent = "capture_store_cancelled";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Saving) {
            uiController.recordHandledAction(action);
            return finish(false);
        }
        if (action == UiAction::Back || action == UiAction::Left) {
            if (state == WifiFrameCaptureState::Running) {
                stopWifiFrameCapture();
            }
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
            captureView = CaptureView::SourceMenu;
            lastRuntimeEvent = "capture_source_menu";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        }
    }
    if (!wasRoot && uiController.page() == kDevicePage) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up && deviceSelection > 0) {
            handled = true;
            --deviceSelection;
            changed = true;
        } else if (action == UiAction::Down &&
                   deviceSelection + 1U < kDeviceItemCount) {
            handled = true;
            ++deviceSelection;
            changed = true;
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            constexpr std::uint8_t pages[kDeviceItemCount] = {
                kPowerPage, 5, 6, 1, kAboutPage,
            };
            changed = uiController.openChild(pages[deviceSelection]);
            if (changed && deviceSelection == 1) {
                interfaceSettingsController.enter();
            }
            lastRuntimeEvent = changed ? "device_item_opened"
                                       : "device_item_rejected";
        }
        if (handled) {
            if (action == UiAction::Up || action == UiAction::Down) {
                uiController.recordHandledAction(action);
            }
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == kPowerPage &&
        (action == UiAction::Select || action == UiAction::Right)) {
        const bool changed = performBoundedLightSleep(1000000ULL);
        lastRuntimeEvent = changed ? "power_sleep_resumed"
                                   : "power_sleep_rejected";
        uiController.recordHandledAction(action);
        return finish(changed);
    }
    if (!wasRoot && uiController.page() == 5) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up) {
            handled = true;
            changed = interfaceSettingsController.previous();
        } else if (action == UiAction::Down) {
            handled = true;
            changed = interfaceSettingsController.next();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            switch (interfaceSettingsController.selected()) {
                case InterfaceSetting::Language: {
                    const UiLanguage requested =
                        languageController.active() == UiLanguage::English
                            ? UiLanguage::Russian : UiLanguage::English;
                    const bool persisted = saveUiLanguage(requested);
                    if (persisted) languageController.restore(requested);
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "language_persisted"
                                                 : "language_persist_failed";
                    break;
                }
                case InterfaceSetting::Brightness: {
                    const std::uint8_t previous =
                        interfaceSettingsController.brightnessIndex();
                    const InterfaceTheme theme =
                        interfaceSettingsController.theme();
                    interfaceSettingsController.cycleBrightness();
                    const bool persisted = saveUiBrightnessIndex(
                        interfaceSettingsController.brightnessIndex());
                    if (!persisted) {
                        interfaceSettingsController.restore(previous, theme);
                    } else {
                        ledcWrite(BoardProfile::kBacklightPin,
                                  interfaceSettingsController.brightnessDuty());
                    }
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "brightness_persisted"
                                                 : "brightness_persist_failed";
                    break;
                }
                case InterfaceSetting::Theme: {
                    const std::uint8_t brightness =
                        interfaceSettingsController.brightnessIndex();
                    const InterfaceTheme previous =
                        interfaceSettingsController.theme();
                    interfaceSettingsController.cycleTheme();
                    const bool persisted = saveUiTheme(
                        interfaceSettingsController.theme());
                    if (!persisted) {
                        interfaceSettingsController.restore(brightness, previous);
                    } else {
                        leshy1::ui::visual::applyTheme(
                            interfaceSettingsController.theme());
                    }
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "theme_persisted"
                                                 : "theme_persist_failed";
                    break;
                }
                case InterfaceSetting::Sound:
                    changed = false;
                    lastRuntimeEvent = "sound_locked_hw_t09";
                    break;
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 6) {
        bool handled = false;
        bool changed = false;
        if (selfTestController.view() == SelfTestView::ModeMenu &&
            action == UiAction::Up) {
            handled = true;
            changed = selfTestController.previousMode();
        } else if (selfTestController.view() == SelfTestView::ModeMenu &&
                   action == UiAction::Down) {
            handled = true;
            changed = selfTestController.nextMode();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const std::uint64_t startedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const bool completesFullPlan =
                selfTestController.view() == SelfTestView::VisualCheck &&
                selfTestController.visualState() + 1U >=
                    SelfTestController::kVisualStateCount;
            if (completesFullPlan) runShieldReceiverSelfTestProbe();
            changed = selfTestController.activate(snapshotSelfTestFacts(),
                                                   startedUs);
            if (changed &&
                selfTestController.view() == SelfTestView::ActiveChecks) {
                fullGuidedRfState = {};
                fullGuidedArtifactState = {};
                fullGuidedNrf24Report = {};
                fullGuidedCc1101Report = {};
                fullGuidedRfStartAfterUs = startedUs + 500000ULL;
                lastRuntimeEvent = "self_test_active_rf_pending";
            }
            if (selfTestController.runAwaitingFinish() &&
                selfTestController.view() == SelfTestView::Result) {
                selfTestController.finishRun(
                    static_cast<std::uint64_t>(esp_timer_get_time()));
                lastRuntimeEvent = leshy1::apps::self_test::
                    selfTestResultStatusName(selfTestController.report().status);
            } else if (selfTestController.view() == SelfTestView::VisualCheck) {
                lastRuntimeEvent = "self_test_visual_check";
            } else if (selfTestController.view() ==
                       SelfTestView::ActiveChecks) {
                lastRuntimeEvent = "self_test_active_rf_pending";
            } else if (changed) {
                lastRuntimeEvent = "self_test_preflight";
            }
        } else if (action == UiAction::Back || action == UiAction::Left) {
            bool cleanupReady = true;
            if (selfTestController.view() == SelfTestView::ActiveChecks) {
                cleanupReady = cancelFullGuidedRfChecks();
            }
            changed = cleanupReady && selfTestController.back();
            handled = changed;
            if (changed) {
                lastRuntimeEvent = "self_test_modes";
            } else if (!cleanupReady) {
                handled = true;
                lastRuntimeEvent = "self_test_cancel_cleanup_failed";
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    const bool wantsLaunch = wasRoot && (action == UiAction::Select || action == UiAction::Right);
    bool openable = selected != nullptr && selected->enabled;
    LaunchStatus launchStatus = LaunchStatus::InvalidDescriptor;
    if (wantsLaunch) {
        launchStatus = selected == nullptr
                           ? LaunchStatus::InvalidDescriptor
                           : appRuntime.launch(selected->id, selected->enabled, selected->resources);
        lastRuntimeEvent = leshy1::kernel::runtime::launchStatusName(launchStatus);
        openable = launchStatus == LaunchStatus::Started;
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "language") == 0) {
            languageController.enter();
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "device") == 0) {
            deviceSelection = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "capture") == 0) {
            captureView = CaptureView::SourceMenu;
            captureSourceSelection = 0;
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            infraredCapture.reset();
            infraredReceiverReport = {};
            infraredCapturePersistState = CapturePersistState::Result;
            infraredCapturePersistStatus = "volatile";
            infraredCapturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "targets") == 0) {
            openable = loadTargetsProduct(*selected);
        }
        const bool surveyApp = selected != nullptr &&
            (std::strcmp(selected->id, "wifi") == 0 ||
             std::strcmp(selected->id, "ble") == 0);
        const bool spectrumApp = selected != nullptr &&
            (std::strcmp(selected->id, "spectrum24") == 0 ||
             std::strcmp(selected->id, "subghz") == 0);
        if (openable && selected != nullptr && (surveyApp || spectrumApp)) {
            if (rfSpectrumView != RfSpectrumView::None ||
                boardNrf24Spectrum.active() ||
                boardCc1101Spectrum.active()) {
                stopCurrentSpectrum(false);
            } else {
                nrf24SpectrumController.reset();
                nrf24SignalFinder.reset();
                nrf24SpectrumReport = {};
                cc1101SignalFinder.reset();
                cc1101SpectrumController.reset();
                cc1101SpectrumReport = {};
            }
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumSelection = 0;
            nrf24ModeSelection = 0;
            subGhzModeSelection = 0;
            subGhzCaptureModeSelection = 0;
            subGhzCaptureModulation = leshy1::domain::captures::
                SubGhzRawModulation::OokEnvelope;
            rfCcBandSelection =
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
            nextSpectrumUiRefreshUs = 0;
            if (surveyApp) {
                const bool wifiApp = std::strcmp(selected->id, "wifi") == 0;
                if (wifiApp) {
                    wifiFrameCapture.reset();
                    wifiDeviceCatalog.reset();
                    wifiDeviceNavigationOrder.reset();
                    wifiDeviceSelection = 0;
                    wifiDeviceDetail = {};
                    nextWifiDeviceUiRefreshUs = 0;
                }
                wifiProductView = wifiApp ? WifiProductView::Menu
                                          : WifiProductView::None;
                wifiProductSelection = 0;
                if (!wifiApp) {
                    bleProductView = BleProductView::None;
                    startBleDevicesProduct();
                } else {
                    bleProductView = BleProductView::None;
                }
            } else if (std::strcmp(selected->id, "spectrum24") == 0) {
                wifiProductView = WifiProductView::None;
                rfSpectrumView = RfSpectrumView::Nrf24Menu;
                lastRuntimeEvent = "nrf24_modes";
            } else {
                wifiProductView = WifiProductView::None;
                rfSpectrumKind = RfSpectrumKind::Cc1101;
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
                lastRuntimeEvent = "subghz_modes";
            }
        }
    }
    const bool changed = uiController.apply(
        action, static_cast<std::uint8_t>(appCatalog.size()), openable,
        selected == nullptr ? UiController::kRootPage : selected->page);
    if (wantsLaunch && launchStatus == LaunchStatus::Started && !changed) {
        if (selected != nullptr &&
            std::strcmp(selected->id, "targets") == 0) {
            releaseTargetsProduct();
        }
        appRuntime.stop();
        lastRuntimeEvent = "launch_rolled_back";
    } else if (!wasRoot && uiController.isRoot() && changed) {
        if (pageBefore == 7) releaseTargetsProduct();
        appRuntime.stop();
        lastRuntimeEvent = "stopped";
    }
    return finish(changed);
}

struct TouchDispatchTarget final {
    TouchTarget target{};
    std::uint8_t current = 0;
};

