anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
TouchDispatchTarget touchDispatchTarget(TouchPoint point) {
    if (uiController.isRoot()) {
        const std::uint8_t first = homeFirstVisible(uiController.selection());
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first,
                static_cast<std::uint8_t>(appCatalog.size())),
            uiController.selection(),
        };
    }
    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::Devices) {
            const std::size_t first =
                bleDeviceFirstVisible(bleDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(bleDeviceCatalog.size())),
                    static_cast<std::uint8_t>(bleDeviceSelection)};
        }
        if (wifiProductView == WifiProductView::Menu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0,
                        kWifiProductTaskCount),
                    wifiProductSelection};
        }
        if (wifiProductView == WifiProductView::Networks &&
            surveyWorkflow.state() == SurveyWorkflowState::Running) {
            const std::size_t first =
                wifiNetworkFirstVisible(wifiNetworkSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiNetworkVisibleSize())),
                    static_cast<std::uint8_t>(wifiNetworkSelection)};
        }
        if (wifiProductView == WifiProductView::Devices) {
            const std::size_t first =
                wifiDeviceFirstVisible(wifiDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiDeviceVisibleSize())),
                    static_cast<std::uint8_t>(wifiDeviceSelection)};
        }
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    rfSpectrumSelection};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    nrf24ModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point, 0, 3),
                    subGhzModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    subGhzCaptureModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0, 4),
                    ccBandSelectionIndex()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            !productSurveySourceUnavailableVisible()) {
            const bool sources = surveySourceController.view() ==
                                 SurveySetupView::Sources;
            return {leshy1::ui::hitTouchTarget(
                        sources ? TouchTargetLayout::TwoChoices
                                : TouchTargetLayout::ThreeChoices,
                        point, 0,
                        sources
                            ? static_cast<std::uint8_t>(
                                  SurveySourceController::kSourceCount)
                            : surveySourceController.planItemCount()),
                    surveySourceController.selection()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point),
                    static_cast<std::uint8_t>(surveyController.draftFilter())};
        }
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        (targetsProductRuntime->controller.view() == TargetsView::List ||
         targetsProductRuntime->controller.view() == TargetsView::Compare)) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.navigationSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        controller.navigationCount())),
                static_cast<std::uint8_t>(
                    controller.navigationSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::Actions) {
        const std::size_t first = targetsFirstVisible(
            targetsProductRuntime->controller.actionSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        TargetsController::kActionCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.actionSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationList) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.correlationSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        controller.selectedCorrelationCount())),
                static_cast<std::uint8_t>(controller.correlationSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationReview) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kCorrelationReviewControlCount)),
                static_cast<std::uint8_t>(targetsProductRuntime->controller
                                              .correlationReviewSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::NameEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kNameEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.nameEditorSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::TagList) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.tagSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(controller.tagEntryCount())),
                static_cast<std::uint8_t>(controller.tagSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::TagEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kTagEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.tagEditorSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::NotesEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kNotesEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.notesEditorSelection())};
    }
    if (uiController.page() == 4 &&
        captureView == CaptureView::SourceMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                captureSourceSelection};
    }
    if (uiController.page() == 5) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                languageController.selection()};
    }
    if (uiController.page() == kDevicePage) {
        const std::uint8_t first = deviceFirstVisible(deviceSelection);
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first, kDeviceItemCount),
            deviceSelection,
        };
    }
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                selfTestController.selection()};
    }
    return {};
}

bool dispatchTouchPoint(TouchPoint point, bool synthetic = false) {
    lastTouchPoint = point;
    lastTouchChanged = false;
    if (synthetic) ++syntheticTouchPresses;
    const TouchDispatchTarget dispatch = touchDispatchTarget(point);
    if (!dispatch.target.hit) {
        ++touchMissedPresses;
        return false;
    }

    ++touchHandledPresses;
    std::uint8_t current = dispatch.current;
    bool changed = false;
    while (current > dispatch.target.index) {
        if (!applyUiAction(UiAction::Up, false)) break;
        --current;
        changed = true;
    }
    while (current < dispatch.target.index) {
        if (!applyUiAction(UiAction::Down, false)) break;
        ++current;
        changed = true;
    }
    if (current == dispatch.target.index) {
        changed = applyUiAction(UiAction::Select, false) || changed;
    }
    lastTouchChanged = changed;
    if (changed) renderInteractiveScreen(true);
    return changed;
}

