anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitStorageMountPolicy(Stream& reply) {
    leshy1::storage::ReadOnlyMountRequest actual;
    actual.explicitlySelected = false;
    actual.driverReadOnlyGuaranteed = BoardStorageAdapter::kDriverReadOnlyGuaranteed;
    actual.formatRequested = false;
    actual.ownedResources = 0;
    actual.conflictingOwner = false;
    const leshy1::storage::ReadOnlyMountPermit actualPermit =
        leshy1::storage::authorizeReadOnlyMountAttempt(storageDiscovery, actual);
    leshy1::storage::ReadOnlyMountRequest ifSelected = actual;
    ifSelected.explicitlySelected = true;
    const leshy1::storage::ReadOnlyMountPermit selectedPermit =
        leshy1::storage::authorizeReadOnlyMountAttempt(storageDiscovery, ifSelected);
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.mount.policy.v1\",\"kind\":\"report\","
        "\"driver\":\"arduino_sdfs\",\"driver_read_only_guaranteed\":%s,"
        "\"explicitly_selected\":false,\"actual_status\":\"%s\","
        "\"if_selected_status\":\"%s\",\"format_requested\":false,"
        "\"required_resources\":%lu,\"owned_resources\":0,"
        "\"mount_attempted\":%s,\"execution_enabled\":false,"
        "\"write_enabled\":false,\"guard_required\":true}",
        BoardStorageAdapter::kDriverReadOnlyGuaranteed ? "true" : "false",
        leshy1::storage::readOnlyMountStatusName(actualPermit.status),
        leshy1::storage::readOnlyMountStatusName(selectedPermit.status),
        static_cast<unsigned long>(actualPermit.requiredResources),
        storageDiscovery.mountAttempted ? "true" : "false");
    reply.println(line);
}

void emitProductSurveyAdmission(Stream& reply) {
    leshy1::storage::MediaIdentity media;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::RecoverCatalog;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.driverReadOnlyGuaranteed =
        BoardStorageAdapter::kDriverReadOnlyGuaranteed;
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);

    leshy1::apps::survey::ProductSurveyRequest surveyRequest;
    surveyRequest.explicitStart = false;
    surveyRequest.sourceAvailable = false;
    surveyRequest.scanPlan = leshy1::drivers::wifi::defaultPassivePlan();
    surveyRequest.storePermit = storePermit;
    const leshy1::apps::survey::ProductSurveyPermit surveyPermit =
        leshy1::apps::survey::authorizeProductSurvey(surveyRequest);

    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.product_admission.v1\","
        "\"kind\":\"policy_state\",\"status\":\"%s\","
        "\"store_status\":\"%s\",\"store_operation\":\"%s\","
        "\"store_root\":\"%s\",\"required_resources\":%lu,"
        "\"explicit_start\":false,\"passive_only\":true,"
        "\"persistent_required\":true,\"simulated_fallback\":false,"
        "\"hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"format_allowed\":false,"
        "\"application_connect_calls\":0,"
        "\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_instrumented\":false}",
        leshy1::apps::survey::productSurveyAdmissionStatusName(
            surveyPermit.status),
        leshy1::storage::productStoreAccessStatusName(storePermit.status),
        leshy1::storage::productStoreOperationName(storePermit.operation),
        leshy1::storage::kProductSessionStoreRoot,
        static_cast<unsigned long>(surveyPermit.requiredResources));
    reply.println(line);
}

void emitProductSurveySourceUnavailableTest(Stream& reply,
                                            const char* command) {
    const bool arm = std::strcmp(
        command, "survey.product.test-source-unavailable once") == 0;
    const bool clear = std::strcmp(
        command, "survey.product.test-source-unavailable clear") == 0;
    const bool safeState = productSurveyControl() ==
            ProductSurveyWorkerControl::Idle &&
        uiController.isRoot() && !appRuntime.running();
    const char* status = "invalid_request";
    if (clear && productSurveyControl() == ProductSurveyWorkerControl::Idle) {
        setProductSurveySourceUnavailableInjection(false);
        status = "cleared";
    } else if (arm && safeState) {
        setProductSurveySourceUnavailableInjection(true);
        status = "armed";
    } else if (arm) {
        status = "unsafe_state";
    }
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.source_unavailable_test.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"one_shot\":true,"
        "\"armed\":%s,\"worker_idle\":%s,\"ui_home\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"hardware_touched\":false,\"source_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false}",
        status,
        productSurveySourceUnavailableInjectionArmed() ? "true" : "false",
        productSurveyControl() == ProductSurveyWorkerControl::Idle
            ? "true" : "false",
        uiController.isRoot() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitProductSurveyRuntimeUnavailableTest(Stream& reply,
                                             const char* command) {
    const bool wifi = std::strcmp(
        command, "survey.product.test-runtime-unavailable wifi") == 0;
    const bool ble = std::strcmp(
        command, "survey.product.test-runtime-unavailable ble") == 0;
    const bool clear = std::strcmp(
        command, "survey.product.test-runtime-unavailable clear") == 0;
    const bool safeState = productSurveyControl() ==
            ProductSurveyWorkerControl::Idle &&
        uiController.isRoot() && !appRuntime.running();
    const char* status = "invalid_request";
    if (clear && productSurveyControl() == ProductSurveyWorkerControl::Idle) {
        setProductSurveyRuntimeUnavailableInjection(0);
        status = "cleared";
    } else if ((wifi || ble) && safeState) {
        setProductSurveyRuntimeUnavailableInjection(
            leshy1::services::survey::sourceMask(
                wifi ? RadioKind::Wifi : RadioKind::Ble));
        status = "armed";
    } else if (wifi || ble) {
        status = "unsafe_state";
    }
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.runtime_unavailable_test.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"one_shot\":true,"
        "\"armed_mask\":%u,\"worker_idle\":%s,\"ui_home\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"hardware_touched\":false,\"storage_mounted\":false,"
        "\"storage_written\":false}",
        status,
        static_cast<unsigned>(productSurveyRuntimeUnavailableInjectionMask()),
        productSurveyControl() == ProductSurveyWorkerControl::Idle
            ? "true" : "false",
        uiController.isRoot() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitSdReadOnlyProtocol(Stream& reply) {
    auto& line = diagnosticJson;
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    if (leshy1::storage::formatSdReadOnlyProtocolJson(plan, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.storage.sd.protocol.v1\",\"kind\":\"report\","
        "\"status\":\"invalid_plan\",\"write_commands\":false,"
        "\"execution_enabled\":false}");
}

void emitSdIdentificationFixture(Stream& reply) {
    auto& line = diagnosticJson;
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    const leshy1::storage::SdIdentificationTranscript transcript =
        leshy1::storage::goldenSdIdentificationTranscript();
    leshy1::storage::SdIdentity identity;
    const leshy1::storage::SdIdentificationStatus status =
        leshy1::storage::parseSdIdentification(plan, transcript, &identity);
    if (status == leshy1::storage::SdIdentificationStatus::Valid &&
        leshy1::storage::formatSdIdentificationJson(identity, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.identification.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"transport\":\"golden_fake\","
        "\"physical_spi_executed\":false,\"commands_executed\":0,"
        "\"write_commands\":false,\"radio_touched\":false}",
        leshy1::storage::sdIdentificationStatusName(status));
    reply.println(line);
}

void emitSdTransportFixture(Stream& reply) {
    auto& line = diagnosticJson;
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    leshy1::storage::GoldenFakeSdTransport transport;
    const leshy1::storage::SdTransportRunResult result =
        leshy1::storage::runSdIdentificationStateMachine(plan, transport);
    if (leshy1::storage::formatSdTransportRunJson(result, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.transport.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"transport\":\"golden_fake\","
        "\"physical_spi_executed\":false,\"commands_attempted\":%u,"
        "\"commands_completed\":%u,\"write_commands\":false,"
        "\"radio_touched\":false}",
        leshy1::storage::sdTransportRunStatusName(result.status),
        static_cast<unsigned>(result.commandsAttempted),
        static_cast<unsigned>(result.commandsCompleted));
    reply.println(line);
}

void emitSdWireContract(Stream& reply) {
    auto& line = diagnosticJson;
    if (leshy1::storage::formatSdWireContractJson(line, sizeof(line))) {
        reply.println(line);
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.storage.sd.wire.v1\",\"kind\":\"report\","
        "\"status\":\"invalid_contract\",\"execution_enabled\":false,"
        "\"physical_spi_executed\":false,\"commands_executed\":0,"
        "\"write_commands\":false,\"radio_touched\":false}");
}

void emitPhysicalSdIdentification(Stream& reply) {
    auto& line = diagnosticJson;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& csdHex = sdPhysicalEvidence.summaryA;
    cidHex[0] = '\0';
    csdHex[0] = '\0';

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult result;
    if (!idleUi) {
        result.status = leshy1::storage::SdTransportRunStatus::ResourceConflict;
    } else if (!resourcesAcquired) {
        result.status = leshy1::storage::SdTransportRunStatus::ResourcesMissing;
    } else if (!adapterBegun) {
        result.status = leshy1::storage::SdTransportRunStatus::ExchangeFailed;
        result.physicalTransport = transport.physicalSpiStarted();
    } else {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        result = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport, policy);
        transport.end();
    }
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

