anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    BoardWifiPassiveScanner scanner;
    const bool scannerBegun = resourcesAcquired && scanner.begin();
    const bool nvsDisabled = scanner.nvsDisabled();
    const bool volatileStorageOnly = scanner.volatileStorageOnly();
    BoardWifiPassiveScanResult lastScan;
    unsigned samplesCompleted = 0;
    std::uint64_t recordsReported = 0;
    std::uint64_t recordsRead = 0;
    std::uint64_t observationsAccepted = 0;
    std::uint64_t observationsRejected = 0;
    std::uint64_t observationsDropped = 0;
    std::uint64_t storageWireBytes = 0;
    std::uint64_t totalScanUs = 0;
    SurveySession& measurementSession =
        sessionStoreWorkspace.validationSession;
    WifiIngressSinkContext sink{&measurementSession};

    if (scannerBegun) {
        for (unsigned sample = 0; sample < samplesRequested; ++sample) {
            measurementSession.reset();
            std::uint64_t sessionStartUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            if (sessionStartUs == 0) sessionStartUs = 1;
            if (measurementSession.start("wifi-ingress-measure", sessionStartUs) !=
                SessionStatus::Started) {
                break;
            }
            lastScan = scanner.scan(plan, collectWifiIngressRecord, &sink);
            std::uint64_t sessionStopUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            if (sessionStopUs < sessionStartUs) sessionStopUs = sessionStartUs;
            if (!lastScan.valid() || lastScan.durationUs == 0 ||
                measurementSession.stop(sessionStopUs) != SessionStatus::Stopped) {
                break;
            }
            std::size_t segmentSize = 0;
            if (leshy1::storage::encodeObservationSegment(
                    measurementSession, sessionStoreWorkspace.segment.data(),
                    sessionStoreWorkspace.segment.size(), &segmentSize) !=
                    leshy1::storage::SessionCodecStatus::Valid ||
                segmentSize == 0) {
                break;
            }
            rates[samplesCompleted] =
                (static_cast<std::uint64_t>(segmentSize) * 1000000ULL) /
                lastScan.durationUs;
            if (rates[samplesCompleted] == 0) rates[samplesCompleted] = 1;
            ++samplesCompleted;
            recordsReported += lastScan.recordsReported;
            recordsRead += lastScan.recordsRead;
            observationsAccepted += lastScan.accepted;
            observationsRejected += lastScan.rejected;
            observationsDropped += lastScan.dropped;
            storageWireBytes += segmentSize;
            totalScanUs += lastScan.durationUs;
        }
    }

    const leshy1::services::survey::IngressRateSummary summary =
        leshy1::services::survey::summarizeIngressRates(
            rates.data(), samplesCompleted);
    measurementSession.reset();
    sessionStoreWorkspace.segment.fill(0);
    const bool scannerEnded = scanner.end();
    resourceBroker.releaseAll(kWifiIngressOwner);
    const std::uint32_t ownedAfter = resourceBroker.ownedBy(kWifiIngressOwner);
    const bool cleanupComplete = scannerEnded && scanner.cleanupComplete() &&
        ownedAfter == 0;
    const bool valid = idleUi && resourcesAcquired && scannerBegun &&
        nvsDisabled && volatileStorageOnly && summary.valid &&
        samplesCompleted == samplesRequested && cleanupComplete;
    const std::uint64_t aggregateBytesPerSecond =
        totalScanUs == 0 ? 0 : (storageWireBytes * 1000000ULL) / totalScanUs;
    const std::uint64_t requiredStorageBytesPerSecond =
        summary.valid ? summary.p99BytesPerSecond * 4ULL : 0;
    const std::uint32_t heapFreeAfter = ESP.getFreeHeap();

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.survey.wifi_passive_ingress.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"explicit_passive_only\":true,\"plan_valid\":%s,"
        "\"scan_type\":\"passive\",\"channel\":%u,"
        "\"dwell_ms_per_channel\":%lu,\"show_hidden\":%s,"
        "\"ssid_filter\":false,\"bssid_filter\":false,"
        "\"nvs_enabled\":false,\"config_storage\":\"ram\","
        "\"credentials_loaded\":false,\"active_probe_allowed\":false,"
        "\"application_connect_calls\":0,\"application_raw_tx_calls\":0,"
        "\"physical_tx_instrumented\":false,"
        "\"physical_no_tx_verified\":false,"
        "\"samples_requested\":%u,\"samples_completed\":%u,"
        "\"records_reported\":%llu,\"records_read\":%llu,"
        "\"observations_accepted\":%llu,"
        "\"observations_rejected\":%llu,"
        "\"observations_dropped\":%llu,"
        "\"observation_capacity_per_sample\":%u,"
        "\"storage_wire_bytes\":%llu,\"scan_total_us\":%llu,"
        "\"aggregate_bytes_per_second\":%llu,"
        "\"rate_min_bytes_per_second\":%llu,"
        "\"rate_p50_bytes_per_second\":%llu,"
        "\"rate_p95_bytes_per_second\":%llu,"
        "\"rate_p99_bytes_per_second\":%llu,"
        "\"rate_max_bytes_per_second\":%llu,"
        "\"required_storage_bytes_per_second_4x_p99\":%llu,"
        "\"last_scan_status\":\"%s\",\"driver_error\":%d,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,"
        "\"owned_after\":%lu,\"cleanup_complete\":%s,"
        "\"heap_free_before\":%lu,\"heap_free_after\":%lu,"
        "\"heap_min_free\":%lu,\"storage_written\":false,"
        "\"user_identifiers_emitted\":false,"
        "\"user_identifiers_retained\":false,"
        "\"external_radio_tx_paths_held_inactive\":true}",
        valid ? "valid" : "failed", planValid ? "true" : "false",
        static_cast<unsigned>(plan.channel),
        static_cast<unsigned long>(plan.maxMsPerChannel),
        plan.showHidden ? "true" : "false", samplesRequested,
        samplesCompleted, static_cast<unsigned long long>(recordsReported),
        static_cast<unsigned long long>(recordsRead),
        static_cast<unsigned long long>(observationsAccepted),
        static_cast<unsigned long long>(observationsRejected),
        static_cast<unsigned long long>(observationsDropped),
        static_cast<unsigned>(SurveySession::kObservationCapacity),
        static_cast<unsigned long long>(storageWireBytes),
        static_cast<unsigned long long>(totalScanUs),
        static_cast<unsigned long long>(aggregateBytesPerSecond),
        static_cast<unsigned long long>(summary.minimumBytesPerSecond),
        static_cast<unsigned long long>(summary.p50BytesPerSecond),
        static_cast<unsigned long long>(summary.p95BytesPerSecond),
        static_cast<unsigned long long>(summary.p99BytesPerSecond),
        static_cast<unsigned long long>(summary.maximumBytesPerSecond),
        static_cast<unsigned long long>(requiredStorageBytesPerSecond),
        leshy1::platform::arduino::boardWifiScanStatusName(lastScan.status),
        lastScan.driverError != 0 ? lastScan.driverError : scanner.lastError(),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(heapFreeBefore),
        static_cast<unsigned long>(heapFreeAfter),
        static_cast<unsigned long>(ESP.getMinFreeHeap()));
    reply.println(line);
}

void emitSurveyContract(Stream& reply) {
    const leshy1::drivers::wifi::WifiScanPlan plan =
        leshy1::drivers::wifi::defaultPassivePlan();
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.contract.v1\",\"kind\":\"contract\","
        "\"source\":\"wifi\",\"passive_only\":%s,\"active_probe_allowed\":%s,"
        "\"directed_ssid\":false,\"plan_valid\":%s,\"driver_started\":%s,"
        "\"observation_capacity\":%u,\"radio_touched\":false,"
        "\"golden_demo_ready\":%s,\"golden_observations\":%u}",
        plan.passive ? "true" : "false",
        leshy1::drivers::wifi::kActiveProbeAllowed ? "true" : "false",
        leshy1::drivers::wifi::validatePassivePlan(plan) ? "true" : "false",
        leshy1::drivers::wifi::kDriverStartedInMeasureTarget ? "true" : "false",
        static_cast<unsigned>(leshy1::services::survey::SurveySession::kObservationCapacity),
        surveyDemoReady ? "true" : "false", static_cast<unsigned>(surveySession.size()));
    reply.println(line);
}

