anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitSessionFixture(Stream& reply) {
    if (surveySession.state() != SessionState::Stopped) {
        reply.println("{\"schema\":\"leshy.session.fixture.v1\",\"kind\":\"result\","
                      "\"status\":\"not_stopped\",\"storage_written\":false,"
                      "\"radio_touched\":false}");
        return;
    }
    auto& summary = sdPhysicalEvidence.summaryA;
    auto& segment = sessionStoreWorkspace.segment;
    auto& manifest = sessionStoreWorkspace.manifest;
    SurveySession& reopened = sessionStoreWorkspace.validationSession;
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    leshy1::storage::SessionCodecStatus status = leshy1::storage::encodeObservationSegment(
        surveySession, segment.data(), segment.size(), &segmentSize);
    if (status == leshy1::storage::SessionCodecStatus::Valid) {
        status = leshy1::storage::encodeSessionManifest(
            surveySession, segment.data(), segmentSize, manifest.data(), manifest.size(),
            &manifestSize);
    }
    const std::uint32_t manifestCrc =
        leshy1::storage::crc32c(manifest.data(), manifestSize);
    const std::uint32_t segmentCrc = leshy1::storage::crc32c(segment.data(), segmentSize);
    std::uint8_t headWire[leshy1::storage::kHeadWireSize] = {};
    const leshy1::storage::HeadRecord head{
        1, static_cast<std::uint32_t>(manifestSize), manifestCrc};
    bool headSelected = false;
    if (status == leshy1::storage::SessionCodecStatus::Valid &&
        leshy1::storage::encodeHead(head, headWire, sizeof(headWire))) {
        const leshy1::storage::RecoveryResult recovery = leshy1::storage::recoverHead(
            {headWire, sizeof(headWire),
             {true, static_cast<std::uint32_t>(manifestSize), manifestCrc}},
            {});
        headSelected = recovery.choice == leshy1::storage::RecoveryChoice::A;
        if (!headSelected) status = leshy1::storage::SessionCodecStatus::ChecksumMismatch;
    }
    if (status == leshy1::storage::SessionCodecStatus::Valid) {
        status = leshy1::storage::reopenSession(manifest.data(), manifestSize, segment.data(),
                                                segmentSize, &reopened);
    }
    const bool summaryReady = status == leshy1::storage::SessionCodecStatus::Valid &&
                              leshy1::storage::formatSessionJsonSummary(
                                  reopened, summary, sizeof(summary));
    if (!summaryReady && status == leshy1::storage::SessionCodecStatus::Valid) {
        status = leshy1::storage::SessionCodecStatus::BufferTooSmall;
    }

    char line[1280] = {};
    if (status == leshy1::storage::SessionCodecStatus::Valid) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.session.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"valid\",\"storage_written\":false,"
            "\"head_selected\":%s,\"manifest_bytes\":%u,\"manifest_crc32c\":%lu,"
            "\"segment_bytes\":%u,\"segment_crc32c\":%lu,"
            "\"reopened_observations\":%u,\"radio_touched\":false,\"summary\":%s}",
            headSelected ? "true" : "false", static_cast<unsigned>(manifestSize),
            static_cast<unsigned long>(manifestCrc), static_cast<unsigned>(segmentSize),
            static_cast<unsigned long>(segmentCrc), static_cast<unsigned>(reopened.size()),
            summary);
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.session.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"%s\",\"storage_written\":false,\"radio_touched\":false}",
            leshy1::storage::sessionCodecStatusName(status));
    }
    reply.println(line);
}

void emitSessionStoreFixture(Stream& reply) {
    if (surveySession.state() != SessionState::Stopped) {
        reply.println(
            "{\"schema\":\"leshy.session.store.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"not_stopped\",\"physical_storage_written\":false,"
            "\"radio_touched\":false}");
        return;
    }
    ramSessionStore.reset();
    const leshy1::storage::SessionStoreCommitResult first =
        leshy1::storage::commitNextSession(ramSessionStore, sessionStoreWorkspace,
                                           surveySession);
    const leshy1::storage::SessionStoreCommitResult second =
        leshy1::storage::commitNextSession(ramSessionStore, sessionStoreWorkspace,
                                           surveySession);
    SurveySession& reopened = sessionStoreWorkspace.validationSession;
    const leshy1::storage::SessionStoreRecoveryResult newest =
        leshy1::storage::recoverSession(ramSessionStore, sessionStoreWorkspace, &reopened);
    auto& summary = sdPhysicalEvidence.summaryA;
    const bool summaryReady = newest.valid() &&
                              leshy1::storage::formatSessionJsonSummary(
                                  reopened, summary, sizeof(summary));
    const bool corrupted = ramSessionStore.flipSegmentByte(2, 0);
    const leshy1::storage::SessionStoreRecoveryResult fallback =
        leshy1::storage::recoverSession(ramSessionStore, sessionStoreWorkspace, &reopened);
    const bool restored = ramSessionStore.flipSegmentByte(2, 0);
    const bool valid = first.complete() && first.generation == 1 &&
                       first.publishedSlot == leshy1::storage::HeadSlot::A &&
                       second.complete() && second.generation == 2 &&
                       second.publishedSlot == leshy1::storage::HeadSlot::B &&
                       newest.valid() && newest.generation == 2 && newest.observations == 3 &&
                       summaryReady && corrupted && fallback.valid() &&
                       fallback.generation == 1 && fallback.observations == 3 &&
                       fallback.bStatus == leshy1::storage::CandidateStatus::InvalidPayload &&
                       restored;

    char line[1024] = {};
    if (valid) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.session.store.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"valid\",\"backend\":\"bounded_ram\","
            "\"persistent\":false,\"physical_storage_written\":false,"
            "\"first_generation\":%lu,\"first_slot\":\"a\","
            "\"second_generation\":%lu,\"second_slot\":\"b\","
            "\"recovered_generation\":%lu,\"reopened_observations\":%u,"
            "\"corrupt_new_status\":\"invalid_payload\","
            "\"fallback_generation\":%lu,\"fallback_observations\":%u,"
            "\"file_syncs\":%u,\"directory_syncs\":%u,"
            "\"radio_touched\":false,\"summary\":%s}",
            static_cast<unsigned long>(first.generation),
            static_cast<unsigned long>(second.generation),
            static_cast<unsigned long>(newest.generation),
            static_cast<unsigned>(newest.observations),
            static_cast<unsigned long>(fallback.generation),
            static_cast<unsigned>(fallback.observations),
            static_cast<unsigned>(ramSessionStore.fileSyncs()),
            static_cast<unsigned>(ramSessionStore.directorySyncs()), summary);
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.session.store.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"failed\",\"first\":\"%s\",\"second\":\"%s\","
            "\"newest\":\"%s\",\"fallback\":\"%s\","
            "\"physical_storage_written\":false,\"radio_touched\":false}",
            leshy1::storage::sessionStoreStatusName(first.status),
            leshy1::storage::sessionStoreStatusName(second.status),
            leshy1::storage::sessionStoreStatusName(newest.status),
            leshy1::storage::sessionStoreStatusName(fallback.status));
    }
    reply.println(line);
}

void emitLibraryFixture(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    auto& summary = sdPhysicalEvidence.summaryA;
    const bool valid = libraryDemoReady && entry != nullptr && entry->session != nullptr &&
                       leshy1::storage::formatSessionJsonSummary(
                           *entry->session, summary, sizeof(summary));
    char line[1280] = {};
    if (valid) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.library.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"valid\",\"entries\":%u,\"generation\":%lu,"
            "\"integrity\":\"%s\",\"simulated\":%s,\"persistent\":%s,"
            "\"storage_backend\":\"%s\",\"storage_lease_required\":%s,"
            "\"radio_touched\":false,\"summary\":%s}",
            static_cast<unsigned>(libraryController.size()),
            static_cast<unsigned long>(entry->generation),
            leshy1::apps::library::sessionIntegrityName(entry->integrity),
            entry->simulated ? "true" : "false",
            entry->persistent ? "true" : "false",
            entry->persistent ? "persistent_media" : "bounded_ram",
            entry->persistent ? "true" : "false", summary);
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.library.fixture.v1\",\"kind\":\"result\","
            "\"status\":\"unavailable\",\"simulated\":false,\"persistent\":false,"
            "\"radio_touched\":false}");
    }
    reply.println(line);
}

void emitLibraryExport(Stream& reply) {
    auto& artifact = diagnosticJson;
    if (libraryController.view() != LibraryView::ExportReady) {
        reply.println(
            "{\"schema\":\"leshy.library.export.v1\",\"kind\":\"artifact\","
            "\"status\":\"not_requested\",\"persistent\":false,"
            "\"transport\":\"serial_ndjson\",\"radio_touched\":false}");
        return;
    }
    const leshy1::apps::library::LibraryExportResult result =
        libraryController.formatSelectedJsonExport(artifact, sizeof(artifact));
    if (result.valid()) {
        reply.println(artifact);
        return;
    }
    char line[256] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.library.export.v1\",\"kind\":\"artifact\","
        "\"status\":\"%s\",\"persistent\":false,"
        "\"transport\":\"serial_ndjson\",\"radio_touched\":false}",
        leshy1::apps::library::libraryExportStatusName(result.status));
    reply.println(line);
}

void emitLibraryCaptureMetadata(Stream& reply) {
    if (libraryController.view() != LibraryView::ExportReady) {
        reply.println(
            "{\"schema\":\"leshy.capture.metadata.v1\",\"kind\":\"capture\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const auto result = libraryController.formatSelectedCaptureMetadata(
        diagnosticJson, sizeof(diagnosticJson));
    if (result.valid()) {
        reply.println(diagnosticJson);
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.capture.metadata.v1\",\"kind\":\"capture\","
        "\"status\":\"%s\",\"radio_touched\":false}",
        leshy1::apps::library::libraryExportStatusName(result.status));
    reply.println(diagnosticJson);
}

