anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitLibraryCsvExport(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    if (libraryController.view() != LibraryView::ExportReady || entry == nullptr ||
        entry->session == nullptr) {
        reply.println(
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const auto& capture = entry->session->captureMetadata();
    if (capture.subGhzRawCaptured) {
        if (entry->generation != sessionStoreWorkspace.generation) {
            reply.println(
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"generation_not_loaded\","
                "\"radio_touched\":false}");
            return;
        }
        leshy1::storage::PersistedSubGhzRawCaptureView persisted;
        const auto opened =
            leshy1::storage::openPersistedSubGhzRawCapture(
                *entry->session, sessionStoreWorkspace.segment.data(),
                sessionStoreWorkspace.segmentSize, &persisted);
        if (opened != leshy1::storage::SessionCodecStatus::Valid) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"%s\",\"radio_touched\":false}",
                leshy1::storage::sessionCodecStatusName(opened));
            reply.println(diagnosticJson);
            return;
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"valid\",\"format\":\"subghz_raw_pulses\","
            "\"generation\":%lu,\"session_id\":\"%s\","
            "\"records\":%u,\"columns\":3,\"line_endings\":\"crlf\","
            "\"radio_touched\":false}",
            static_cast<unsigned long>(entry->generation),
            entry->session->id(),
            static_cast<unsigned>(persisted.pulseCount()));
        reply.println(diagnosticJson);
        reply.flush();
        char row[64] = {};
        const auto header =
            leshy1::apps::capture::formatSubGhzRawCsvHeader(
                row, sizeof(row));
        bool valid = header.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(row),
                        header.bytes) == header.bytes;
        std::size_t bytes = valid ? header.bytes : 0U;
        std::size_t records = 0;
        for (std::size_t index = 0;
             valid && index < persisted.pulseCount(); ++index) {
            const auto formatted =
                leshy1::apps::capture::formatSubGhzRawCsvRow(
                    persisted, index, capture.subGhzStartLevel,
                    row, sizeof(row));
            valid = formatted.valid &&
                reply.write(reinterpret_cast<const std::uint8_t*>(row),
                            formatted.bytes) == formatted.bytes;
            if (valid) {
                bytes += formatted.bytes;
                ++records;
            }
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
            "\"status\":\"%s\",\"format\":\"subghz_raw_pulses\","
            "\"records\":%u,\"bytes\":%u,"
            "\"persistent\":true,\"radio_touched\":false}",
            valid ? "complete" : "stream_failed",
            static_cast<unsigned>(records),
            static_cast<unsigned>(bytes));
        reply.println(diagnosticJson);
        reply.flush();
        return;
    }
    if (capture.infraredRawCaptured) {
        if (entry->generation != sessionStoreWorkspace.generation) {
            reply.println(
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"generation_not_loaded\","
                "\"radio_touched\":false}");
            return;
        }
        leshy1::storage::PersistedInfraredRawCaptureView persisted;
        const auto opened = leshy1::storage::openPersistedInfraredRawCapture(
            *entry->session, sessionStoreWorkspace.segment.data(),
            sessionStoreWorkspace.segmentSize, &persisted);
        if (opened != leshy1::storage::SessionCodecStatus::Valid) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"%s\",\"radio_touched\":false}",
                leshy1::storage::sessionCodecStatusName(opened));
            reply.println(diagnosticJson);
            return;
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"valid\",\"format\":\"infrared_raw_pulses\","
            "\"generation\":%lu,\"session_id\":\"%s\","
            "\"records\":%u,\"columns\":3,\"line_endings\":\"crlf\","
            "\"radio_touched\":false}",
            static_cast<unsigned long>(entry->generation),
            entry->session->id(),
            static_cast<unsigned>(persisted.pulseCount()));
        reply.println(diagnosticJson);
        reply.flush();
        char row[64] = {};
        const auto header = leshy1::apps::capture::formatInfraredCsvHeader(
            row, sizeof(row));
        bool valid = header.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(row),
                        header.bytes) == header.bytes;
        std::size_t bytes = valid ? header.bytes : 0U;
        std::size_t records = 0;
        for (std::size_t index = 0;
             valid && index < persisted.pulseCount(); ++index) {
            const auto formatted =
                leshy1::apps::capture::formatInfraredCsvRow(
                    persisted, index, capture.infraredStartLevel,
                    row, sizeof(row));
            valid = formatted.valid &&
                reply.write(reinterpret_cast<const std::uint8_t*>(row),
                            formatted.bytes) == formatted.bytes;
            if (valid) {
                bytes += formatted.bytes;
                ++records;
            }
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
            "\"status\":\"%s\",\"format\":\"infrared_raw_pulses\","
            "\"records\":%u,\"bytes\":%u,"
            "\"persistent\":true,\"radio_touched\":false}",
            valid ? "complete" : "stream_failed",
            static_cast<unsigned>(records), static_cast<unsigned>(bytes));
        reply.println(diagnosticJson);
        reply.flush();
        return;
    }
    char row[256] = {};
    const auto header = libraryController.formatSelectedCsvHeader(
        row, sizeof(row));
    if (!header.valid()) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"%s\",\"radio_touched\":false}",
            leshy1::apps::library::libraryExportStatusName(header.status));
        reply.println(diagnosticJson);
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"records\":%u,\"columns\":9,\"line_endings\":\"crlf\","
        "\"identity_encoding\":\"lower_hex\",\"label_encoding\":\"lower_hex\","
        "\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(entry->session->size()));
    reply.println(diagnosticJson);
    reply.print(row);
    std::size_t bytes = header.bytes;
    std::size_t records = 0;
    for (std::size_t index = 0; index < entry->session->size(); ++index) {
        const auto formatted = libraryController.formatSelectedCsvRow(
            index, row, sizeof(row));
        if (!formatted.valid()) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
                "\"status\":\"%s\",\"records\":%u,\"bytes\":%u,"
                "\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(formatted.status),
                static_cast<unsigned>(records), static_cast<unsigned>(bytes));
            reply.println(diagnosticJson);
            return;
        }
        reply.print(row);
        bytes += formatted.bytes;
        ++records;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
        "\"status\":\"complete\",\"records\":%u,\"bytes\":%u,"
        "\"radio_touched\":false}",
        static_cast<unsigned>(records), static_cast<unsigned>(bytes));
    reply.println(diagnosticJson);
}

void emitLibraryPcapStatus(Stream& reply) {
    if (libraryController.view() != LibraryView::ExportReady) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const LibraryEntry* entry = libraryController.selected();
    if (entry == nullptr || entry->session == nullptr ||
        !entry->session->captureMetadata().framePayloadCaptured) {
        const auto result = libraryController.formatSelectedPcapStatus(
            diagnosticJson, sizeof(diagnosticJson));
        if (result.valid()) {
            reply.println(diagnosticJson);
        } else {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
                "\"status\":\"%s\",\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(result.status));
            reply.println(diagnosticJson);
        }
        return;
    }
    if (entry->generation != sessionStoreWorkspace.generation) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"generation_not_loaded\",\"radio_touched\":false}");
        return;
    }
    leshy1::storage::PersistedWifiFrameCaptureView persisted;
    const auto opened = leshy1::storage::openPersistedWifiFrameCapture(
        *entry->session, sessionStoreWorkspace.segment.data(),
        sessionStoreWorkspace.segmentSize, &persisted);
    if (opened != leshy1::storage::SessionCodecStatus::Valid) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"%s\",\"radio_touched\":false}",
            leshy1::storage::sessionCodecStatusName(opened));
        reply.println(diagnosticJson);
        return;
    }
    const auto& source = static_cast<
        const leshy1::domain::captures::WifiFrameSource&>(persisted);
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(source);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"persistent\":true,\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(expected),
        static_cast<unsigned>(persisted.frameCount()));
    reply.println(diagnosticJson);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult pcap = leshy1::apps::capture::writeRadiotapPcap(
        source, writePcapBytes, &sink);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"persistent\":true,\"radio_touched\":false}",
        pcap.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(pcap.bytesWritten),
        static_cast<unsigned>(pcap.framesWritten));
    reply.println(diagnosticJson);
    reply.flush();
}

void emitHilSessionBegin(Stream& reply, const char* command) {
    constexpr const char* prefix = "hil.begin ";
    const char* arguments = command + std::strlen(prefix);
    const char* separator = std::strchr(arguments, ' ');
    char sessionId[HilSession::kSessionIdLength + 1] = {};
    char candidateIdentity[HilSession::kAppIdentityLength + 1] = {};
    HilSessionStatus status = HilSessionStatus::InvalidSessionId;
    if (separator != nullptr &&
        static_cast<std::size_t>(separator - arguments) ==
            HilSession::kSessionIdLength &&
        std::strlen(separator + 1) == HilSession::kAppIdentityLength) {
        std::memcpy(sessionId, arguments, HilSession::kSessionIdLength);
        std::memcpy(candidateIdentity, separator + 1,
                    HilSession::kAppIdentityLength + 1);
        status = hilSession.begin(sessionId, candidateIdentity,
                                  runningAppElfSha256);
    }
    char line[384] = {};
    if (status == HilSessionStatus::Begun) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"begun\","
            "\"status\":\"begun\",\"session_id\":\"%s\",\"active\":true,"
            "\"app_elf_sha256\":\"%s\",\"firmware_version\":\"%s\","
            "\"ui_revision\":%lu}",
            hilSession.id(), runningAppElfSha256, LESHY1_VERSION,
            static_cast<unsigned long>(uiController.revision()));
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"error\","
            "\"operation\":\"begin\",\"status\":\"%s\",\"active\":%s}",
            leshy1::services::diagnostics::hilSessionStatusName(status),
            hilSession.active() ? "true" : "false");
    }
    reply.println(line);
}

void emitHilSessionEnd(Stream& reply, const char* command) {
    constexpr const char* prefix = "hil.end ";
    const char* sessionId = command + std::strlen(prefix);
    const HilSessionStatus status = hilSession.end(sessionId);
    char line[256] = {};
    if (status == HilSessionStatus::Ended) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"ended\","
            "\"status\":\"ended\",\"session_id\":\"%s\",\"active\":false,"
            "\"app_elf_sha256\":\"%s\",\"ui_revision\":%lu}",
            hilSession.id(), runningAppElfSha256,
            static_cast<unsigned long>(uiController.revision()));
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"error\","
            "\"operation\":\"end\",\"status\":\"%s\",\"active\":%s}",
            leshy1::services::diagnostics::hilSessionStatusName(status),
            hilSession.active() ? "true" : "false");
    }
    reply.println(line);
}

void emitInputState(Stream& reply) {
    leshy1::ui::Pcf8574ButtonInputMetrics metrics;
    std::uint32_t queueDrops = 0;
    std::uint32_t queueHighWater = 0;
    portENTER_CRITICAL(&physicalInputMux);
    metrics = physicalButtonInput.metrics();
    queueDrops = physicalInputQueueDrops;
    queueHighWater = physicalInputQueueHighWater;
    portEXIT_CRITICAL(&physicalInputMux);
    const unsigned queueDepth = physicalInputEvents == nullptr
                                    ? 0U
                                    : static_cast<unsigned>(
                                          uxQueueMessagesWaiting(physicalInputEvents));
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.input.frontend.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"task_started\":%s,"
        "\"poll_period_ms\":%lu,\"debounce_ms\":%lu,"
        "\"button_mask\":%u,\"latest_raw\":%u,\"stable_raw\":%u,"
        "\"valid_samples\":%lu,\"read_errors\":%lu,"
        "\"raw_transitions\":%lu,\"stable_transitions\":%lu,"
        "\"press_events\":%lu,\"release_events\":%lu,"
        "\"ambiguous_presses\":%lu,\"presses\":{"
        "\"select\":%lu,\"up\":%lu,\"down\":%lu,"
        "\"left\":%lu,\"right\":%lu},"
        "\"maximum_sample_gap_ms\":%lu,\"queue_capacity\":%u,"
        "\"queue_depth\":%u,\"queue_high_water\":%lu,"
        "\"queue_drops\":%lu,"
        "\"dispatched_press_events\":%lu,"
        "\"last_dispatched_action\":\"%s\","
        "\"last_dispatched_changed\":%s,"
        "\"last_queue_latency_us\":%llu,"
        "\"maximum_queue_latency_us\":%llu,"
        "\"last_repaint_us\":%llu,"
        "\"last_end_to_end_us\":%llu,"
        "\"maximum_end_to_end_us\":%llu,"
        "\"hot_path_serial_writes\":0}",
        physicalInputTaskStarted && bootMetrics.inputDetected ? "ready" : "unavailable",
        physicalInputTaskStarted ? "true" : "false",
        static_cast<unsigned long>(Pcf8574ButtonInput::kPollPeriodMs),
        static_cast<unsigned long>(Pcf8574ButtonInput::kDebounceMs),
        static_cast<unsigned>(Pcf8574ButtonInput::kButtonMask),
        static_cast<unsigned>(metrics.latestRaw),
        static_cast<unsigned>(metrics.stableRaw),
        static_cast<unsigned long>(metrics.validSamples),
        static_cast<unsigned long>(metrics.readErrors),
        static_cast<unsigned long>(metrics.rawTransitions),
        static_cast<unsigned long>(metrics.stableTransitions),
        static_cast<unsigned long>(metrics.pressEvents),
        static_cast<unsigned long>(metrics.releaseEvents),
        static_cast<unsigned long>(metrics.ambiguousPresses),
        static_cast<unsigned long>(metrics.selectPresses),
        static_cast<unsigned long>(metrics.upPresses),
        static_cast<unsigned long>(metrics.downPresses),
        static_cast<unsigned long>(metrics.leftPresses),
        static_cast<unsigned long>(metrics.rightPresses),
        static_cast<unsigned long>(metrics.maximumSampleGapMs),
        static_cast<unsigned>(kPhysicalInputQueueCapacity), queueDepth,
        static_cast<unsigned long>(queueHighWater),
        static_cast<unsigned long>(queueDrops),
        static_cast<unsigned long>(physicalInputDispatchedPresses),
        leshy1::ui::uiActionName(lastPhysicalInputAction),
        lastPhysicalInputChanged ? "true" : "false",
        static_cast<unsigned long long>(lastPhysicalInputQueueUs),
        static_cast<unsigned long long>(maximumPhysicalInputQueueUs),
        static_cast<unsigned long long>(lastPhysicalInputRenderUs),
        static_cast<unsigned long long>(lastPhysicalInputEndToEndUs),
        static_cast<unsigned long long>(maximumPhysicalInputEndToEndUs));
    reply.println(line);
}

