anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitSelfTestReport(Stream& reply) {
    const SelfTestReport& report = selfTestController.report();
    const std::uint32_t radioTxCommands =
        shieldReceiverProbeReport.radioTxCommands +
        fullGuidedNrf24Report.txModeEntries +
        fullGuidedNrf24Report.txPayloadCommands +
        fullGuidedCc1101Report.txStrobes +
        fullGuidedCc1101OokReport.txStrobes +
        fullGuidedCc1101FskReport.txStrobes;
    auto& line = diagnosticJson;
    line[0] = '\0';
    const int prefix = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.self_test.report.v1\",\"kind\":\"report\","
        "\"schema_version\":%u,\"plan_version\":%u,"
        "\"firmware_version\":\"%s\",\"app_elf_sha256\":\"%s\","
        "\"board_profile\":\"%s\",\"mode\":\"%s\",\"status\":\"%s\","
        "\"sequence\":%lu,\"started_us\":%llu,\"duration_us\":%llu,"
        "\"read_only\":%s,\"cancelled\":%s,"
        "\"passed\":%u,\"failed\":%u,\"blocked\":%u,"
        "\"not_applicable\":%u,"
        "\"side_effects\":{\"radio_tx_commands\":%lu,"
        "\"storage_write_commands\":%lu,"
        "\"storage_write_bytes\":%llu,"
        "\"product_storage_write_commands\":0,"
        "\"buzzer_activations\":0},"
        "\"facts\":{\"build_identity_present\":%s,"
        "\"profile_matched\":%s,\"display_ready\":%s,"
        "\"touch_frontend_ready\":%s,"
        "\"input_frontend_ready\":%s,\"input_queue_healthy\":%s,"
        "\"buzzer_inactive\":%s,\"resource_scope_clean\":%s,"
        "\"heap_free\":%lu,\"heap_minimum\":%lu,"
        "\"heap_free_floor\":%lu,\"heap_minimum_floor\":%lu,"
        "\"heap_floor\":%lu,"
        "\"input_queue_drops\":%lu,\"run_resource_mask\":%lu,"
        "\"persistent_survey_ready\":%s,\"passive_ble_ready\":%s,"
        "\"passive_wifi_capture_ready\":%s,"
        "\"enrolled_storage_ready\":%s,"
        "\"persistent_library_ready\":%s,"
        "\"persistent_wifi_capture_ready\":%s,"
        "\"gps_declared\":%s,\"pn532_declared\":%s,"
        "\"ir_declared\":%s,"
        "\"shield_receivers_applicable\":%s,"
        "\"shield_receiver_probe_complete\":%s,"
        "\"shield_receiver_probe_passed\":%s,"
        "\"nrf24_spectrum_exercise_complete\":%s,"
        "\"nrf24_spectrum_exercise_passed\":%s,"
        "\"cc1101_spectrum_exercise_complete\":%s,"
        "\"cc1101_spectrum_exercise_passed\":%s,"
        "\"subghz_ook_exercise_complete\":%s,"
        "\"subghz_ook_exercise_passed\":%s,"
        "\"subghz_fsk_exercise_complete\":%s,"
        "\"subghz_fsk_exercise_passed\":%s,"
        "\"infrared_receiver_exercise_complete\":%s,"
        "\"infrared_receiver_exercise_passed\":%s,"
        "\"persistent_recovery_audit_complete\":%s,"
        "\"persistent_recovery_audit_passed\":%s,"
        "\"library_export_audit_complete\":%s,"
        "\"library_export_audit_passed\":%s,"
        "\"capture_pcap_audit_complete\":%s,"
        "\"capture_pcap_audit_applicable\":%s,"
        "\"capture_pcap_audit_passed\":%s,"
        "\"disposable_commit_complete\":%s,"
        "\"disposable_commit_passed\":%s,"
        "\"disposable_remount_complete\":%s,"
        "\"disposable_remount_passed\":%s,"
        "\"disposable_export_complete\":%s,"
        "\"disposable_export_passed\":%s,"
        "\"disposable_cleanup_complete\":%s,"
        "\"disposable_cleanup_passed\":%s},"
        "\"checks\":[",
        static_cast<unsigned>(SelfTestReport::kSchemaVersion),
        static_cast<unsigned>(SelfTestReport::kPlanVersion), LESHY1_VERSION,
        runningAppElfSha256, BoardProfile::kId,
        leshy1::apps::self_test::selfTestModeName(report.mode),
        leshy1::apps::self_test::selfTestResultStatusName(report.status),
        static_cast<unsigned long>(report.sequence),
        static_cast<unsigned long long>(report.startedUs),
        static_cast<unsigned long long>(report.durationUs),
        report.readOnly ? "true" : "false",
        report.cancelled ? "true" : "false",
        static_cast<unsigned>(report.passed),
        static_cast<unsigned>(report.failed),
        static_cast<unsigned>(report.blocked),
        static_cast<unsigned>(report.notApplicable),
        static_cast<unsigned long>(radioTxCommands),
        static_cast<unsigned long>(
            report.mode == SelfTestMode::FullGuided
                ? report.facts.disposableStorageWriteCalls : 0),
        static_cast<unsigned long long>(
            report.mode == SelfTestMode::FullGuided
                ? report.facts.disposableStorageWriteBytes : 0),
        report.facts.buildIdentityPresent ? "true" : "false",
        report.facts.profileMatched ? "true" : "false",
        report.facts.displayReady ? "true" : "false",
        report.facts.touchFrontendReady ? "true" : "false",
        report.facts.inputFrontendReady ? "true" : "false",
        report.facts.inputQueueHealthy ? "true" : "false",
        report.facts.buzzerInactive ? "true" : "false",
        report.facts.resourceScopeClean ? "true" : "false",
        static_cast<unsigned long>(report.facts.heapFree),
        static_cast<unsigned long>(report.facts.heapMinimum),
        static_cast<unsigned long>(report.facts.heapFreeFloor),
        static_cast<unsigned long>(report.facts.heapMinimumFloor),
        // Compatibility alias for report-v1 readers. New readers must use
        // the two explicit floors above.
        static_cast<unsigned long>(report.facts.heapMinimumFloor),
        static_cast<unsigned long>(report.facts.inputQueueDrops),
        static_cast<unsigned long>(report.facts.activeResources),
        report.facts.persistentSurveyReady ? "true" : "false",
        report.facts.passiveBleReady ? "true" : "false",
        report.facts.passiveWifiCaptureReady ? "true" : "false",
        report.facts.enrolledStorageReady ? "true" : "false",
        report.facts.persistentLibraryReady ? "true" : "false",
        report.facts.persistentWifiCaptureReady ? "true" : "false",
        report.facts.gpsDeclared ? "true" : "false",
        report.facts.pn532Declared ? "true" : "false",
        report.facts.irDeclared ? "true" : "false",
        report.facts.shieldReceiversApplicable ? "true" : "false",
        report.facts.shieldReceiverProbeComplete ? "true" : "false",
        report.facts.shieldReceiverProbePassed ? "true" : "false",
        report.facts.nrf24SpectrumExerciseComplete ? "true" : "false",
        report.facts.nrf24SpectrumExercisePassed ? "true" : "false",
        report.facts.cc1101SpectrumExerciseComplete ? "true" : "false",
        report.facts.cc1101SpectrumExercisePassed ? "true" : "false",
        report.facts.subGhzOokExerciseComplete ? "true" : "false",
        report.facts.subGhzOokExercisePassed ? "true" : "false",
        report.facts.subGhzFskExerciseComplete ? "true" : "false",
        report.facts.subGhzFskExercisePassed ? "true" : "false",
        report.facts.infraredReceiverExerciseComplete ? "true" : "false",
        report.facts.infraredReceiverExercisePassed ? "true" : "false",
        report.facts.persistentRecoveryAuditComplete ? "true" : "false",
        report.facts.persistentRecoveryAuditPassed ? "true" : "false",
        report.facts.libraryExportAuditComplete ? "true" : "false",
        report.facts.libraryExportAuditPassed ? "true" : "false",
        report.facts.capturePcapAuditComplete ? "true" : "false",
        report.facts.capturePcapAuditApplicable ? "true" : "false",
        report.facts.capturePcapAuditPassed ? "true" : "false",
        report.facts.disposableCommitComplete ? "true" : "false",
        report.facts.disposableCommitPassed ? "true" : "false",
        report.facts.disposableRemountComplete ? "true" : "false",
        report.facts.disposableRemountPassed ? "true" : "false",
        report.facts.disposableExportComplete ? "true" : "false",
        report.facts.disposableExportPassed ? "true" : "false",
        report.facts.disposableCleanupComplete ? "true" : "false",
        report.facts.disposableCleanupPassed ? "true" : "false");
    if (prefix < 0 || static_cast<std::size_t>(prefix) >= sizeof(line)) {
        reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                      "\"kind\":\"error\",\"reason\":\"format_failed\"}");
        return;
    }
    std::size_t used = static_cast<std::size_t>(prefix);
    for (std::size_t index = 0; index < report.checkCount; ++index) {
        const auto& check = report.checks[index];
        const int written = std::snprintf(
            line + used, sizeof(line) - used,
            "%s{\"id\":\"%s\",\"status\":\"%s\"}",
            index == 0 ? "" : ",", check.id == nullptr ? "missing" : check.id,
            leshy1::apps::self_test::selfTestResultStatusName(check.status));
        if (written < 0 || static_cast<std::size_t>(written) >= sizeof(line) - used) {
            reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                          "\"kind\":\"error\",\"reason\":\"format_failed\"}");
            return;
        }
        used += static_cast<std::size_t>(written);
    }
    const int suffix = std::snprintf(
        line + used, sizeof(line) - used,
        "],\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    if (suffix < 0 || static_cast<std::size_t>(suffix) >= sizeof(line) - used) {
        reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                      "\"kind\":\"error\",\"reason\":\"format_failed\"}");
        return;
    }
    reply.println(line);
}

