anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitNrf24SpectrumReport(Stream& reply) {
    const auto& report = nrf24SpectrumReport;
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.nrf24.spectrum.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"display_mode\":\"%s\",\"metric\":\"%s\","
        "\"traffic_semantics\":\"activity_above_baseline\","
        "\"history_rows\":%u,"
        "\"waterfall_cadence\":\"receiver_sweep\","
        "\"waterfall_fill_target_us\":0,"
        "\"waterfall_row_period_us\":0,\"waterfall_full\":%s,"
        "\"waterfall_fill_elapsed_us\":%llu,"
        "\"waterfall_rows_emitted\":%lu,"
        "\"waterfall_measurements_consumed\":%lu,"
        "\"waterfall_measurements_skipped\":%lu,"
        "\"waterfall_source_sweeps\":%lu,"
        "\"timing\":{\"row_interval_total_us\":%llu,"
        "\"row_interval_max_us\":%llu,\"row_push_total_us\":%llu,"
        "\"row_push_max_us\":%llu,\"row_render_total_us\":%llu,"
        "\"row_render_max_us\":%llu,\"row_service_max_us\":%llu,"
        "\"nrf_chunk_max_us\":%llu,\"loop_interval_total_us\":%llu,"
        "\"loop_interval_max_us\":%llu,\"loop_count\":%llu,"
        "\"touch_poll_total_us\":%llu,\"touch_poll_max_us\":%llu,"
        "\"touch_poll_count\":%llu},"
        "\"state\":\"%s\",\"status\":\"%s\","
        "\"range_mhz\":[2402,2484],\"channels\":%u,\"dwell_us\":%u,"
        "\"modules\":%u,\"active_slot_mask\":%u,\"chunks\":%lu,"
        "\"all_available_antennas\":true,"
        "\"slot3_receive_enabled\":%s,"
        "\"sweeps\":%lu,\"total_hits\":%llu,"
        "\"active_bins\":%u,\"peak_channel\":%u,\"peak_mhz\":%u,"
        "\"rx_only\":%s,\"volatile\":true,\"adapter_active\":%s,"
        "\"profile_declared\":%s,\"nrf_slot3_gated\":%s,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"wire\":{\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"receive_ce_high_events\":%lu},"
        "\"side_effects\":{\"tx_mode_entries\":%lu,"
        "\"tx_payload_commands\":%lu,\"cc_command_strobes\":%lu,"
        "\"storage_writes\":0},\"read_only_query\":true,"
        "\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        rfSpectrumViewName(rfSpectrumView),
        leshy1::apps::spectrum::spectrumDisplayModeName(
            spectrumViewport.mode()),
        leshy1::apps::spectrum::nrf24SpectrumMetricName(
            nrf24SpectrumController.metric()),
        static_cast<unsigned>(spectrumViewport.rowsStored()),
        spectrumWaterfallCompletedUs != 0 ? "true" : "false",
        static_cast<unsigned long long>(spectrumWaterfallFillElapsedUs()),
        static_cast<unsigned long>(spectrumWaterfallRowsEmitted),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsConsumed),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsSkipped),
        static_cast<unsigned long>(
            nrf24SpectrumController.sweeps() >=
                    spectrumWaterfallSourceSweepBaseline
                ? nrf24SpectrumController.sweeps() -
                      spectrumWaterfallSourceSweepBaseline
                : 0U),
        static_cast<unsigned long long>(spectrumWaterfallRowIntervalTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallRowIntervalMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallPushTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallPushMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallRenderTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallRenderMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallServiceMaxUs),
        static_cast<unsigned long long>(nrf24SpectrumChunkMaxUs),
        static_cast<unsigned long long>(spectrumLoopIntervalTotalUs),
        static_cast<unsigned long long>(spectrumLoopIntervalMaxUs),
        static_cast<unsigned long long>(spectrumLoopCount),
        static_cast<unsigned long long>(spectrumTouchPollTotalUs),
        static_cast<unsigned long long>(spectrumTouchPollMaxUs),
        static_cast<unsigned long long>(spectrumTouchPollCount),
        leshy1::apps::spectrum::nrf24SpectrumViewStateName(
            nrf24SpectrumController.state()),
        leshy1::drivers::radio::nrf24PassiveSpectrumStatusName(report.status),
        static_cast<unsigned>(Nrf24SpectrumController::kChannelCount),
        static_cast<unsigned>(
            leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan().dwellUs),
        static_cast<unsigned>(nrf24SpectrumController.modules()),
        static_cast<unsigned>(report.activeSlotMask),
        static_cast<unsigned long>(report.chunks),
        (report.activeSlotMask & 0x04U) != 0 ? "true" : "false",
        static_cast<unsigned long>(nrf24SpectrumController.sweeps()),
        static_cast<unsigned long long>(nrf24SpectrumController.totalHits()),
        static_cast<unsigned>(nrf24SpectrumController.activeBins()),
        static_cast<unsigned>(nrf24SpectrumController.hottestChannel()),
        static_cast<unsigned>(2400U +
            nrf24SpectrumController.hottestChannel()),
        report.rxOnly ? "true" : "false",
        boardNrf24Spectrum.active() ? "true" : "false",
        report.profileDeclared ? "true" : "false",
        report.nrfSlot3Gated ? "true" : "false",
        report.gpio21StableHigh ? "true" : "false",
        report.cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(report.registerReads),
        static_cast<unsigned long>(report.registerWrites),
        static_cast<unsigned long>(report.spiBytesClocked),
        static_cast<unsigned long>(report.receiveCeHighEvents),
        static_cast<unsigned long>(report.txModeEntries),
        static_cast<unsigned long>(report.txPayloadCommands),
        static_cast<unsigned long>(report.ccCommandStrobes),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitNrf24FinderReport(Stream& reply) {
    const auto& report = nrf24SpectrumReport;
    std::uint8_t nonzeroBins = 0;
    for (std::size_t index = 0;
         index < Nrf24SignalFinder::kChannelCount; ++index) {
        if (nrf24SignalFinder.strength(index) != 0U) ++nonzeroBins;
    }
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.nrf24.signal-finder.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"state\":\"%s\",\"calibrated\":%s,"
        "\"found\":%s,\"frequency_mhz\":%u,\"nrf_channel\":%u,"
        "\"nearest_wifi_channel\":%u,\"response\":%u,"
        "\"response_threshold\":%u,\"response_bins\":%u,"
        "\"windows\":%lu,\"calibration_windows\":%u,"
        "\"sweeps_in_window\":%u,\"sweeps_per_window\":%u,"
        "\"baseline_semantics\":\"minimum_of_two_ambient_windows\","
        "\"response_semantics\":\"local_rise_above_baseline\","
        "\"modules\":%u,\"active_slot_mask\":%u,"
        "\"all_available_antennas\":true,\"rx_only\":%s,"
        "\"adapter_active\":%s,\"volatile\":true,"
        "\"side_effects\":{\"tx_mode_entries\":%lu,"
        "\"tx_payload_commands\":%lu,\"cc_command_strobes\":%lu,"
        "\"storage_writes\":0},\"read_only_query\":true,"
        "\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        rfSpectrumViewName(rfSpectrumView),
        leshy1::apps::spectrum::nrf24SignalFinderStateName(
            nrf24SignalFinder.state()),
        nrf24SignalFinder.calibrated() ? "true" : "false",
        nrf24SignalFinder.found() ? "true" : "false",
        static_cast<unsigned>(
            nrf24SignalFinder.found()
                ? nrf24SignalFinder.strongestFrequencyMhz() : 0U),
        static_cast<unsigned>(
            nrf24SignalFinder.found()
                ? nrf24SignalFinder.strongestChannel() : 0U),
        static_cast<unsigned>(nrf24SignalFinder.nearestWifiChannel()),
        static_cast<unsigned>(nrf24SignalFinder.strongestRise()),
        static_cast<unsigned>(Nrf24SignalFinder::kDetectionRise),
        static_cast<unsigned>(nonzeroBins),
        static_cast<unsigned long>(nrf24SignalFinder.windows()),
        static_cast<unsigned>(nrf24SignalFinder.calibrationWindows()),
        static_cast<unsigned>(nrf24SignalFinder.sweepsInWindow()),
        static_cast<unsigned>(Nrf24SignalFinder::kSweepsPerWindow),
        static_cast<unsigned>(nrf24SignalFinder.modules()),
        static_cast<unsigned>(report.activeSlotMask),
        report.rxOnly ? "true" : "false",
        boardNrf24Spectrum.active() ? "true" : "false",
        static_cast<unsigned long>(report.txModeEntries),
        static_cast<unsigned long>(report.txPayloadCommands),
        static_cast<unsigned long>(report.ccCommandStrobes),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitCc1101FinderReport(Stream& reply) {
    const auto& report = cc1101SpectrumReport;
    std::uint16_t nonzeroBins = 0;
    for (std::size_t index = 0;
         index < Cc1101SignalFinder::kBinCount; ++index) {
        if (cc1101SignalFinder.strength(index) != 0U) ++nonzeroBins;
    }
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.cc1101.signal-finder.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"state\":\"%s\",\"calibrated\":%s,"
        "\"found\":%s,\"frequency_khz\":%lu,\"band_hint\":\"%s\","
        "\"response_db\":%u,\"response_threshold_db\":%u,"
        "\"response_bins\":%u,\"bins\":%u,\"step_khz\":%lu,"
        "\"tuning_windows_khz\":[[300000,348000],[387000,464000],"
        "[779000,928000]],\"sweeps\":%lu,"
        "\"calibration_passes\":%u,\"next_bin\":%u,"
        "\"baseline_semantics\":\"median_of_three_ambient_sweeps\","
        "\"response_semantics\":\"local_rssi_rise_after_common_drift\","
        "\"rx_only\":%s,\"adapter_active\":%s,\"volatile\":true,"
        "\"wire\":{\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"command_strobes\":%lu,\"reset_strobes\":%lu,"
        "\"receive_strobes\":%lu,\"idle_strobes\":%lu},"
        "\"side_effects\":{\"rejected_strobes\":%lu,"
        "\"tx_strobes\":%lu,\"pa_table_writes\":%lu,"
        "\"fifo_writes\":%lu,\"storage_writes\":0},"
        "\"read_only_query\":true,\"current_owner\":\"%s\","
        "\"current_lease_mask\":%lu}",
        rfSpectrumViewName(rfSpectrumView),
        leshy1::apps::spectrum::cc1101SignalFinderStateName(
            cc1101SignalFinder.state()),
        cc1101SignalFinder.calibrated() ? "true" : "false",
        cc1101SignalFinder.found() ? "true" : "false",
        static_cast<unsigned long>(
            cc1101SignalFinder.found()
                ? cc1101SignalFinder.strongestFrequencyKHz() : 0U),
        cc1101SignalFinder.bandHint(),
        static_cast<unsigned>(cc1101SignalFinder.strongestRiseDb()),
        static_cast<unsigned>(Cc1101SignalFinder::kDetectionRiseDb),
        static_cast<unsigned>(nonzeroBins),
        static_cast<unsigned>(Cc1101SignalFinder::kBinCount),
        static_cast<unsigned long>(Cc1101SignalFinder::kStepKHz),
        static_cast<unsigned long>(cc1101SignalFinder.sweeps()),
        static_cast<unsigned>(cc1101SignalFinder.calibrationPasses()),
        static_cast<unsigned>(cc1101SignalFinder.nextBin()),
        report.rxOnly ? "true" : "false",
        boardCc1101Spectrum.active() ? "true" : "false",
        static_cast<unsigned long>(report.registerReads),
        static_cast<unsigned long>(report.registerWrites),
        static_cast<unsigned long>(report.commandStrobes),
        static_cast<unsigned long>(report.resetStrobes),
        static_cast<unsigned long>(report.receiveStrobes),
        static_cast<unsigned long>(report.idleStrobes),
        static_cast<unsigned long>(report.rejectedStrobes),
        static_cast<unsigned long>(report.txStrobes),
        static_cast<unsigned long>(report.paTableWrites),
        static_cast<unsigned long>(report.fifoWrites),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitCc1101SpectrumReport(Stream& reply) {
    const auto& report = cc1101SpectrumReport;
    const Cc1101PassiveSpectrumPlan plan = cc1101SpectrumController.plan();
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.cc1101.spectrum.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"display_mode\":\"%s\",\"history_rows\":%u,"
        "\"waterfall_cadence\":\"receiver_sweep\","
        "\"waterfall_fill_target_us\":0,"
        "\"waterfall_row_period_us\":0,\"waterfall_full\":%s,"
        "\"waterfall_fill_elapsed_us\":%llu,"
        "\"waterfall_rows_emitted\":%lu,"
        "\"waterfall_measurements_consumed\":%lu,"
        "\"waterfall_measurements_skipped\":%lu,"
        "\"waterfall_source_sweeps\":%lu,"
        "\"state\":\"%s\",\"status\":\"%s\","
        "\"band\":\"%s\",\"range_khz\":[%lu,%lu],\"bins\":%u,"
        "\"settle_us\":%u,\"ready_timeout_us\":%u,"
        "\"partnum\":%u,\"version\":%u,\"sweeps\":%lu,"
        "\"samples\":%llu,\"adapter_samples\":%lu,\"next_bin\":%u,"
        "\"latest_rssi_dbm\":%d,\"peak_khz\":%lu,"
        "\"peak_rssi_dbm\":%d,\"rx_only\":%s,\"volatile\":true,"
        "\"adapter_active\":%s,\"profile_declared\":%s,"
        "\"nrf_slot3_gated\":%s,\"gpio21_stable_high\":%s,"
        "\"cleanup_complete\":%s,"
        "\"wire\":{\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"command_strobes\":%lu,"
        "\"reset_strobes\":%lu,\"receive_strobes\":%lu,"
        "\"idle_strobes\":%lu,\"receive_ready_timeouts\":%lu,"
        "\"transient_retries\":%lu,\"select_ready_timeouts\":%lu,"
        "\"recovery_attempts\":%lu,\"recoveries\":%lu},"
        "\"side_effects\":{\"rejected_strobes\":%lu,"
        "\"tx_strobes\":%lu,\"pa_table_writes\":%lu,"
        "\"fifo_writes\":%lu,\"storage_writes\":0},"
        "\"read_only_query\":true,\"current_owner\":\"%s\","
        "\"current_lease_mask\":%lu}",
        rfSpectrumKind == RfSpectrumKind::Cc1101
            ? rfSpectrumViewName(rfSpectrumView) : "none",
        leshy1::apps::spectrum::spectrumDisplayModeName(
            spectrumViewport.mode()),
        static_cast<unsigned>(spectrumViewport.rowsStored()),
        spectrumWaterfallCompletedUs != 0 ? "true" : "false",
        static_cast<unsigned long long>(spectrumWaterfallFillElapsedUs()),
        static_cast<unsigned long>(spectrumWaterfallRowsEmitted),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsConsumed),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsSkipped),
        static_cast<unsigned long>(
            cc1101SpectrumController.sweeps() >=
                    spectrumWaterfallSourceSweepBaseline
                ? cc1101SpectrumController.sweeps() -
                      spectrumWaterfallSourceSweepBaseline
                : 0U),
        leshy1::apps::spectrum::cc1101SpectrumViewStateName(
            cc1101SpectrumController.state()),
        leshy1::drivers::radio::cc1101PassiveSpectrumStatusName(
            report.status),
        leshy1::drivers::radio::cc1101SpectrumBandName(
            cc1101SpectrumController.band()),
        static_cast<unsigned long>(plan.firstKHz),
        static_cast<unsigned long>(plan.lastKHz),
        static_cast<unsigned>(Cc1101SpectrumController::kBinCount),
        static_cast<unsigned>(plan.settleUs),
        static_cast<unsigned>(plan.readyTimeoutUs),
        static_cast<unsigned>(report.partNumber),
        static_cast<unsigned>(report.version),
        static_cast<unsigned long>(cc1101SpectrumController.sweeps()),
        static_cast<unsigned long long>(cc1101SpectrumController.samples()),
        static_cast<unsigned long>(report.samples),
        static_cast<unsigned>(cc1101SpectrumController.nextBin()),
        static_cast<int>(cc1101SpectrumController.latestRssiDbm()),
        static_cast<unsigned long>(cc1101SpectrumController.peakKHz()),
        static_cast<int>(cc1101SpectrumController.peakRssiDbm()),
        report.rxOnly ? "true" : "false",
        boardCc1101Spectrum.active() ? "true" : "false",
        report.profileDeclared ? "true" : "false",
        report.nrfSlot3Gated ? "true" : "false",
        report.gpio21StableHigh ? "true" : "false",
        report.cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(report.registerReads),
        static_cast<unsigned long>(report.registerWrites),
        static_cast<unsigned long>(report.spiBytesClocked),
        static_cast<unsigned long>(report.commandStrobes),
        static_cast<unsigned long>(report.resetStrobes),
        static_cast<unsigned long>(report.receiveStrobes),
        static_cast<unsigned long>(report.idleStrobes),
        static_cast<unsigned long>(report.receiveReadyTimeouts),
        static_cast<unsigned long>(report.transientRetries),
        static_cast<unsigned long>(report.selectReadyTimeouts),
        static_cast<unsigned long>(report.recoveryAttempts),
        static_cast<unsigned long>(report.recoveries),
        static_cast<unsigned long>(report.rejectedStrobes),
        static_cast<unsigned long>(report.txStrobes),
        static_cast<unsigned long>(report.paTableWrites),
        static_cast<unsigned long>(report.fifoWrites),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitWifiNetworkDetailState(Stream& reply) {
    const std::size_t catalogIndex =
        wifiNetworkCatalog.indexOfIdentity(wifiNetworkDetail);
    const bool live = wifiProductView == WifiProductView::NetworkDetail &&
        catalogIndex < wifiNetworkCatalog.size();
    const Observation& network = *liveWifiNetworkDetail();
    const WifiNetworkSignalStats& signal = *liveWifiNetworkSignal();
    const auto& facts = network.wifiNetwork;
    char vendor[WifiOuiDatabase::kNameSize + 1U] = {};
    const bool vendorKnown = network.identityLength == 6U &&
        wifiOuiDatabase.lookup(network.identity.data(), vendor,
                               sizeof(vendor));
    for (char* byte = vendor; *byte != '\0'; ++byte) {
        const bool safe = (*byte >= 'A' && *byte <= 'Z') ||
            (*byte >= 'a' && *byte <= 'z') ||
            (*byte >= '0' && *byte <= '9') || *byte == ' ' ||
            *byte == '.' || *byte == '-' || *byte == '_' ||
            *byte == '/' || *byte == '&' || *byte == '(' || *byte == ')';
        if (!safe) *byte = '?';
    }
    char country[3] = {};
    if (facts.countryCode[0] >= 'A' && facts.countryCode[0] <= 'Z' &&
        facts.countryCode[1] >= 'A' && facts.countryCode[1] <= 'Z') {
        country[0] = facts.countryCode[0];
        country[1] = facts.countryCode[1];
    }
    auto& line = diagnosticJson;
    line[0] = '\0';
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.network_detail.v1\",\"kind\":\"state\","
        "\"active\":%s,\"passive\":true,\"active_probe_allowed\":false,"
        "\"identity_hash\":%lu,"
        "\"ssid_known\":%s,\"hidden_resolutions\":%lu,"
        "\"vendor_known\":%s,\"vendor\":\"%s\","
        "\"facts_known\":%s,\"authentication\":\"%s\","
        "\"pairwise_cipher\":\"%s\",\"group_cipher\":\"%s\","
        "\"channel_width\":\"%s\",\"phy_mask\":%u,"
        "\"wps\":%s,\"ftm_responder\":%s,\"ftm_initiator\":%s,"
        "\"receive_antenna\":%u,\"country\":\"%s\","
        "\"country_start_channel\":%u,\"country_channel_count\":%u,"
        "\"country_max_tx_power_dbm\":%d,\"bss_color_known\":%s,"
        "\"bss_color\":%u,\"vht_center_channel_1\":%u,"
        "\"vht_center_channel_2\":%u,\"channel\":%u,"
        "\"frequency_khz\":%lu,\"rssi_dbm\":%d,"
        "\"signal_samples\":%u,\"minimum_rssi_dbm\":%d,"
        "\"maximum_rssi_dbm\":%d,\"rssi_trend_db\":%d,"
        "\"catalog_revision\":%lu}",
        live ? "true" : "false",
        static_cast<unsigned long>(wifiNetworkNavigationOrder.identityHash(
            wifiNetworkCatalog, wifiNetworkSelection)),
        network.labelLength != 0U ? "true" : "false",
        static_cast<unsigned long>(wifiNetworkCatalog.hiddenResolutions()),
        vendorKnown ? "true" : "false", vendor,
        facts.present ? "true" : "false",
        leshy1::drivers::wifi::wifiAuthenticationName(facts.authentication),
        leshy1::drivers::wifi::wifiCipherName(facts.pairwiseCipher),
        leshy1::drivers::wifi::wifiCipherName(facts.groupCipher),
        leshy1::drivers::wifi::wifiChannelWidthName(facts.channelWidth),
        static_cast<unsigned>(facts.phyMask), facts.wps ? "true" : "false",
        facts.ftmResponder ? "true" : "false",
        facts.ftmInitiator ? "true" : "false",
        static_cast<unsigned>(facts.receiveAntenna), country,
        static_cast<unsigned>(facts.countryStartChannel),
        static_cast<unsigned>(facts.countryChannelCount),
        static_cast<int>(facts.countryMaximumTxPowerDbm),
        facts.bssColorKnown ? "true" : "false",
        static_cast<unsigned>(facts.bssColor),
        static_cast<unsigned>(facts.vhtCenterChannel1),
        static_cast<unsigned>(facts.vhtCenterChannel2),
        static_cast<unsigned>(network.channel),
        static_cast<unsigned long>(network.frequencyKhz),
        static_cast<int>(network.rssiDbm),
        static_cast<unsigned>(signal.samples),
        static_cast<int>(signal.minimumRssiDbm),
        static_cast<int>(signal.maximumRssiDbm),
        static_cast<int>(signal.rssiTrendDb),
        static_cast<unsigned long>(wifiNetworkCatalog.revision()));
    reply.println(line);
}

