anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    appCatalog.rebuild(inventory);
    feedRuntimeSafetyWatchdog();
    renderInteractiveScreen();
    bootMetrics.interactiveReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();

    emitMetrics();
    emitInventory();
    broadcast("{\"schema\":\"leshy.boot.v1\",\"kind\":\"help\",\"commands\":["
              "\"hil.begin <session-id> <app-elf-sha256>\","
              "\"hil.end <session-id>\","
              "\"metrics\",\"inventory\",\"hardware.safe-outputs\",\"ping\","
              "\"power.state\",\"power.low-voltage-test confirm\","
              "\"power.sleep-test confirm\",\"power.sleep-test state\","
              "\"safety.state\",\"safety.watchdog-test confirm\","
              "\"safety.worker-deadline-test confirm\","
              "\"safety.worker-preparation-deadline-test confirm\","
              "\"safety.capture-store-deadline-test confirm\","
              "\"safety.capture-ir-store-deadline-test confirm\","
              "\"safety.capture-subghz-store-deadline-test confirm\","
              "\"safety.early-boot-watchdog-test confirm\","
              "\"safety.clear confirm\","
              "\"hardware.shield.receivers\","
              "\"hardware.nrf24.spectrum\","
              "\"hardware.nrf24.finder\","
              "\"hardware.cc1101.finder\","
              "\"hardware.cc1101.spectrum\","
              "\"capture.subghz.test-fixture fixed-rx-only\","
              "\"ui.state\",\"ui.key <action>\",\"survey.browser\","
              "\"wifi.network.detail\","
              "\"capture.state\",\"capture.export.pcap\","
              "\"capture.subghz.state\","
              "\"capture.subghz.export.csv\","
              "\"capture.ir.state\",\"capture.ir.export.csv\","
              "\"input.state\",\"touch.state\","
              "\"ui.touch <x> <y>\",\"touch.calibrate confirm\","
              "\"self-test.report\",\"self-test.active-rf\","
              "\"self-test.active-artifact\","
              "\"ui.capture\",\"storage.contract\",\"storage.guard\","
              "\"storage.discovery\",\"storage.mount.policy\","
              "\"storage.product.boot-recovery\","
              "\"storage.product.boot-watchdog-test confirm\","
              "\"storage.product.unenroll confirm\","
              "\"survey.product.admission\","
              "\"survey.product.test-source-unavailable once|clear\","
              "\"survey.product.test-runtime-unavailable wifi|ble|clear\","
              "\"storage.littlefs.parity disposable-ota1 <OTA1-SHA256> <run-id>\","
              "\"storage.littlefs.reset disposable-ota1 <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.littlefs.reset recover read-only <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.sd.protocol\",\"storage.sd.identification.fixture\","
              "\"storage.sd.transport.fixture\","
              "\"storage.sd.wire\","
              "\"storage.sd.identify disposable-read-only\","
              "\"storage.sd.inspect-lba0 disposable-read-only\","
              "\"storage.sd.inspect-boot disposable-read-only\","
              "\"storage.sd.inspect-fsinfo disposable-read-only\","
              "\"storage.sd.inspect-fat-reserved disposable-read-only\","
              "\"storage.sd.inspect-root-cluster disposable-read-only\","
              "\"storage.sd.readonly-mount disposable-read-only <CID32>\","
              "\"storage.product.enroll disposable-read-only <CID32>\","
              "\"storage.product.bootstrap disposable-write <CID32>\","
              "\"storage.sd.session-store disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store throughput disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store batch-throughput disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store reset disposable-write <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store recover disposable-read-only <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store power-cut disposable-write <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store power-cut-recover disposable-read-only <CID32> <run-id> <1..6>\","
              "\"survey.wifi.passive-persist disposable-write <CID32> <run-id> <1..8>\","
              "\"survey.wifi.passive-ingress measure passive-only <1..32>\","
              "\"survey.contract\",\"session.fixture\",\"session.store.fixture\","
              "\"library.fixture\",\"library.export\",\"library.capture\","
              "\"library.export.csv\",\"library.export.pcap\"]}");
}

void loop() {
    const std::uint64_t loopStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (activeReceiveSampling()) {
        if (spectrumLoopPreviousUs != 0) {
            const std::uint64_t intervalUs =
                loopStartedUs - spectrumLoopPreviousUs;
            spectrumLoopIntervalTotalUs += intervalUs;
            if (intervalUs > spectrumLoopIntervalMaxUs) {
                spectrumLoopIntervalMaxUs = intervalUs;
            }
        }
        spectrumLoopPreviousUs = loopStartedUs;
        ++spectrumLoopCount;
    }
    serviceWorkerDeadlineSupervisor();
    if (!safetySupervisor.latched()) {
        serviceProductSurveyWorker();
        serviceWifiDevicesProduct();
        serviceWifiChannelsProduct();
        serviceWifiFrameCapture();
        serviceWifiFrameCapturePersist();
        serviceSubGhzRawCapturePersist();
        serviceInfraredRawCapturePersist();
        serviceTargetsMutationWorker();
        serviceFullGuidedRfChecks();
        serviceNrf24Spectrum();
        serviceCc1101Spectrum();
        serviceCc1101Finder();
        serviceSubGhzRawCapture();
        serviceInfraredCapture();
        serviceSpectrumWaterfallCadence();
    }
    const auto rawCaptureState = subGhzRawCapture.stats().state;
    const auto infraredState = infraredCapture.stats().state;
    const bool rawPulseTimingCritical =
        rawCaptureState == SubGhzRawCaptureState::Capturing ||
        infraredState == InfraredCaptureState::Capturing;
    const bool rawReceiveActive = rawPulseTimingCritical ||
        rawCaptureState == SubGhzRawCaptureState::Waiting ||
        infraredState == InfraredCaptureState::Waiting;
    // Once a burst starts, even a large diagnostic response would become a
    // fake pulse. Commands remain buffered by USB/UART and are answered after
    // the terminal gap; no evidence path is allowed to perturb the waveform.
    if (!rawPulseTimingCritical) {
        poll(Serial, usbCommand, usbLength, sizeof(usbCommand));
        poll(Serial0, uartCommand, uartLength, sizeof(uartCommand));
    }
    TouchPoint touchPress;
    const std::uint64_t touchStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    // The RAW page has no touch action. Avoid sharing the display/touch SPI
    // path while the receiver is waiting for or timing a burst.
    const bool touchPressed = !safetySupervisor.latched() &&
        !rawReceiveActive &&
        boardTouchInput.poll(millis(), &touchPress);
    const std::uint64_t touchElapsedUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - touchStartedUs;
    feedRuntimeSafetyWatchdog();
    if (activeReceiveSampling()) {
        spectrumTouchPollTotalUs += touchElapsedUs;
        if (touchElapsedUs > spectrumTouchPollMaxUs) {
            spectrumTouchPollMaxUs = touchElapsedUs;
        }
        ++spectrumTouchPollCount;
    }
    if (touchPressed) {
        dispatchTouchPoint(touchPress);
    }
    PhysicalInputEvent inputEvent;
    // Preserve the 0.x one-key/one-repaint order even when presses are queued.
    if (!rawPulseTimingCritical && physicalInputEvents != nullptr &&
        xQueueReceive(physicalInputEvents, &inputEvent, 0) == pdTRUE) {
        const std::uint64_t dequeuedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputQueueUs = dequeuedUs >= inputEvent.atUs
            ? dequeuedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputQueueUs > maximumPhysicalInputQueueUs) {
            maximumPhysicalInputQueueUs = lastPhysicalInputQueueUs;
        }
        lastInputRaw = inputEvent.raw;
        bootMetrics.inputRaw = inputEvent.raw;
        const bool changed = applyUiAction(inputEvent.action, false);
        lastPhysicalInputAction = inputEvent.action;
        lastPhysicalInputChanged = changed;
        ++physicalInputDispatchedPresses;
        if (changed) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        lastPhysicalInputRenderUs = changed ? lastUiRenderUs : 0;
        const std::uint64_t finishedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputEndToEndUs = finishedUs >= inputEvent.atUs
            ? finishedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputEndToEndUs > maximumPhysicalInputEndToEndUs) {
            maximumPhysicalInputEndToEndUs = lastPhysicalInputEndToEndUs;
        }
        portENTER_CRITICAL(&physicalInputMux);
        lastInputRaw = physicalButtonInput.stableRaw();
        portEXIT_CRITICAL(&physicalInputMux);
        bootMetrics.inputRaw = lastInputRaw;
    }
    if (activeReceiveSampling()) {
        // The receiver itself now clocks the waterfall: yield to the RTOS but
        // do not add an artificial per-bin delay to a physical sweep.
        yield();
    } else {
        delay(2);
    }
}
